(() => {
  "use strict";

  const SVG_NS = "http://www.w3.org/2000/svg";
  const VIEW = { left: 40, right: 146, bottom: -10, top: 56 };
  const MAP_LAYOUT_SCALE = 52;
  const MAP_FOCUS = { lon: 112, lat: 31 };
  const MIN_ZOOM = 0.2;
  const MAX_ZOOM = 48;
  const SEGMENT_FOCUS_MAX_ZOOM = 4;
  const STATION_LABEL_MIN_ZOOM = 0.22;
  const STATION_RADII = { ".railway-hit": 18, ".railway-halo": 9, ".railway-core": 4 };
  const LABEL_DENSE_KM = 7;
  const CLOSE_REPLACE_KM = 8;
  const KEPT_NEAR_IDS = new Set(["jingguang_01", "jingha_beijing", "jingguang_fengtai"]);
  const CITY_BY_NAME = {
    北京南: "北京",
    亦庄: "北京",
    武清: "天津",
    天津: "天津",
    廊坊: "廊坊",
    天津南: "天津",
    北京西: "北京",
    北京丰台: "北京",
    北京大兴: "北京",
    大兴机场: "北京",
    固安东: "固安",
    霸州北: "霸州",
    双辛: "高碑店",
    雄安: "雄安",
    涿州东: "涿州",
    高碑店东: "高碑店",
    保定东: "保定",
    定州东: "定州",
    正定机场: "正定",
    石家庄: "石家庄",
    北京通州: "北京",
    燕郊: "三河",
    大厂: "大厂",
    香河: "香河",
    宝坻: "天津",
    玉田南: "玉田",
    唐山西: "唐山",
    唐山: "唐山",
    北京北: "北京",
    清河: "北京",
    沙河: "北京",
    昌平: "北京",
    八达岭长城: "北京",
    东花园北: "怀来",
    怀来: "怀来",
    下花园北: "张家口",
    宣化北: "张家口",
    张家口: "张家口",
    北京站: "北京",
    北京朝阳: "北京",
    顺义西: "北京",
    怀柔南: "北京",
    密云: "北京",
    兴隆县西: "兴隆",
    安匠: "承德",
    承德南: "承德",
    承德县北: "承德县",
    平泉北: "平泉",
    牛河梁: "凌源",
    喀左: "喀左",
    奈林皋: "朝阳",
    辽宁朝阳: "朝阳",
    北票: "北票",
    乌兰木图: "阜新",
    阜新: "阜新",
    黑山北: "黑山",
    新民北: "新民",
    沈阳西: "沈阳",
    沈阳: "沈阳",
    建平: "建平",
    宁城: "宁城",
    平庄: "赤峰",
    赤峰: "赤峰",
    昌平北: "北京",
    怀柔北: "北京",
    古北口: "北京",
    滦平: "滦平",
    隆化: "隆化",
    四合永: "隆化",
    朝阳地: "赤峰",
    五十家子: "赤峰",
    三把火: "赤峰",
    赤峰南: "赤峰",
    军粮城北: "天津",
    塘沽: "天津",
    滨海: "天津",
    滨海西: "天津",
    滨海北: "天津",
    天津西: "天津",
    胜芳: "霸州",
    安次: "廊坊",
    永清东: "永清",
    团泊北: "天津",
    文安北: "文安",
    沧州西: "沧州",
    德州东: "德州",
    济南西: "济南",
    滨海东: "天津",
    滨海南: "天津",
    黄骅北: "黄骅",
    海兴西: "海兴",
    无棣: "无棣",
    滨州: "滨州",
    惠民: "惠民",
    商河: "商河",
    济阳: "济阳",
    遥墙机场: "济南",
    济南东: "济南",
    东营南: "东营",
    寿光东: "寿光",
    潍坊北: "潍坊",
    丰润西: "唐山",
    团瓢庄: "遵化",
    半壁山: "兴隆",
    承德西: "承德",
    滦平东: "滦平",
    丰宁: "丰宁",
    赤城: "赤城",
    张家口南: "张家口",
    滦河: "滦州",
    昌黎: "昌黎",
    北戴河: "秦皇岛",
    秦皇岛: "秦皇岛",
    山海关: "秦皇岛",
    东戴河: "绥中",
    绥中北: "绥中",
    兴城西: "兴城",
    葫芦岛北: "葫芦岛",
    锦州南: "锦州",
    南堡北: "唐山",
    唐海南: "唐山",
    曹妃甸东: "唐山",
    雄安城际: "雄安",
    小里: "徐水",
    蠡县西: "蠡县",
    安国东: "安国",
    无极: "无极",
    正定东: "正定",
    裕华东: "石家庄",
    保定南: "保定",
    望都北: "望都",
    唐县: "唐县",
    曲阳: "曲阳",
    阜平: "阜平",
    五台山: "五台",
    五台县: "五台",
    定襄北: "定襄",
    忻州西: "忻州",
    阳曲西: "阳曲",
    太原南: "太原",
    原平西: "原平",
    雁门关: "代县",
    朔州东: "朔州",
    山阴南: "山阴",
    应县西: "应县",
    怀仁东: "怀仁",
    大同南: "大同",
    涞源: "涞源",
    灵丘: "灵丘",
    恒山: "浑源",
    任丘西: "任丘",
    肃宁河间: "肃宁",
    深州东: "深州",
    衡水南: "衡水",
    枣强南: "枣强",
    清河西: "清河",
    临清东: "临清",
    聊城西: "聊城",
    阳谷东: "阳谷",
    台前东: "台前",
    梁山: "梁山",
    郓城: "郓城",
    菏泽东: "菏泽",
    曹县西: "曹县",
    商丘: "商丘",
    商丘东: "商丘",
    芦庙: "亳州",
    亳州南: "亳州",
    古城东: "太和",
    太和东: "太和",
    高辛: "虞城",
    柘城东: "柘城",
    四通: "太康",
    淮阳北: "周口",
    商水南: "商水",
    上蔡东: "上蔡",
    鹿泉: "鹿泉",
    井陉北: "井陉",
    阳泉北: "盂县",
    石家庄东: "石家庄",
    藁城南: "藁城",
    辛集南: "辛集",
    衡水北: "衡水",
    景州: "景县",
    平原东: "平原",
    禹城东: "禹城",
    齐河: "齐河",
    高邑西: "高邑",
    邢台东: "邢台",
    邯郸东: "邯郸",
    安阳东: "安阳",
    鹤壁东: "鹤壁",
    新乡东: "新乡",
    郑州东: "郑州",
    行唐: "行唐",
    西合营: "蔚县",
    阳原: "阳原",
    武邑: "武邑",
    阜城南: "阜城",
    交河: "泊头",
    泊头西: "泊头",
    泊头东: "泊头",
    沧州东: "沧州",
    黄骅南: "黄骅",
    黄骅东: "黄骅",
    黄骅港: "黄骅",
    怀安: "怀安",
    天镇: "天镇",
    阳高南: "阳高",
    兴和北: "兴和",
    乌兰察布: "乌兰察布",
    丰镇北: "丰镇",
    平鲁: "平鲁",
    右玉: "右玉",
    和林格尔: "和林格尔",
    盛乐国际机场: "和林格尔",
    呼和浩特东: "呼和浩特",
    晋中: "晋中",
    太谷东: "太谷",
    榆社西: "榆社",
    武乡: "武乡",
    襄垣东: "襄垣",
    长治东: "长治",
    太谷西: "太谷",
    祁县东: "祁县",
    平遥古城: "平遥",
    介休东: "介休",
    灵石东: "灵石",
    霍州东: "霍州",
    洪洞西: "洪洞",
    临汾西: "临汾",
    襄汾西: "襄汾",
    侯马西: "侯马",
    潇河: "清徐",
    文水: "文水",
    杏花村: "汾阳",
    中阳南: "中阳",
    吕梁南: "吕梁",
    柳林西: "柳林",
    绥德西: "绥德",
    米脂北: "米脂",
    榆林南: "榆林",
    鄂尔多斯: "鄂尔多斯",
    达拉特旗: "达拉特旗",
    包头东: "包头",
    包头: "包头",
    子洲: "子洲",
    靖边: "靖边",
    定边: "定边",
    盐池: "盐池",
    红寺堡: "红寺堡",
    中宁: "中宁",
    太子城: "张家口",
    崇礼: "张家口",
    张北: "张北",
    沽源: "沽源",
    太仆寺旗: "太仆寺旗",
    塞北管理区: "张家口",
    黑城子: "正蓝旗",
    正蓝旗: "正蓝旗",
    桑根达来北: "正蓝旗",
    锡林浩特: "锡林浩特",
    黎城南: "黎城",
    涉县南: "涉县",
    武安南: "武安",
    邯郸南: "邯郸",
    成安: "成安",
    魏县北: "魏县",
    大名北: "大名",
    馆陶南: "馆陶",
    冠县南: "冠县",
    长治南: "长治",
    高平东: "高平",
    晋城东: "晋城",
    焦作西: "焦作",
    焦作: "焦作",
    屯留: "屯留",
    安泽: "安泽",
    浮山: "浮山",
    闻喜西: "闻喜",
    运城北: "运城",
    永济北: "永济",
    大荔: "大荔",
    渭南北: "渭南",
    西安北: "西安",
    新绛南: "新绛",
    稷山北: "稷山",
    河津: "河津",
    韩城东: "韩城",
    韩城南: "韩城",
    合阳东: "合阳",
    澄城南: "澄城",
    蒲城南: "蒲城",
    富平南: "富平",
    西安东: "西安",
    高陵: "高陵",
    铜川: "铜川",
    铜川北: "铜川",
    宜君: "宜君",
    黄陵: "黄陵",
    洛川: "洛川",
    富县北: "富县",
    甘泉北: "甘泉",
    延安: "延安",
    延安新区: "延安",
    延川: "延川",
    清涧北: "清涧",
    牛背梁: "柞水",
    柞水西: "柞水",
    镇安西: "镇安",
    安康西: "安康",
    西安西: "西安",
    鄠邑: "鄠邑",
    佛坪: "佛坪",
    洋县西: "洋县",
    城固北: "城固",
    汉中: "汉中",
    宁强南: "宁强",
    朝天南: "广元",
    广元: "广元",
    蓝田: "蓝田",
    商洛西: "商洛",
    山阳: "山阳",
    漫川关: "山阳",
    郧西: "郧西",
    十堰东: "十堰",
    丹凤南: "丹凤",
    商南东: "商南",
    西峡东: "西峡",
    内乡北: "内乡",
    镇平北: "镇平",
    郧阳北: "十堰",
    淅川西: "淅川",
    武当山西: "丹江口",
    丹江口: "丹江口",
    谷城北: "谷城",
    襄阳东: "襄阳",
    枣阳: "枣阳",
    随县: "随县",
    随州南: "随州",
    安陆西: "安陆",
    云梦东: "云梦",
    孝感东: "孝感",
    天河机场: "武汉",
    汉口: "武汉",
    钟祥南: "钟祥",
    京山南: "京山",
    天门: "天门",
    汉川北: "汉川",
    潜江: "潜江",
    仙桃西: "仙桃",
    天门南: "天门",
    汉川: "汉川",
    宜城: "宜城",
    荆门西: "荆门",
    沙洋西: "沙洋",
    荆州: "荆州",
    公安: "公安",
    石首: "石首",
    华容: "华容",
    岳阳东: "岳阳",
    汨罗东: "汨罗",
    长沙南: "长沙",
    咸宁北: "咸宁",
    赤壁北: "赤壁",
    南县: "南县",
    安乡: "安乡",
    桃源: "桃源",
    沅陵: "沅陵",
    辰溪: "辰溪",
    当阳西: "当阳",
    东岔: "天水",
    天水南: "天水",
    秦安: "秦安",
    通渭: "通渭",
    定西北: "定西",
    会宁: "会宁",
    静宁: "静宁",
    隆德: "隆德",
    榆中: "榆中",
    兰州西: "兰州",
    兰州: "兰州",
    夏官营: "榆中",
    渭源: "渭源",
    漳县: "漳县",
    岷县: "岷县",
    哈达铺: "宕昌",
    陇南: "陇南",
    姚渡: "青川",
    刘家峡: "永靖",
    临夏: "临夏",
    双城: "临夏",
    合作: "合作",
    博拉: "夏河",
    则岔: "碌曲",
    唐尕昂: "合作",
    甘加: "夏河",
    东平: "化隆",
    化隆: "化隆",
    尖扎: "尖扎",
    同仁: "同仁",
    夏河: "夏河",
    碌曲: "碌曲",
    郎木寺: "碌曲",
    若尔盖: "若尔盖",
    班佑: "若尔盖",
    阿西: "若尔盖",
    花湖: "若尔盖",
    红原: "红原",
    黄龙九寨: "松潘",
    黄胜关: "松潘",
    松潘: "松潘",
    镇江关: "松潘",
    叠溪: "茂县",
    石大关: "茂县",
    茂县: "茂县",
    高川: "茂县",
    安州: "安州",
    绵竹南: "绵竹",
    什邡西: "什邡",
    三星堆: "广汉",
    青白江东: "青白江",
    成都东: "成都",
    广汉北: "广汉",
    德阳: "德阳",
    罗江东: "罗江",
    绵阳: "绵阳",
    江油: "江油",
    江油北: "江油",
    青川: "青川",
    剑门关: "剑阁",
    简阳南: "简阳",
    资阳北: "资阳",
    资中北: "资中",
    内江北: "内江",
    隆昌北: "隆昌",
    荣昌北: "荣昌",
    大足南: "大足",
    永川东: "永川",
    璧山: "璧山",
    重庆北: "重庆",
    成都站: "成都",
    简州: "简阳",
    乐至: "乐至",
    安岳: "安岳",
    大足石刻: "大足",
    铜梁: "铜梁",
    重庆科学城: "重庆",
    大英东: "大英",
    遂宁: "遂宁",
    三台: "三台",
    射洪: "射洪",
    潼南: "潼南",
    合川: "合川",
    北碚南: "北碚",
    合川东: "合川",
    广安东: "广安",
    大竹: "大竹",
    三岔湖: "简阳",
    天府机场: "简阳",
    资阳西: "资阳",
    资中西: "资中",
    威远: "威远",
    自贡: "自贡",
    富顺: "富顺",
    泸县: "泸县",
    泸州: "泸州",
    泸州东: "泸州",
    永川南: "永川",
    江津北: "江津",
    重庆西: "重庆",
    璧山机场: "璧山",
    白沙: "江津",
    合江: "合江",
    赤水: "赤水",
    习水: "习水",
    古蔺: "古蔺",
    长寿北: "长寿",
    垫江: "垫江",
    梁平南: "梁平",
    重庆东: "重庆",
    涪陵北: "涪陵",
    丰都北: "丰都",
    丰都: "丰都",
    石柱东: "石柱",
    石柱: "石柱",
    黄水: "石柱",
    利川: "利川",
    恩施南: "恩施",
    鹤峰: "鹤峰",
    后河: "五峰",
    五峰: "五峰",
    长阳东: "长阳",
    宜昌北: "宜昌",
    万州: "万州",
    恩施: "恩施",
    建始: "建始",
    高坪: "巴东",
    野三关: "巴东",
    长阳: "长阳",
    宜昌东: "宜昌",
    云阳: "云阳",
    奉节: "奉节",
    巫山: "巫山",
    巴东: "巴东",
    兴山: "兴山",
    神农架: "神农架",
    保康县: "保康",
    南漳: "南漳",
    忠县: "忠县",
    南川北: "南川",
    武隆南: "武隆",
    彭水西: "彭水",
    黔江: "黔江",
    咸丰: "咸丰",
    来凤: "来凤",
    龙山北: "龙山",
    桑植: "桑植",
    张家界西: "张家界",
    常德: "常德",
    宜都: "宜都",
    松滋: "松滋",
    澧县: "澧县",
    临澧东: "临澧",
    益阳南: "益阳",
    长沙西: "长沙",
    涪陵: "涪陵",
    武隆: "武隆",
    彭水: "彭水",
    酉阳: "酉阳",
    秀山: "秀山",
    铜仁: "铜仁",
    怀化: "怀化",
    宜城南: "宜城",
    荆门: "荆门",
    当阳: "当阳",
    枝城: "宜都",
    松滋西: "松滋",
    澧县北: "澧县",
    石门县北: "石门",
    慈利: "慈利",
    张家界: "张家界",
    吉首: "吉首",
    吉首东: "吉首",
    芙蓉镇: "永顺",
    古丈西: "古丈",
    凤凰古城: "凤凰",
    麻阳: "麻阳",
    麻阳西: "麻阳",
    罗城: "罗城",
    融水: "融水",
    融安: "融安",
    三江县: "三江",
    通道: "通道",
    靖州: "靖州",
    会同: "会同",
    黔城: "洪江",
    綦江东: "綦江",
    桐梓东: "桐梓",
    遵义: "遵义",
    息烽: "息烽",
    贵阳北: "贵阳",
    贵阳东: "贵阳",
    贵定北: "贵定",
    凯里南: "凯里",
    三穗: "三穗",
    铜仁南: "铜仁",
    新晃西: "新晃",
    芷江: "芷江",
    怀化南: "怀化",
    洞口: "洞口",
    安江东: "洪江",
    蓝山: "蓝山",
    双牌东: "双牌",
    邵阳县: "邵阳县",
    邵阳: "邵阳",
    邵阳西: "邵阳",
    隆回: "隆回",
    武冈: "武冈",
    新宁: "新宁",
    资源: "资源",
    龙里北: "龙里",
    都匀东: "都匀",
    独山东: "独山",
    荔波: "荔波",
    环江: "环江",
    河池西: "河池",
    柳城: "柳城",
    宜州: "宜州",
    金城江: "河池",
    南丹: "南丹",
    独山: "独山",
    都匀: "都匀",
    贵定南: "贵定",
    龙里: "龙里",
    贵阳: "贵阳",
    都安: "都安",
    南宁北: "南宁",
    南宁东: "南宁",
    宾阳: "宾阳",
    来宾北: "来宾",
    柳州: "柳州",
    鹿寨北: "鹿寨",
    柳州东: "柳州",
    鹿寨南: "鹿寨",
    金秀: "金秀",
    蒙山: "蒙山",
    昭平: "昭平",
    黄姚: "昭平",
    贺州: "贺州",
    苍梧: "苍梧",
    陆川: "陆川",
    阳朔: "阳朔",
    恭城: "恭城",
    钟山西: "钟山",
    怀集: "怀集",
    广宁: "广宁",
    三水南: "佛山",
    连州: "连州",
    阳山: "阳山",
    清远西: "清远",
    清远: "清远",
    耒阳西: "耒阳",
    乐昌东: "乐昌",
    韶关: "韶关",
    英德西: "英德",
    广州北: "广州",
    永福南: "永福",
    永福: "永福",
    融安东: "融安",
    罗城西: "罗城",
    宜州北: "宜州",
    东兰: "东兰",
    巴马: "巴马",
    桂林: "桂林",
    桂林北: "桂林",
    兴安北: "兴安",
    灌阳: "灌阳",
    江永北: "江永",
    道县: "道县",
    宁远: "宁远",
    嘉禾: "嘉禾",
    郴州西: "郴州",
    资兴: "资兴",
    桂东: "桂东",
    上犹: "上犹",
    赣州西: "赣州",
    吕田: "广州",
    新丰: "新丰",
    连平: "连平",
    全南: "全南",
    龙南北: "龙南",
    信丰北: "信丰",
    全州南: "全州",
    零陵: "永州",
    永州: "永州",
    祁阳: "祁阳",
    祁东: "祁东",
    衡阳东: "衡阳",
    贵港: "贵港",
    桂平: "桂平",
    平南南: "平南",
    藤县: "藤县",
    梧州南: "梧州",
    象州: "象州",
    武宣: "武宣",
    桂平北: "桂平",
    平南北: "平南",
    藤县北: "藤县",
    梧州: "梧州",
    郁南: "郁南",
    云浮东: "云浮",
    肇庆东: "肇庆",
    佛山西: "佛山",
    广州南: "广州",
    五合: "南宁",
    峦城: "横州",
    横州: "横州",
    兴业南: "兴业",
    玉林北: "玉林",
    容县南: "容县",
    岑溪东: "岑溪",
    罗定北: "罗定",
    云浮: "云浮",
    佛肇: "佛山",
    广州白云: "广州",
    佛山: "佛山",
    新兴南: "新兴",
    阳春东: "阳春",
    阳江北: "阳江",
    阳江: "阳江",
    马踏: "茂名",
    茂名南: "茂名",
    茂名: "茂名",
    吴川: "吴川",
    湛江北: "湛江",
    雷州北: "雷州",
    龙门西: "雷州",
    徐闻: "徐闻",
    徐闻南: "徐闻",
    海口北: "海口",
    海口: "海口",
    海口东: "海口",
    美兰: "海口",
    文昌: "文昌",
    琼海: "琼海",
    博鳌: "琼海",
    万宁: "万宁",
    神州: "万宁",
    陵水: "陵水",
    亚龙湾: "三亚",
    三亚: "三亚",
    老城镇: "澄迈",
    福山镇: "澄迈",
    临高南: "临高",
    银滩: "儋州",
    白马井: "儋州",
    海头: "儋州",
    棋子湾: "昌江",
    东方: "东方",
    金月湾: "乐东",
    尖峰: "乐东",
    黄流: "乐东",
    乐东: "乐东",
    崖州: "三亚",
    凤凰机场: "三亚",
    台山: "台山",
    开平南: "开平",
    恩平: "恩平",
    阳西: "阳西",
    江门: "江门",
    中山西: "中山",
    中山北: "中山",
    中山: "中山",
    顺德: "佛山",
    容桂: "佛山",
    小榄: "中山",
    珠海北: "珠海",
    唐家湾: "珠海",
    珠海: "珠海",
    珠海鹤洲: "珠海",
    莲洲: "珠海",
    鹤山西: "鹤山",
    高明: "佛山",
    横琴: "珠海",
    南沙: "广州",
    东莞滨海湾: "东莞",
    深圳机场东: "深圳",
    深圳西丽: "深圳",
    罗湖北: "深圳",
    深圳坪山: "深圳",
    惠阳: "惠州",
    惠东南: "惠东",
    鲘门: "海丰",
    陆丰: "陆丰",
    葵潭: "普宁",
    普宁: "普宁",
    潮阳: "汕头",
    潮汕: "揭阳",
    汕头东: "汕头",
    饶平南: "饶平",
    诏安南: "诏安",
    东山县: "东山",
    漳浦: "漳浦",
    漳州: "漳州",
    厦门北: "厦门",
    揭阳机场: "揭阳",
    揭阳: "揭阳",
    丰顺东: "丰顺",
    建桥: "丰顺",
    畲江北: "梅州",
    庆盛: "广州",
    虎门: "东莞",
    光明城: "深圳",
    深圳北: "深圳",
    福田: "深圳",
    香港西九龙: "香港",
    信丰西: "信丰",
    龙南东: "龙南",
    定南南: "定南",
    和平北: "和平",
    博罗北: "博罗",
    惠州北: "惠州",
    仲恺: "惠州",
    东莞南: "东莞",
    白云机场T3: "广州",
    从化: "广州",
    永汉: "龙门",
    龙门: "龙门",
    河源东: "河源",
    河源北: "河源",
    龙川西: "龙川",
    五华: "五华",
    兴宁南: "兴宁",
    梅州西: "梅州",
    梅州: "梅州",
    雁洋西: "梅州",
    蕉岭: "蕉岭",
    武平: "武平",
    上杭: "上杭",
    古田会址: "上杭",
    龙岩: "龙岩",
    黄埔: "广州",
    广州东: "广州",
    新塘: "广州",
    增城: "广州",
    罗浮山: "博罗",
    博罗: "博罗",
    惠州南: "惠州",
    惠东: "惠东",
    深汕: "汕尾",
    汕尾: "汕尾",
    陆丰南: "陆丰",
    陆丰东: "陆丰",
    惠来: "惠来",
    潮南: "汕头",
    汕头南: "汕头",
    汕头: "汕头",
    东莞城际: "东莞",
    钦州东: "钦州",
    合浦: "合浦",
    白沙镇: "合浦",
    廉江南: "廉江",
    遂溪南: "遂溪",
    湛江西: "湛江",
    防城港北: "防城港",
    东兴市: "东兴",
    北海: "北海",
    吴圩机场: "南宁",
    扶绥南: "扶绥",
    崇左南: "崇左",
    宁明东: "宁明",
    龙州: "龙州",
    凭祥东: "凭祥",
    贵定县: "贵定",
    三都县: "三都",
    榕江: "榕江",
    从江: "从江",
    三江南: "三江",
    桂林西: "桂林",
    万盛: "万盛",
    正安: "正安",
    绥阳: "绥阳",
    开阳: "开阳",
    沿滩: "自贡",
    南溪北: "宜宾",
    南溪: "宜宾",
    宜宾东: "宜宾",
    宜宾: "宜宾",
    高县: "高县",
    筠连: "筠连",
    盐津南: "盐津",
    彝良北: "彝良",
    昭通东: "昭通",
    威宁: "威宁",
    六盘水: "六盘水",
    宣威: "宣威",
    会泽: "会泽",
    寻甸东: "寻甸",
    嵩明: "嵩明",
    长水机场: "昆明",
    昆明南: "昆明",
    晋宁东: "晋宁",
    玉溪: "玉溪",
    峨山: "峨山",
    化念: "峨山",
    元江: "元江",
    墨江: "墨江",
    宁洱: "宁洱",
    普洱: "普洱",
    野象谷: "景洪",
    西双版纳: "景洪",
    橄榄坝: "景洪",
    勐腊: "勐腊",
    磨憨: "勐腊",
    宜良北: "宜良",
    石林: "石林",
    陆良: "陆良",
    师宗: "师宗",
    罗平: "罗平",
    威舍: "兴义",
    兴义: "兴义",
    江川: "江川",
    华宁: "华宁",
    泸西: "泸西",
    石林西: "石林",
    弥勒: "弥勒",
    竹园: "弥勒",
    朋普: "弥勒",
    开远南: "开远",
    红河: "红河",
    通海: "通海",
    建水: "建水",
    个旧: "个旧",
    蒙自: "蒙自",
    屏边: "屏边",
    河口北: "河口",
    普者黑: "丘北",
    广南县: "广南",
    富宁: "富宁",
    安顺西: "安顺",
    六枝南: "六枝",
    关岭: "关岭",
    普安县: "普安",
    盘州: "盘州",
    鸡场坪: "盘州",
    保田: "兴义",
    兴义南: "兴义",
    册亨: "册亨",
    田林: "田林",
    百色: "百色",
    田阳: "田阳",
    田东北: "田东",
    平果: "平果",
    隆安东: "隆安",
    南宁西: "南宁",
    南宁: "南宁",
    富源北: "富源",
    曲靖北: "曲靖",
    蓬溪南: "蓬溪",
    南充北: "南充",
    武胜: "武胜",
    南部: "南部",
    阆中: "阆中",
    苍溪: "苍溪",
    旺苍: "旺苍",
    巴中: "巴中",
    金堂东: "金堂",
    中江: "中江",
    盐亭: "盐亭",
    阆中南: "阆中",
    仪陇: "仪陇",
    巴中东: "巴中",
    通江: "通江",
    万源北: "万源",
    紫阳南: "紫阳",
    平昌: "平昌",
    营山西: "营山",
    渠县北: "渠县",
    开江: "开江",
    开州南: "开州",
    成都南: "成都",
    彭山: "眉山",
    眉山: "眉山",
    双流机场: "双流",
    彭山北: "眉山",
    眉山东: "眉山",
    青神: "青神",
    乐山: "乐山",
    犍为: "犍为",
    泥溪: "宜宾",
    屏山: "屏山",
    宜宾西: "宜宾",
    长宁: "长宁",
    兴文: "兴文",
    威信: "威信",
    镇雄: "镇雄",
    毕节: "毕节",
    纳雍: "纳雍",
    阳长: "六盘水",
    比德: "六盘水",
    大方: "大方",
    黔西: "黔西",
    清镇西: "清镇",
    夹江: "夹江",
    峨眉: "峨眉山",
    沙湾南: "乐山",
    峨边南: "乐山",
    甘洛南: "甘洛",
    越西: "越西",
    冕宁: "冕宁",
    西昌西: "西昌",
    德昌西: "德昌",
    米易东: "米易",
    盐边南: "盐边",
    水富: "水富",
    绥江: "绥江",
    雷波: "雷波",
    美姑: "美姑",
    昭觉: "昭觉",
    攀枝花南: "攀枝花",
    永仁: "永仁",
    元谋西: "元谋",
    广通北: "禄丰",
    禄丰南: "禄丰",
    昆明: "昆明",
    兰州新区: "兰州新区",
    中川机场东: "兰州",
    永登北: "永登",
    天祝西: "天祝",
    古浪北: "古浪",
    武威东: "武威",
    武威南: "武威",
    上腰墩: "武威",
    黑冲滩: "景泰",
    谭家井: "景泰",
    干塘: "中卫",
    沙坡头: "中卫",
    迎水桥: "中卫",
    朱王堡: "永昌",
    金昌南: "金昌",
    芨岭西: "山丹",
    山丹北: "山丹",
    张掖西: "张掖",
    临泽南: "临泽",
    高台南: "高台",
    清水北: "酒泉",
    酒泉南: "酒泉",
    嘉峪关南: "嘉峪关",
    玉门: "玉门",
    柳园南: "瓜州",
    哈密: "哈密",
    哈密东: "哈密",
    梧桐水: "哈密",
    明水: "肃北",
    马鬃山: "肃北",
    额济纳: "额济纳",
    临河: "巴彦淖尔",
    罗中: "若羌",
    吐哈: "鄯善",
    鄯善北: "鄯善",
    吐鲁番北: "吐鲁番",
    乌鲁木齐南: "乌鲁木齐",
    乌鲁木齐: "乌鲁木齐",
    昌吉: "昌吉",
    石河子: "石河子",
    沙湾市: "沙湾",
    奎屯: "奎屯",
    乌苏: "乌苏",
    精河: "精河",
    阿拉山口: "博乐",
    精河南: "精河",
    尼勒克: "尼勒克",
    伊宁: "伊宁",
    布列开: "伊宁",
    巩留: "巩留",
    新源: "新源",
    那拉提: "新源",
    巴音布鲁克: "和静",
    库台克力克: "拜城",
    库车西: "库车",
    新和: "新和",
    霍城: "霍城",
    霍尔果斯: "霍尔果斯",
    克拉玛依: "克拉玛依",
    福海: "福海",
    北屯市: "北屯",
    吐鲁番: "吐鲁番",
    托克逊: "托克逊",
    马兰: "和硕",
    和硕: "和硕",
    焉耆: "焉耆",
    准东: "昌吉",
    富蕴: "富蕴",
    阿勒泰: "阿勒泰",
    民和南: "民和",
    海东: "海东",
    海东西: "海东",
    西宁: "西宁",
    湟源: "湟源",
    海晏: "海晏",
    刚察: "刚察",
    天峻: "天峻",
    乌兰: "乌兰",
    德令哈: "德令哈",
    锡铁山: "大柴旦",
    察尔汗: "格尔木",
    格尔木: "格尔木",
    纳赤台: "格尔木",
    玉珠峰: "格尔木",
    五道梁: "格尔木",
    沱沱河: "格尔木",
    唐古拉: "安多",
    安多: "安多",
    那曲: "那曲",
    当雄: "当雄",
    羊八井: "当雄",
    拉萨: "拉萨",
    协荣: "曲水",
    曲水县: "曲水",
    尼木: "尼木",
    仁布: "仁布",
    日喀则: "日喀则",
    贡嘎: "贡嘎",
    扎囊: "扎囊",
    山南: "山南",
    桑日: "桑日",
    加查: "加查",
    朗县: "朗县",
    米林: "米林",
    岗嘎: "林芝",
    林芝: "林芝",
    鲁朗: "林芝",
    波密: "波密",
    洛隆: "洛隆",
    邦达: "昌都",
    昌都: "昌都",
    贡觉: "贡觉",
    白玉: "白玉",
    巴塘: "巴塘",
    毛垭坝: "理塘",
    理塘: "理塘",
    西俄洛: "雅江",
    雅江: "雅江",
    新都桥: "康定",
    康定: "康定",
    泸定: "泸定",
    天全: "天全",
    雅安: "雅安",
    名山: "名山",
    朝阳湖: "蒲江",
    蒲江: "蒲江",
    寿安: "蒲江",
    新津南: "新津",
    天府: "成都",
    大理: "大理",
    漾濞: "漾濞",
    永平县: "永平",
    保山: "保山",
    龙陵: "龙陵",
    芒市: "芒市",
    芒市西: "芒市",
    瑞丽: "瑞丽",
    腾冲: "腾冲",
    猴桥: "腾冲",
    巍山: "巍山",
    小湾东: "南涧",
    云县: "云县",
    临沧: "临沧",
    楚雄: "楚雄",
    南华: "南华",
    祥云: "祥云",
    鹤庆: "鹤庆",
    丽江: "丽江",
    拉市海: "丽江",
    虎跳峡: "香格里拉",
    小中甸: "香格里拉",
    香格里拉: "香格里拉",
    德钦: "德钦",
    盐井: "芒康",
    芒康: "芒康",
    如美: "芒康",
    左贡: "左贡",
    八宿: "八宿",
    然乌: "八宿",
    松宗: "波密",
    波密东: "波密",
    乌图美仁: "格尔木",
    茫崖: "茫崖",
    依吞布拉克: "若羌",
    米兰: "若羌",
    若羌: "若羌",
    铁干里克: "尉犁",
    库尔木依: "尉犁",
    尉犁: "尉犁",
    库尔勒: "库尔勒",
    轮台: "轮台",
    库车: "库车",
    阿克苏: "阿克苏",
    巴楚: "巴楚",
    阿图什: "阿图什",
    喀什: "喀什",
    米兰东: "若羌",
    且末: "且末",
    民丰: "民丰",
    和田: "和田",
    疏勒: "疏勒",
    阿克陶: "阿克陶",
    莎车: "莎车",
    叶城: "叶城",
    皮山: "皮山",
    墨玉: "墨玉",
    乌恰: "乌恰",
    吐尔尕特: "乌恰",
    饮马峡: "大柴旦",
    小柴旦: "大柴旦",
    大柴旦: "大柴旦",
    鱼卡: "大柴旦",
    马海: "大柴旦",
    苏干湖: "阿克塞",
    当金山: "阿克塞",
    肃北: "肃北",
    阿克塞: "阿克塞",
    敦煌: "敦煌",
    双塔: "瓜州",
    柳沟南: "瓜州",
    大通西: "大通",
    门源: "门源",
    山丹马场: "山丹",
    民乐: "民乐",
    秦王川: "兰州新区",
    白银南: "白银",
    靖远北: "靖远",
    平川西: "平川",
    北滩: "景泰",
    中卫南: "中卫",
    宝鸡: "宝鸡",
    秦岭: "宝鸡",
    凤州: "凤县",
    凤县: "凤县",
    两当: "两当",
    徽县: "徽县",
    略阳: "略阳",
    阳平关: "宁强",
    燕子砭: "广元",
    千阳: "千阳",
    陇县: "陇县",
    安口窑: "华亭",
    安口南: "华亭",
    华亭: "华亭",
    张家川: "张家川",
    清水县: "清水",
    天水: "天水",
    平凉: "平凉",
    平凉南: "平凉",
    白水: "平凉",
    镇原: "镇原",
    北石窟: "庆阳",
    泾川: "泾川",
    长庆桥: "宁县",
    长武: "长武",
    彬州: "彬州",
    永寿: "永寿",
    礼泉: "礼泉",
    茂陵: "兴平",
    咸阳: "咸阳",
    西安站: "西安",
    固原: "固原",
    同心: "同心",
    中卫: "中卫",
    汉阴: "汉阴",
    石泉: "石泉",
    西乡: "西乡",
    旬阳: "旬阳",
    白河: "白河",
    岚皋: "岚皋",
    城口: "城口",
    樊哙: "宣汉",
    宣汉南: "宣汉",
    达州南: "达州",
    开州: "开州",
    万州北: "万州",
    曲沃: "曲沃",
    侯马: "侯马",
    月山: "焦作",
    翼城: "翼城",
    沁水: "沁水",
    阳城: "阳城",
    济源: "济源",
    济源东: "济源",
    修武: "修武",
    获嘉: "获嘉",
    获嘉南: "获嘉",
    新乡: "新乡",
    延津: "延津",
    封丘: "封丘",
    滑县南: "滑县",
    长垣: "长垣",
    东明县: "东明",
    菏泽: "菏泽",
    沁阳: "沁阳",
    沁阳西: "沁阳",
    王庄: "洛阳",
    孟津: "洛阳",
    孟津北: "洛阳",
    洛阳北: "洛阳",
    洛阳东: "洛阳",
    关林: "洛阳",
    伊川: "伊川",
    汝阳: "汝阳",
    汝阳东: "汝阳",
    汝州: "汝州",
    汝州南: "汝州",
    宝丰: "宝丰",
    鲁山: "鲁山",
    鲁山西: "鲁山",
    南召: "南召",
    南召北: "南召",
    南阳: "南阳",
    三门峡南: "三门峡",
    渑池南: "渑池",
    洛阳龙门: "洛阳",
    徐州东: "徐州",
    萧县北: "萧县",
    永城北: "永城",
    淮北西: "淮北",
    宿州西: "宿州",
    双堆集: "濉溪",
    固镇南: "固镇",
    蚌埠南: "蚌埠",
    砀山南: "砀山",
    民权北: "民权",
    兰考南: "兰考",
    庄寨: "曹县",
    巨野北: "巨野",
    嘉祥北: "嘉祥",
    济宁北: "济宁",
    济宁东: "济宁",
    曲阜南: "曲阜",
    曲阜东: "曲阜",
    泗水南: "泗水",
    费县北: "费县",
    临沂北: "临沂",
    莒南北: "莒南",
    厉家寨: "莒南",
    日照西: "日照",
    两城: "日照",
    董家口: "青岛",
    青岛西: "青岛",
    洋河口: "胶州",
    红岛: "青岛",
    青岛北: "青岛",
    开封北: "开封",
    郑州西: "郑州",
    巩义南: "巩义",
    郑州航空港: "郑州",
    许昌北: "许昌",
    鄢陵: "鄢陵",
    扶沟南: "扶沟",
    西华: "西华",
    周口东: "周口",
    周口西: "周口",
    淮阳南: "周口",
    沈丘北: "沈丘",
    界首南: "界首",
    临泉: "临泉",
    临泉南: "临泉",
    汝南南: "汝南",
    平舆: "平舆",
    新蔡北: "新蔡",
    阜阳西: "阜阳",
    郑州: "郑州",
    南阳寨: "郑州",
    黄河景区: "郑州",
    武陟: "武陟",
    修武西: "修武",
    新乡南: "新乡",
    "新乡南（旧规划暂名）": "新乡",
    卫辉南: "卫辉",
    滑浚: "滑县",
    内黄: "内黄",
    濮阳东: "濮阳",
    南乐: "南乐",
    莘县: "莘县",
    茌平南: "聊城",
    长清: "济南",
    长葛北: "长葛",
    禹州: "禹州",
    郏县: "郏县",
    平顶山西: "平顶山",
    平顶山南: "平顶山",
    方城: "方城",
    南阳东: "南阳",
    邓州东: "邓州",
    邓州: "邓州",
    构林: "邓州",
    襄阳北: "襄阳",
    襄阳: "襄阳",
    许昌东: "许昌",
    漯河西: "漯河",
    舞阳北: "舞阳",
    驻马店西: "驻马店",
    明港东: "信阳",
    信阳东: "信阳",
    唐河北: "唐河",
    泌阳: "泌阳",
    桐柏北: "桐柏",
    罗山: "罗山",
    息县: "息县",
    潢川南: "潢川",
    商城: "商城",
    固始: "固始",
    金寨东: "金寨",
    武汉天河: "武汉",
    长江新区: "武汉",
    "红安南": "红安",
    麻城北: "麻城",
    六安北: "六安",
    长安集: "肥西",
    合肥南: "合肥",
    葛店南: "鄂州",
    鄂州: "鄂州",
    黄石北: "黄石",
    大冶北: "大冶",
    阳新: "阳新",
    瑞昌西: "瑞昌",
    庐山: "九江",
    九江: "九江",
    庐山南: "庐山",
    共青城东: "共青城",
    昌北机场: "南昌",
    南昌东: "南昌",
    德安: "德安",
    共青城: "共青城",
    永修: "永修",
    南昌西: "南昌",
    阜南: "阜南",
    淮滨南: "淮滨",
    新县北: "新县",
    红安北: "红安",
    麻城西: "麻城",
    武汉新洲: "武汉",
    黄州: "黄冈",
    孝感北: "孝感",
    武汉: "武汉",
    华山北: "华阴",
    灵宝西: "灵宝",
    咸阳西: "咸阳",
    杨陵南: "杨陵",
    岐山: "岐山",
    宝鸡南: "宝鸡",
    咸阳北: "咸阳",
    礼泉南: "礼泉",
    乾县: "乾县",
    永寿西: "永寿",
    彬州东: "彬州",
    宁县: "宁县",
    庆阳: "庆阳",
    庆城: "庆城",
    曲子: "环县",
    环县: "环县",
    甜水堡: "盐池",
    惠安堡: "同心",
    吴忠: "吴忠",
    灵武北: "灵武",
    河东机场: "银川",
    银川: "银川",
    巴润别立: "阿拉善左旗",
    巴彦浩特: "阿拉善左旗",
    红寺堡北: "红寺堡",
    中宁东: "中宁",
    沙湖: "平罗",
    石嘴山: "石嘴山",
    惠农南: "惠农",
    乌海南: "乌海",
    乌海: "乌海",
    磴口: "磴口",
    巴彦淖尔: "巴彦淖尔",
    五原: "五原",
    乌拉特前旗: "乌拉特前旗",
    白彦花西: "包头",
  };
  const ORDER_NAME_ALIAS = {
    北京通州: "北京城市副中心",
    辽宁朝阳: "朝阳"
  };
  const BEIJING_STATION_IDS = [
    "jingguang_01",
    "jingguang_fengtai",
    "jinghu_01",
    "jingha_beijing",
    "jingha_01",
    "jingha_shunyixi",
    "jingha_huairounan",
    "jingha_miyun",
    "jingbao_01",
    "jingbao_qinghe",
    "jingbao_changping",
    "jingjin_yizhuang",
    "jingxiong_02"
  ];
  const CORRIDOR_DEFS = [
    {
      id: "beijingnan_tianjin",
      name: "北京南—天津通道",
      stations: [
        ["jinghu_01", "北京南", 39.8636, 116.3728],
        ["jingjin_yizhuang", "亦庄", 39.8119, 116.5962],
        ["wuqing", "武清", 39.3714, 117.0101],
        ["tianjin", "天津", 39.13575, 117.20368]
      ]
    },
    {
      id: "beijingnan_tianjinnan",
      name: "北京南—天津南通道",
      stations: [
        ["jinghu_01", "北京南", 39.8636, 116.3728],
        ["langfang", "廊坊", 39.5058, 116.7011],
        ["tianjinnan", "天津南", 39.05583, 117.05500]
      ]
    },
    {
      id: "beijingxi_xiongan",
      name: "北京西—雄安通道",
      stations: [
        ["jingguang_01", "北京西", 39.893564, 116.315697],
        ["jingxiong_02", "北京大兴", 39.719390, 116.322540],
        ["jingxiong_03", "大兴机场", 39.513921, 116.409934],
        ["jingxiong_04", "固安东", 39.370919, 116.399011],
        ["jingxiong_05", "霸州北", 39.185308, 116.320453],
        ["jingxiongshang_02", "雄安", 39.055749, 116.153230]
      ]
    },
    {
      id: "beijingfengtai_xiongan",
      name: "北京丰台—雄安通道",
      stations: [
        ["jingguang_fengtai", "北京丰台", 39.849772, 116.294567],
        ["jingxiongshang_shuangxin", "双辛", 39.2940, 116.19],
        ["jingxiongshang_02", "雄安", 39.055749, 116.153230]
      ]
    },
    {
      id: "beijingfengtai_shijiazhuang",
      name: "北京丰台—石家庄通道",
      stations: [
        ["jingguang_fengtai", "北京丰台", 39.849772, 116.294567],
        ["jingguang_zhuozhoudong", "涿州东", 39.45864, 116.04739],
        ["jingguang_gaobeidiandong", "高碑店东", 39.28787, 115.94067],
        ["jingguang_02", "保定东", 38.86346, 115.59573],
        ["jingguang_dingzhoudong", "定州东", 38.50777, 115.06906],
        ["jingguang_zhengdingairport", "正定机场", 38.25131, 114.70333],
        ["jingguang_03", "石家庄", 38.01111, 114.47722]
      ]
    },
    {
      id: "beijingtongzhou_tangshan",
      name: "北京通州—唐山通道",
      stations: [
        ["jingtang_01", "北京通州", 39.90797, 116.70015],
        ["jingtang_02", "燕郊", 39.94167, 116.82583],
        ["jingtang_03", "大厂", 39.8886, 116.8976],
        ["jingtang_04", "香河", 39.71883, 117.02767],
        ["jingtang_05", "宝坻", 39.66050, 117.29900],
        ["jingtang_06", "玉田南", 39.69639, 117.80874],
        ["jingtang_07", "唐山西", 39.69528, 118.01709],
        ["jinqinshen_02", "唐山", 39.62424, 118.11170]
      ]
    },
    {
      id: "beijingbei_zhangjiakou",
      name: "北京北—张家口通道",
      stations: [
        ["jingbao_01", "北京北", 39.945280, 116.347220],
        ["jingbao_qinghe", "清河", 40.039864, 116.309173],
        ["jingbao_shahe", "沙河", 40.123890, 116.258890],
        ["jingbao_changping", "昌平", 40.188847, 116.187314],
        ["jingbao_badaling", "八达岭长城", 40.357941, 116.004759],
        ["jingbao_donghuayuanbei", "东花园北", 40.341786, 115.788172],
        ["jingbao_huailai", "怀来", 40.376689, 115.558223],
        ["jingbao_xiahuayuanbei", "下花园北", 40.502046, 115.295259],
        ["jingbao_xuanhuabei", "宣化北", 40.631230, 115.042504],
        ["jingbao_02", "张家口", 40.750675, 114.876969]
      ]
    },
    {
      id: "beijingchaoyang_shenyang",
      name: "北京站—沈阳通道",
      stations: [
        ["jingha_beijing", "北京站", 39.901, 116.4206],
        ["jingha_01", "北京朝阳", 39.943180, 116.502120],
        ["jingha_shunyixi", "顺义西", 40.177832, 116.484982],
        ["jingha_huairounan", "怀柔南", 40.277160, 116.698821],
        ["jingha_miyun", "密云", 40.350811, 116.844702],
        ["jingha_xinglongxianxi", "兴隆县西", 40.412549, 117.475721],
        ["jingha_anjiang", "安匠", 40.762119, 117.722803],
        ["jingha_02", "承德南", 40.882322, 117.957486],
        ["jingha_chengdexianbei", "承德县北", 40.934700, 118.284239],
        ["jingha_pingquanbei", "平泉北", 41.037158, 118.705056],
        ["jingha_niuheliang", "牛河梁", 41.194239, 119.392261],
        ["jingha_kazuo", "喀左", 41.222547, 119.799700],
        ["jingha_nailingao", "奈林皋", 41.399988, 120.062090],
        ["jingha_03", "辽宁朝阳", 41.597986, 120.403819],
        ["jingha_beipiao", "北票", 41.766689, 120.782853],
        ["jingha_wulanmutu", "乌兰木图", 41.962704, 121.287304],
        ["jingha_04", "阜新", 42.055969, 121.654200],
        ["jingha_heishanbei", "黑山北", 42.043894, 122.294425],
        ["jingha_xinminbei", "新民北", 42.022786, 122.799950],
        ["jingha_shenyangxi", "沈阳西", 41.916594, 123.229206],
        ["jingha_shenyang", "沈阳", 41.791714, 123.386817]
      ]
    },
    {
      id: "beijingchaoyang_chifeng",
      name: "北京朝阳—赤峰通道",
      stations: [
        ["jingha_01", "北京朝阳", 39.943180, 116.502120],
        ["jingha_shunyixi", "顺义西", 40.177832, 116.484982],
        ["jingha_huairounan", "怀柔南", 40.277160, 116.698821],
        ["jingha_miyun", "密云", 40.350811, 116.844702],
        ["jingha_xinglongxianxi", "兴隆县西", 40.412549, 117.475721],
        ["jingha_anjiang", "安匠", 40.762119, 117.722803],
        ["jingha_02", "承德南", 40.882322, 117.957486],
        ["jingha_chengdexianbei", "承德县北", 40.934700, 118.284239],
        ["jingha_pingquanbei", "平泉北", 41.037158, 118.705056],
        ["jingha_niuheliang", "牛河梁", 41.194239, 119.392261],
        ["jingha_jianping", "建平", 41.378100, 119.556360],
        ["jingha_ningcheng", "宁城", 41.58, 119.31],
        ["jingha_pingzhuang", "平庄", 41.988100, 119.289318],
        ["jingha_chifeng_02", "赤峰", 42.273599, 118.895648]
      ]
    },
    {
      id: "changping_chifengnan",
      name: "昌平—赤峰南通道",
      type: "conventional",
      stations: [
        ["jingbao_changping", "昌平", 40.1888, 116.1873],
        ["jingtong_changpingbei", "昌平北", 40.2300, 116.2270],
        ["jingtong_huairoubei", "怀柔北", 40.4079, 116.6871],
        ["jingtong_gubeikou", "古北口", 40.6906, 117.1353],
        ["zhangtang_luanping", "滦平", 40.9217, 117.3098],
        ["jingtong_longhua", "隆化", 41.3264, 117.7450],
        ["jingtong_siheyong", "四合永", 41.7992, 117.8224],
        ["jingtong_chaoyangdi", "朝阳地", 42.0224, 118.2206],
        ["jingtong_wushijiazi", "五十家子", 42.0925, 118.1651],
        ["jingtong_sanbahuo", "三把火", 42.2946, 118.6723],
        ["jingtong_chifengnan", "赤峰南", 42.2547, 118.9536]
      ]
    },
    {
      id: "tianjin_binhai",
      name: "天津—滨海通道",
      stations: [
        ["tianjin", "天津", 39.13575, 117.20368],
        ["junliangchengbei", "军粮城北", 39.0645, 117.4210],
        ["tanggu", "塘沽", 39.02833, 117.64028],
        ["jinwei_01", "滨海", 39.0035, 117.6788]
      ]
    },
    {
      id: "tianjin_tangshan",
      name: "天津—唐山通道",
      stations: [
        ["tianjin", "天津", 39.13575, 117.20368],
        ["junliangchengbei", "军粮城北", 39.0645, 117.4210],
        ["jingbin_binhaixi", "滨海西", 39.08003, 117.60568],
        ["jingbin_binhaibei", "滨海北", 39.23512, 117.75577],
        ["jinqinshen_02", "唐山", 39.62424, 118.11170]
      ]
    },
    {
      id: "tianjinxi_xiongan",
      name: "天津西—雄安通道",
      stations: [
        ["jinxing_01", "天津西", 39.15736, 117.15712],
        ["jinxing_shengfang", "胜芳", 39.13765, 116.75350],
        ["jinxing_02", "安次", 39.2356, 116.6756],
        ["jinxing_03", "永清东", 39.30431, 116.50526],
        ["jingxiong_04", "固安东", 39.37092, 116.39901],
        ["jingxiong_05", "霸州北", 39.18531, 116.32045],
        ["jingxiongshang_02", "雄安", 39.05575, 116.15323]
      ]
    },
    {
      id: "tianjinnan_xiongan",
      name: "天津南—雄安通道",
      stations: [
        ["tianjinnan", "天津南", 39.05583, 117.05500],
        ["tuanpobei", "团泊北", 38.99, 117.08],
        ["wenanbei", "文安北", 39.0050, 116.6263],
        ["jingxiongshang_02", "雄安", 39.05575, 116.15323]
      ]
    },
    {
      id: "tianjinnan_jinanxi",
      name: "天津南—济南西通道",
      stations: [
        ["tianjinnan", "天津南", 39.05583, 117.05500],
        ["jinghu_04", "沧州西", 38.30602, 116.76211],
        ["jinghu_05", "德州东", 37.41089, 116.45493],
        ["jinghu_06", "济南西", 36.66889, 116.88694]
      ]
    },
    {
      id: "tianjin_jinandong",
      name: "天津—济南东通道",
      stations: [
        ["tianjin", "天津", 39.13575, 117.20368],
        ["junliangchengbei", "军粮城北", 39.0645, 117.4210],
        ["tanggu", "塘沽", 39.02833, 117.64028],
        ["jinwei_01", "滨海", 39.0035, 117.6788],
        ["jinwei_binhaidong", "滨海东", 38.85, 117.57],
        ["jinwei_binhainan", "滨海南", 38.70943, 117.43954],
        ["jinwei_huanghuabei", "黄骅北", 38.401, 117.385],
        ["jinwei_haixingxi", "海兴西", 38.115, 117.450],
        ["jinwei_wudi", "无棣", 37.752, 117.725],
        ["jinwei_02", "滨州", 37.4532, 118.0122],
        ["jinwei_huimin", "惠民", 37.49, 117.50],
        ["jinwei_shanghe", "商河", 37.31, 117.16],
        ["jinwei_jiyang", "济阳", 36.99, 117.12],
        ["jinwei_yaoqiang", "遥墙机场", 36.86, 117.22],
        ["jiqing_01", "济南东", 36.7484, 117.1541]
      ]
    },
    {
      id: "binzhou_weifangbei",
      name: "滨州—潍坊北通道",
      stations: [
        ["jinwei_02", "滨州", 37.4532, 118.0122],
        ["jinwei_03", "东营南", 37.3560, 118.5450],
        ["jinwei_shouguangdong", "寿光东", 36.905, 118.865],
        ["jiqing_03", "潍坊北", 36.7954, 119.1894]
      ]
    },
    {
      id: "tangshan_zhangjiakounan",
      name: "唐山—张家口南通道",
      type: "conventional",
      stations: [
        ["jinqinshen_02", "唐山", 39.62424, 118.11170],
        ["zhangtang_fengrunxi", "丰润西", 39.85386, 118.01946],
        ["zhangtang_tuanpiaozhuang", "团瓢庄", 40.10, 117.96],
        ["zhangtang_banbishan", "半壁山", 40.3700, 117.9289],
        ["zhangtang_chengdexi", "承德西", 40.76, 117.72],
        ["zhangtang_luanpingdong", "滦平东", 40.99, 117.43],
        ["zhangtang_fengning", "丰宁", 41.16411, 116.63313],
        ["zhangtang_chicheng", "赤城", 40.84602, 115.87461],
        ["zhangtang_zhangjiakounan", "张家口南", 40.70265, 114.87428]
      ]
    },
    {
      id: "tangshan_jinzhounan",
      name: "唐山—锦州南通道",
      stations: [
        ["jinqinshen_02", "唐山", 39.62424, 118.11170],
        ["jinqin_luanhe", "滦河", 39.85387, 118.67248],
        ["jinqin_changli", "昌黎", 39.70291, 119.16145],
        ["jinqin_beidaihe", "北戴河", 39.84958, 119.41372],
        ["jinqinshen_03", "秦皇岛", 39.96486, 119.58632],
        ["qinshen_shanhaiguan", "山海关", 40.0000, 119.7681],
        ["qinshen_dongdaihe", "东戴河", 40.04095, 119.84086],
        ["qinshen_suizhongbei", "绥中北", 40.34710, 120.31893],
        ["qinshen_xingchengxi", "兴城西", 40.59088, 120.61064],
        ["jinqinshen_04", "葫芦岛北", 40.74169, 120.75820],
        ["jinqinshen_05", "锦州南", 41.01450, 121.12116]
      ]
    },
    {
      id: "tangshan_caofeidiandong",
      name: "唐山—曹妃甸东通道",
      type: "conventional",
      stations: [
        ["jinqinshen_02", "唐山", 39.62424, 118.11170],
        ["tangcao_nanpubei", "南堡北", 39.27659, 118.19932],
        ["tangcao_tanghainan", "唐海南", 39.23737, 118.42620],
        ["tangcao_caofeidiandong", "曹妃甸东", 39.21691, 118.58471]
      ]
    },
    {
      id: "xiongan_yuhuadong",
      name: "雄安—裕华东通道",
      stations: [
        ["jingxiongshang_02", "雄安", 39.055749, 116.153230],
        ["shixiong_xionganchengji", "雄安城际", 39.00063, 115.93069],
        ["shixiong_xiaoli", "小里", 39.000, 115.820],
        ["jingguang_02", "保定东", 38.86346, 115.59573],
        ["shibao_lixianxi", "蠡县西", 38.493, 115.535],
        ["shibao_anguodong", "安国东", 38.420, 115.350],
        ["shibao_wuji", "无极", 38.250, 114.960],
        ["jingguang_zhengdingairport", "正定机场", 38.25131, 114.70333],
        ["shixiong_zhengdingdong", "正定东", 38.15, 114.62],
        ["shixiong_yuhuadong", "裕华东", 38.0088, 114.6593]
      ]
    },
    {
      id: "baodingdong_xinzhouxi",
      name: "保定东—忻州西通道",
      stations: [
        ["jingguang_02", "保定东", 38.86346, 115.59573],
        ["jinxiongxin_baodingnan", "保定南", 38.781, 115.414],
        ["jinxiongxin_wangdoubei", "望都北", 38.74900, 115.11572],
        ["jinxiongxin_tangxian", "唐县", 38.748, 114.981],
        ["jinxiongxin_quyang", "曲阳", 38.622, 114.745],
        ["jinxiongxin_fuping", "阜平", 38.849, 114.195],
        ["jinxiongxin_wutaishan", "五台山", 38.93, 113.67],
        ["jinxiongxin_wutaixian", "五台县", 38.72, 113.26],
        ["jinxiongxin_dingxiangbei", "定襄北", 38.59, 112.97],
        ["zhangdaxi_04", "忻州西", 38.44247, 112.68668]
      ]
    },
    {
      id: "xinzhouxi_taiyuannan",
      name: "忻州西—太原南通道",
      stations: [
        ["zhangdaxi_04", "忻州西", 38.44247, 112.68668],
        ["zhangdaxi_yangquxi", "阳曲西", 38.0721, 112.6409],
        ["zhangdaxi_05", "太原南", 37.79128, 112.60467]
      ]
    },
    {
      id: "xinzhouxi_datongnan",
      name: "忻州西—大同南通道",
      stations: [
        ["zhangdaxi_04", "忻州西", 38.44247, 112.68668],
        ["zhangdaxi_yuanpingxi", "原平西", 38.739, 112.670],
        ["zhangdaxi_yanmenguan", "雁门关", 39.04839, 112.79194],
        ["zhangdaxi_03", "朔州东", 39.30236, 112.59166],
        ["zhangdaxi_shanyinnan", "山阴南", 39.49168, 112.83206],
        ["zhangdaxi_yingxianxi", "应县西", 39.62325, 113.00671],
        ["zhangdaxi_huairendong", "怀仁东", 39.79186, 113.15646],
        ["zhangdaxi_02", "大同南", 40.04356, 113.35812]
      ]
    },
    {
      id: "baodingdong_datongnan",
      name: "保定东—大同南通道",
      stations: [
        ["jingguang_02", "保定东", 38.86346, 115.59573],
        ["dabao_laiyuan", "涞源", 39.370, 114.710],
        ["dabao_lingqiu", "灵丘", 39.462, 114.223],
        ["dabao_hengshan", "恒山", 39.690, 113.720],
        ["zhangdaxi_02", "大同南", 40.04356, 113.35812]
      ]
    },
    {
      id: "xiongan_shangqiu",
      name: "雄安—商丘通道",
      stations: [
        ["jingxiongshang_02", "雄安", 39.055749, 116.153230],
        ["jingxiongshang_renqiuxi", "任丘西", 38.70294, 116.02126],
        ["jingxiongshang_suninghejian", "肃宁河间", 38.416, 115.934],
        ["jingxiongshang_shenzhoudong", "深州东", 38.00489, 115.67193],
        ["jingxiongshang_03", "衡水南", 37.69773, 115.63496],
        ["jingxiongshang_zaoqiangnan", "枣强南", 37.32479, 115.66533],
        ["jingxiongshang_qinghexi", "清河西", 37.07252, 115.60515],
        ["jingxiongshang_linqingdong", "临清东", 36.82285, 115.75720],
        ["jingxiongshang_04", "聊城西", 36.43060, 115.87778],
        ["jingxiongshang_yanggudong", "阳谷东", 36.19711, 115.88712],
        ["jingxiongshang_taqiandong", "台前东", 36.00671, 115.92394],
        ["jingxiongshang_liangshan", "梁山", 35.81861, 115.93111],
        ["jingxiongshang_yuncheng", "郓城", 35.60194, 115.89500],
        ["jingxiongshang_06", "菏泽东", 35.18472, 115.55711],
        ["jingxiongshang_caoxianxi", "曹县西", 34.84784, 115.49951],
        ["jingxiongshang_07", "商丘", 34.44423, 115.65701]
      ]
    },
    {
      id: "shijiazhuang_taiyuannan",
      name: "石家庄—太原南通道",
      stations: [
        ["jingguang_03", "石家庄", 38.01111, 114.47722],
        ["shita_luquan", "鹿泉", 38.0860, 114.3040],
        ["shita_jingxingbei", "井陉北", 38.1514, 114.0191],
        ["shita_02", "阳泉北", 38.1144, 113.4312],
        ["zhangdaxi_05", "太原南", 37.79128, 112.60467]
      ]
    },
    {
      id: "shijiazhuang_jinandong",
      name: "石家庄—济南东通道",
      stations: [
        ["jingguang_03", "石家庄", 38.01111, 114.47722],
        ["shiji_shijiazhuangdong", "石家庄东", 38.04965, 114.62140],
        ["shiji_gaochengnan", "藁城南", 37.9849, 114.8490],
        ["shiji_xinjinan", "辛集南", 37.8817, 115.2045],
        ["shiji_hengshuibei", "衡水北", 37.7727, 115.6692],
        ["shiji_jingzhou", "景州", 37.6450, 116.1326],
        ["jinghu_05", "德州东", 37.41089, 116.45493],
        ["shiji_pingyuandong", "平原东", 37.21734, 116.57632],
        ["shiji_yuchengdong", "禹城东", 37.0626, 116.6852],
        ["shiji_qihe", "齐河", 36.8436, 116.8571],
        ["jiqing_01", "济南东", 36.7484, 117.1541]
      ]
    },
    {
      id: "shijiazhuang_zhengzhoudong",
      name: "石家庄—郑州东通道",
      stations: [
        ["jingguang_03", "石家庄", 38.01111, 114.47722],
        ["jingguang_gaoyixi", "高邑西", 37.62906, 114.52419],
        ["jingguang_04", "邢台东", 37.09114, 114.58545],
        ["jingguang_05", "邯郸东", 36.625, 114.568],
        ["jingguang_06", "安阳东", 36.08415, 114.44796],
        ["jingguang_07", "鹤壁东", 35.70606, 114.29439],
        ["jingguang_08", "新乡东", 35.31471, 113.97293],
        ["jingguang_09", "郑州东", 34.76001, 113.77306]
      ]
    },
    {
      id: "shijiazhuang_zhangjiakou",
      name: "石家庄—张家口通道",
      stations: [
        ["jingguang_03", "石家庄", 38.01111, 114.47722],
        ["shizhang_xingtang", "行唐", 38.438, 114.553],
        ["jinxiongxin_quyang", "曲阳", 38.622, 114.745],
        ["dabao_laiyuan", "涞源", 39.370, 114.710],
        ["shizhang_xiheying", "西合营", 39.94615, 114.76034],
        ["shizhang_yangyuan", "阳原", 40.113, 114.150],
        ["jingbao_xuanhuabei", "宣化北", 40.631230, 115.042504],
        ["jingbao_02", "张家口", 40.750675, 114.876969]
      ]
    },
    {
      id: "hengshuibei_hengshuinan",
      name: "衡水北—衡水南通道",
      stations: [
        ["shiji_hengshuibei", "衡水北", 37.7727, 115.6692],
        ["jingxiongshang_03", "衡水南", 37.69773, 115.63496]
      ]
    },
    {
      id: "shijiazhuang_huanghuagang",
      name: "石家庄—黄骅港通道",
      stations: [
        ["jingguang_03", "石家庄", 38.01111, 114.47722],
        ["shiji_shijiazhuangdong", "石家庄东", 38.04965, 114.62140],
        ["shiji_gaochengnan", "藁城南", 37.9849, 114.8490],
        ["shiji_xinjinan", "辛集南", 37.8817, 115.2045],
        ["shiji_hengshuibei", "衡水北", 37.7727, 115.6692],
        ["hengcang_wuyi", "武邑", 37.800, 115.879],
        ["hengcang_fuchengnan", "阜城南", 37.840, 116.170],
        ["shihuang_jiaohe", "交河", 37.990, 116.310],
        ["baocang_botouxi", "泊头西", 38.080, 116.520],
        ["shihuang_botoudong", "泊头东", 38.120, 116.680],
        ["jinghu_04", "沧州西", 38.30602, 116.76211],
        ["shihuang_cangzhoudong", "沧州东", 38.365, 116.915],
        ["shihuang_huanghuanan", "黄骅南", 38.32, 117.35],
        ["shihuang_huanghuadong", "黄骅东", 38.30, 117.54],
        ["shihuang_huanghuagang", "黄骅港", 38.2762, 117.7297]
      ]
    },
    {
      id: "huanghuanan_huanghuabei",
      name: "黄骅南—黄骅北通道",
      stations: [
        ["shihuang_huanghuanan", "黄骅南", 38.32, 117.35],
        ["jinwei_huanghuabei", "黄骅北", 38.401, 117.385]
      ]
    },
    {
      id: "zhangjiakou_datongnan",
      name: "张家口—大同南通道",
      stations: [
        ["jingbao_02", "张家口", 40.750675, 114.876969],
        ["jingbao_huaian", "怀安", 40.68442, 114.39358],
        ["zhangdaxi_tianzhen", "天镇", 40.45073, 114.06086],
        ["zhangdaxi_yanggaonan", "阳高南", 40.31392, 113.79555],
        ["zhangdaxi_02", "大同南", 40.04356, 113.35812]
      ]
    },
    {
      id: "zhangjiakou_wulanchabu",
      name: "张家口—乌兰察布通道",
      stations: [
        ["jingbao_02", "张家口", 40.750675, 114.876969],
        ["jingbao_huaian", "怀安", 40.68442, 114.39358],
        ["zhanghu_xinghebei", "兴和北", 40.89136, 113.83578],
        ["jingbao_03", "乌兰察布", 40.96326, 113.15239]
      ]
    },
    {
      id: "xiahuayuanbei_xilinhaote",
      name: "下花园北—锡林浩特通道",
      type: "conventional",
      stations: [
        ["jingbao_xiahuayuanbei", "下花园北", 40.502046, 115.295259],
        ["zhangxi_taizicheng", "太子城", 40.91237, 115.44113],
        ["zhangxi_chongli", "崇礼", 41.00588, 115.31101],
        ["zhangxi_zhangbei", "张北", 41.35053, 115.22313],
        ["zhangxi_guyuan", "沽源", 41.70829, 115.57688],
        ["zhangxi_taipusi", "太仆寺旗", 41.821, 115.610],
        ["zhangxi_saibei", "塞北管理区", 41.88186, 115.78511],
        ["zhangxi_heichengzi", "黑城子", 42.00961, 115.83676],
        ["zhangxi_zhenglan", "正蓝旗", 42.251, 116.024],
        ["zhangxi_sangendalaibei", "桑根达来北", 42.71183, 115.95690],
        ["wuxi_02", "锡林浩特", 43.91715, 116.02091]
      ]
    },
    {
      id: "datongnan_wulanchabu",
      name: "大同南—乌兰察布通道",
      stations: [
        ["zhangdaxi_02", "大同南", 40.04356, 113.35812],
        ["jida_fengzhenbei", "丰镇北", 40.44183, 113.12404],
        ["jingbao_03", "乌兰察布", 40.96326, 113.15239]
      ]
    },
    {
      id: "shuozhoudong_huhehaotedong",
      name: "朔州东—呼和浩特东通道",
      stations: [
        ["zhangdaxi_03", "朔州东", 39.30236, 112.59166],
        ["hushuo_pinglu", "平鲁", 39.5000, 112.2413],
        ["hushuo_youyu", "右玉", 39.9882, 112.4677],
        ["hushuo_helingeer", "和林格尔", 40.3765, 111.8146],
        ["hushuo_shengle", "盛乐国际机场", 40.4791, 111.5718],
        ["jingbao_04", "呼和浩特东", 40.84563, 111.75930]
      ]
    },
    {
      id: "taiyuannan_changzhidong",
      name: "太原南—长治东通道",
      stations: [
        ["zhangdaxi_05", "太原南", 37.79128, 112.60467],
        ["zhangdaxi_06", "晋中", 37.68587, 112.63591],
        ["zhengtai_taigudong", "太谷东", 37.45319, 112.62038],
        ["zhengtai_yushexi", "榆社西", 37.11469, 112.78881],
        ["zhengtai_wuxiang", "武乡", 36.8566, 112.8057],
        ["zhengtai_xiangyuandong", "襄垣东", 36.53439, 113.07758],
        ["zhengtai_04", "长治东", 36.22864, 113.15983]
      ]
    },
    {
      id: "taiyuannan_houmaxi",
      name: "太原南—侯马西通道",
      stations: [
        ["zhangdaxi_05", "太原南", 37.79128, 112.60467],
        ["zhangdaxi_06", "晋中", 37.68587, 112.63591],
        ["zhangdaxi_taiguxi", "太谷西", 37.44805, 112.50268],
        ["zhangdaxi_qixiandong", "祁县东", 37.32288, 112.35064],
        ["zhangdaxi_pingyao", "平遥古城", 37.15444, 112.14333],
        ["zhangdaxi_jiexiudong", "介休东", 37.05278, 111.98167],
        ["zhangdaxi_lingshidong", "灵石东", 36.87937, 111.90934],
        ["zhangdaxi_huozhoudong", "霍州东", 36.56461, 111.83111],
        ["zhangdaxi_hongtongxi", "洪洞西", 36.25535, 111.57575],
        ["zhangdaxi_07", "临汾西", 36.10167, 111.45944],
        ["zhangdaxi_xiangfenxi", "襄汾西", 35.83824, 111.33027],
        ["zhangdaxi_houmaxi", "侯马西", 35.60134, 111.28232]
      ]
    },
    {
      id: "taiyuannan_suidexi",
      name: "太原南—绥德西通道",
      stations: [
        ["zhangdaxi_05", "太原南", 37.79128, 112.60467],
        ["taisui_xiaohe", "潇河", 37.50, 112.58],
        ["taisui_wenshui", "文水", 37.43694, 112.07361],
        ["taisui_xinghuacun", "杏花村", 37.3351, 111.9022],
        ["taisui_zhongyangnan", "中阳南", 37.30, 111.19],
        ["taisui_lvliangnan", "吕梁南", 37.46, 111.04],
        ["taisui_liulinxi", "柳林西", 37.43, 110.82],
        ["yanyu_suidexi", "绥德西", 37.53208, 110.20864]
      ]
    },
    {
      id: "changzhidong_liaochengxi",
      name: "长治东—聊城西通道",
      stations: [
        ["zhengtai_04", "长治东", 36.22864, 113.15983],
        ["liaohanchang_lichengnan", "黎城南", 36.48600, 113.40500],
        ["liaohanchang_shexiannan", "涉县南", 36.52000, 113.72500],
        ["liaohanchang_wuannan", "武安南", 36.62000, 114.18000],
        ["liaohanchang_handannan", "邯郸南", 36.52000, 114.49000],
        ["liaohanchang_chengan", "成安", 36.45500, 114.68000],
        ["liaohanchang_weixianbei", "魏县北", 36.43000, 114.96000],
        ["liaohanchang_damingbei", "大名北", 36.37000, 115.08000],
        ["liaohanchang_guantaonan", "馆陶南", 36.50000, 115.24000],
        ["liaohanchang_guanxiannan", "冠县南", 36.44000, 115.41000],
        ["jingxiongshang_04", "聊城西", 36.43060, 115.87778]
      ]
    },
    {
      id: "changzhidong_jiaozuo",
      name: "长治东—焦作通道",
      stations: [
        ["zhengtai_04", "长治东", 36.22864, 113.15983],
        ["zhengtai_changzhinan", "长治南", 36.16500, 113.10500],
        ["zhengtai_gaopingdong", "高平东", 35.80000, 112.95000],
        ["zhengtai_03", "晋城东", 35.50900, 112.92700],
        ["zhengtai_jiaozuoxi", "焦作西", 35.208571, 113.056002],
        ["zhengtai_02", "焦作", 35.22310, 113.22870]
      ]
    },
    {
      id: "changzhidong_linfenxi",
      name: "长治东—临汾西通道",
      stations: [
        ["zhengtai_04", "长治东", 36.22864, 113.15983],
        ["linchang_tunliu", "屯留", 36.34100, 112.76000],
        ["linchang_anze", "安泽", 36.14800, 112.33600],
        ["linchang_fushan", "浮山", 35.93400, 111.92200],
        ["zhangdaxi_07", "临汾西", 36.10167, 111.45944]
      ]
    },
    {
      id: "houmaxi_xianbei",
      name: "侯马西—西安北通道",
      stations: [
        ["zhangdaxi_houmaxi", "侯马西", 35.60134, 111.28232],
        ["zhangdaxi_wenxixi", "闻喜西", 35.32000, 110.98000],
        ["zhangdaxi_08", "运城北", 35.05000, 110.70000],
        ["zhangdaxi_yongjibei", "永济北", 34.98000, 110.35000],
        ["zhangdaxi_dali", "大荔", 34.83000, 109.92000],
        ["lianxulan_08", "渭南北", 34.53690, 109.47588],
        ["lianxulan_09", "西安北", 34.37767, 108.93403]
      ]
    },
    {
      id: "houmaxi_xiandong",
      name: "侯马西—西安东通道",
      stations: [
        ["zhangdaxi_houmaxi", "侯马西", 35.60134, 111.28232],
        ["xihanhou_xinjiangnan", "新绛南", 35.59200, 111.20800],
        ["xihanhou_jishanbei", "稷山北", 35.63200, 110.97500],
        ["xihanhou_hejin", "河津", 35.61000, 110.73000],
        ["yunhan_hanchengdong", "韩城东", 35.50000, 110.45500],
        ["xihanhou_hanchengnan", "韩城南", 35.40200, 110.44500],
        ["xihanhou_heyangdong", "合阳东", 35.24000, 110.20000],
        ["xihanhou_chengchengnan", "澄城南", 35.17000, 109.94000],
        ["xihanhou_puchengnan", "蒲城南", 34.92000, 109.58000],
        ["xiyan_fupingnan", "富平南", 34.70792, 109.20591]
      ]
    },
    {
      id: "houma_jiaozuo",
      name: "侯马—焦作通道",
      type: "conventional",
      stations: [
        ["houma_houma", "侯马", 35.61306, 111.35222],
        ["houyue_quwo", "曲沃", 35.64200, 111.46900],
        ["houyue_yicheng", "翼城", 35.74255, 111.71093],
        ["houyue_qinshui", "沁水", 35.68100, 112.16000],
        ["houyue_yangcheng", "阳城", 35.49283, 112.49282],
        ["houyue_jiyuan", "济源", 35.11104, 112.56744]
      ]
    },
    {
      id: "houma_jiaozuo_east",
      name: "侯马—焦作通道",
      type: "conventional",
      stations: [
        ["houyue_yueshan", "月山", 35.210483, 113.048756],
        ["zhengtai_02", "焦作", 35.22310, 113.22870]
      ]
    },
    {
      id: "houmaxi_luoyanglongmen",
      name: "侯马西—洛阳龙门通道",
      stations: [
        ["zhangdaxi_houmaxi", "侯马西", 35.60134, 111.28232],
        ["zhangdaxi_wenxixi", "闻喜西", 35.32000, 110.98000],
        ["zhangdaxi_08", "运城北", 35.05000, 110.70000],
        ["lianxulan_07", "三门峡南", 34.74959, 111.15422],
        ["lianxulan_mianchinan", "渑池南", 34.68630, 111.76827],
        ["lianxulan_06", "洛阳龙门", 34.59428, 112.45269]
      ]
    },
    {
      id: "xianbei_luoyanglongmen",
      name: "西安北—洛阳龙门通道",
      stations: [
        ["lianxulan_09", "西安北", 34.37767, 108.93403],
        ["lianxulan_08", "渭南北", 34.53690, 109.47588],
        ["lianxulan_huashanbei", "华山北", 34.58320, 110.09303],
        ["lianxulan_lingbaoxi", "灵宝西", 34.57798, 110.68366],
        ["lianxulan_07", "三门峡南", 34.74959, 111.15422],
        ["lianxulan_mianchinan", "渑池南", 34.68630, 111.76827],
        ["lianxulan_06", "洛阳龙门", 34.59428, 112.45269]
      ]
    },
    {
      id: "xianbei_baojinan",
      name: "西安北—宝鸡南通道",
      stations: [
        ["lianxulan_09", "西安北", 34.37767, 108.93403],
        ["lianxulan_10", "咸阳西", 34.33234, 108.66255],
        ["lianxulan_yanglingnan", "杨陵南", 34.25560, 108.04832],
        ["lianxulan_qishan", "岐山", 34.27532, 107.60816],
        ["lianxulan_11", "宝鸡南", 34.33514, 107.22775]
      ]
    },
    {
      id: "xianbei_yinchuan",
      name: "西安北—银川通道",
      stations: [
        ["lianxulan_09", "西安北", 34.37767, 108.93403],
        ["xiyin_xianyangbei", "咸阳北", 34.42029, 108.66967],
        ["xiyin_liquannan", "礼泉南", 34.46292, 108.40321],
        ["xiyin_qianxian", "乾县", 34.50641, 108.27859],
        ["xiyin_yongshouxi", "永寿西", 34.69677, 108.11326],
        ["xiyin_binzhoudong", "彬州东", 35.03618, 108.12016],
        ["xiyin_ningxian", "宁县", 35.48892, 107.93277],
        ["xiyin_03", "庆阳", 35.69485, 107.62354],
        ["xiyin_qingcheng", "庆城", 36.07749, 107.78581],
        ["xiyin_quzi", "曲子", 36.31969, 107.48921],
        ["xiyin_huanxian", "环县", 36.51598, 107.37046],
        ["xiyin_tianshuibu", "甜水堡", 37.13616, 106.80920],
        ["xiyin_huianbao", "惠安堡", 37.47823, 106.67226],
        ["xiyin_04", "吴忠", 37.97647, 106.24493],
        ["xiyin_lingwubei", "灵武北", 38.13441, 106.31226],
        ["xiyin_hedongjichang", "河东机场", 38.32179, 106.38185],
        ["baoyin_06", "银川", 38.49168, 106.16862]
      ]
    },
    {
      id: "xiandong_gaoling",
      name: "西安东—高陵通道",
      stations: [
        ["xiwu_01", "西安东", 34.21550, 109.05891],
        ["xiyan_gaoling", "高陵", 34.50757, 109.12846]
      ]
    },
    {
      id: "xiandong_suidexi",
      name: "富平南—绥德西通道",
      stations: [
        ["xiyan_fupingnan", "富平南", 34.70792, 109.20591],
        ["xiyubao_02", "铜川", 34.90222, 108.96444],
        ["xiyan_tongchuanbei", "铜川北", 35.08962, 109.04330],
        ["xiyan_yijun", "宜君", 35.41078, 109.12996],
        ["xiyan_huangling", "黄陵", 35.58928, 109.21267],
        ["xiyan_luochuan", "洛川", 35.76340, 109.44236],
        ["xiyan_fuxianbei", "富县北", 36.050, 109.350],
        ["xiyan_ganquanbei", "甘泉北", 36.27807, 109.34053],
        ["xiyubao_03", "延安", 36.55722, 109.47556],
        ["yanyu_yananxinqu", "延安新区", 36.640, 109.590],
        ["yanyu_yanchuan", "延川", 36.865, 110.090],
        ["yanyu_qingjianbei", "清涧北", 37.14325, 110.12756],
        ["yanyu_suidexi", "绥德西", 37.53208, 110.20864]
      ]
    },
    {
      id: "xiandong_ankangxi",
      name: "西安东—安康西通道",
      stations: [
        ["xiwu_01", "西安东", 34.21550, 109.05891],
        ["xiyu_niubeiliang", "牛背梁", 33.85680, 109.04664],
        ["xiyu_zhashuixi", "柞水西", 33.65948, 109.09464],
        ["xiyu_zhenanxi", "镇安西", 33.44150, 109.10767],
        ["xiyu_02", "安康西", 32.73289, 108.94679]
      ]
    },
    {
      id: "xianbei_guangyuan",
      name: "西安北—广元通道",
      stations: [
        ["lianxulan_09", "西安北", 34.37767, 108.93403],
        ["xicheng_xianxi", "西安西", 34.27125, 108.75160],
        ["xicheng_huyi", "鄠邑", 34.08098, 108.67572],
        ["xicheng_foping", "佛坪", 33.50185, 107.97935],
        ["xicheng_yangxianxi", "洋县西", 33.22871, 107.51856],
        ["xicheng_chenggubei", "城固北", 33.18598, 107.30145],
        ["xicheng_02", "汉中", 33.09065, 107.02565],
        ["xicheng_ningqiangnan", "宁强南", 32.82383, 106.28507],
        ["xicheng_chaotiannan", "朝天南", 32.64036, 105.87502],
        ["xicheng_03", "广元", 32.45268, 105.81778]
      ]
    },
    {
      id: "xiandong_xiangyangdong",
      name: "西安东—襄阳东通道",
      stations: [
        ["xiwu_01", "西安东", 34.21550, 109.05891],
        ["xiwu_lantian", "蓝田", 34.080, 109.220],
        ["xiwu_02", "商洛西", 33.86794, 109.85686],
        ["xiwu_shanyang", "山阳", 33.50371, 109.99589],
        ["xiwu_manchuanguan", "漫川关", 33.25806, 110.07025],
        ["xiwu_yunxi", "郧西", 33.00748, 110.45983],
        ["xiwu_03", "十堰东", 32.70974, 110.81880],
        ["xiwu_wudangshanxi", "武当山西", 32.53997, 111.00862],
        ["xiwu_danjiangkou", "丹江口", 32.45931, 111.38229],
        ["xiwu_guchengbei", "谷城北", 32.30801, 111.62490],
        ["zhengyu_04", "襄阳东", 32.01631, 112.29051]
      ]
    },
    {
      id: "baojinan_lanzhouxi",
      name: "宝鸡南—兰州西通道",
      stations: [
        ["lianxulan_11", "宝鸡南", 34.33514, 107.22775],
        ["lianxulan_dongcha", "东岔", 34.44321, 106.53475],
        ["lianxulan_12", "天水南", 34.55102, 105.85233],
        ["lianxulan_qinan", "秦安", 34.84723, 105.65526],
        ["lianxulan_tongwei", "通渭", 35.19572, 105.25877],
        ["lianxulan_13", "定西北", 35.60610, 104.58554],
        ["lianxulan_yuzhong", "榆中", 35.85167, 104.16889],
        ["lianxulan_14", "兰州西", 36.06758, 103.74928]
      ]
    },
    {
      id: "baoji_chaotiannan",
      name: "宝鸡—朝天南通道",
      type: "conventional",
      stations: [
        ["baoji_baoji", "宝鸡", 34.37418, 107.14807],
        ["baocheng_qinling", "秦岭", 34.23510, 106.90119],
        ["baocheng_fengzhou", "凤州", 33.97160, 106.65093],
        ["baocheng_fengxian", "凤县", 33.912, 106.519],
        ["baocheng_liangdang", "两当", 33.77662, 106.30656],
        ["baocheng_huixian", "徽县", 33.700, 106.200],
        ["baocheng_lueyang", "略阳", 33.33284, 106.14191],
        ["baocheng_yangpingguan", "阳平关", 32.96861, 106.03333],
        ["baocheng_yanzibian", "燕子砭", 32.91860, 105.94013],
        ["xicheng_chaotiannan", "朝天南", 32.64036, 105.87502]
      ]
    },
    {
      id: "baoji_zhongwei",
      name: "宝鸡—中卫通道",
      type: "conventional",
      stations: [
        ["baoji_baoji", "宝鸡", 34.37418, 107.14807],
        ["baozhong_qianyang", "千阳", 34.650, 107.130],
        ["baozhong_longxian", "陇县", 34.884, 106.855],
        ["baozhong_ankouyao", "安口窑", 35.23562, 106.80865],
        ["xiping_pingliangnan", "平凉南", 35.48402, 106.82283],
        ["baozhong_02", "平凉", 35.55104, 106.70341],
        ["baozhong_03", "固原", 36.02117, 106.30128],
        ["baozhong_tongxin", "同心", 36.99407, 105.92667],
        ["baozhong_zhongwei", "中卫", 37.52171, 105.18635]
      ]
    },
    {
      id: "ankangxi_hanzhong",
      name: "安康西—汉中通道",
      stations: [
        ["xiyu_02", "安康西", 32.73289, 108.94679],
        ["hananshi_hanyin", "汉阴", 32.89323, 108.50755],
        ["hananshi_shiquan", "石泉", 33.03110, 108.24676],
        ["hananshi_xixiang", "西乡", 32.99300, 107.75700],
        ["xicheng_02", "汉中", 33.09065, 107.02565]
      ]
    },
    {
      id: "ankangxi_shiyandong",
      name: "安康西—十堰东通道",
      stations: [
        ["xiyu_02", "安康西", 32.73289, 108.94679],
        ["hananshi_xunyang", "旬阳", 32.83794, 109.34813],
        ["hananshi_baihe", "白河", 32.83596, 110.09293],
        ["xiwu_03", "十堰东", 32.70974, 110.81880]
      ]
    },
    {
      id: "ankangxi_dazhounan",
      name: "安康西—达州南通道",
      stations: [
        ["xiyu_02", "安康西", 32.73289, 108.94679],
        ["xiyu_langao", "岚皋", 32.32592, 108.90734],
        ["xiyu_chengkou", "城口", 31.938, 108.678],
        ["xiyu_fankuai", "樊哙", 31.57917, 108.17201],
        ["xiyu_xuanhannan", "宣汉南", 31.31058, 107.75929],
        ["xiyu_03", "达州南", 31.09499, 107.47290]
      ]
    },
    {
      id: "fankuai_wanzhoubei",
      name: "樊哙—万州北通道",
      stations: [
        ["xiyu_fankuai", "樊哙", 31.57917, 108.17201],
        ["xiyu_kaizhou", "开州", 31.190, 108.400],
        ["zhengyu_06", "万州北", 30.86558, 108.36214]
      ]
    },
    {
      id: "suidexi_baotoudong",
      name: "绥德西—包头东通道",
      stations: [
        ["yanyu_suidexi", "绥德西", 37.53208, 110.20864],
        ["yanyu_mizhibei", "米脂北", 37.79394, 110.12759],
        ["xiyubao_04", "榆林南", 38.21897, 109.73404],
        ["xiyubao_05", "鄂尔多斯", 39.55975, 109.83716],
        ["baoeyu_dalateqi", "达拉特旗", 40.39762, 109.98807],
        ["jingbao_baotoudong", "包头东", 40.56906, 110.01894]
      ]
    },
    {
      id: "suidexi_lingwubei",
      name: "绥德西—灵武北通道",
      stations: [
        ["yanyu_suidexi", "绥德西", 37.53208, 110.20864],
        ["suiyin_zizhou", "子洲", 37.61065, 109.94766],
        ["taiyin_jingbian", "靖边", 37.596, 108.807],
        ["taiyin_dingbian", "定边", 37.56139, 107.57306],
        ["taiyin_yanchi", "盐池", 37.792, 107.391],
        ["xiyin_lingwubei", "灵武北", 38.13441, 106.31226]
      ]
    },
    {
      id: "yanchi_zhongwei",
      name: "盐池—中卫通道",
      type: "conventional",
      stations: [
        ["taiyin_yanchi", "盐池", 37.792, 107.391],
        ["yanzhong_hongsibao", "红寺堡", 37.44821, 106.06052],
        ["yanzhong_zhongning", "中宁", 37.620, 105.690],
        ["baozhong_zhongwei", "中卫", 37.52171, 105.18635]
      ]
    },
    {
      id: "lanzhouxi_wuweidong",
      name: "兰州西—武威东通道",
      stations: [
        ["lianxulan_14", "兰州西", 36.06758, 103.74928],
        ["lanzhang_lanzhouxinqu", "兰州新区", 36.46972, 103.61566],
        ["lanzhang_zhongchuanjichangdong", "中川机场东", 36.52009, 103.63477],
        ["lanzhang_yongdengbei", "永登北", 36.72307, 103.24314],
        ["lanzhang_tianzhuxi", "天祝西", 36.99862, 103.11310],
        ["lanzhang_gulangbei", "古浪北", 37.51107, 102.91385],
        ["lanzhang_02", "武威东", 37.95714, 102.69158]
      ]
    },
    {
      id: "lanzhouxi_xining",
      name: "兰州西—西宁通道",
      stations: [
        ["lianxulan_14", "兰州西", 36.06758, 103.74928],
        ["lanxin_minhenan", "民和南", 36.30594, 102.84801],
        ["lanxin_haidong", "海东", 36.46714, 102.38939],
        ["lanxin_02", "海东西", 36.50985, 102.05358],
        ["lanxin_03", "西宁", 36.62076, 101.81304]
      ]
    },
    {
      id: "lanzhouxi_zhongweinan",
      name: "兰州西—中卫南通道",
      stations: [
        ["lianxulan_14", "兰州西", 36.06758, 103.74928],
        ["yinlan_qinwangchuan", "秦王川", 36.47037, 103.76637],
        ["yinlan_04", "白银南", 36.47650, 104.18039],
        ["yinlan_jingyuanbei", "靖远北", 36.60917, 104.66023],
        ["yinlan_pingchuanxi", "平川西", 36.75938, 104.72709],
        ["yinlan_beitan", "北滩", 37.05362, 104.86515],
        ["yinlan_03", "中卫南", 37.47218, 105.17519]
      ]
    },
    {
      id: "dingxibei_pingliang",
      name: "定西北—平凉通道",
      type: "conventional",
      stations: [
        ["lianxulan_13", "定西北", 35.60610, 104.58554],
        ["dingping_huining", "会宁", 35.692, 105.054],
        ["dingping_jingning", "静宁", 35.525, 105.733],
        ["dingping_longde", "隆德", 35.618, 106.123],
        ["baozhong_02", "平凉", 35.55104, 106.70341]
      ]
    },
    {
      id: "lanzhouxi_guangyuan",
      name: "兰州西—广元通道",
      type: "conventional",
      stations: [
        ["lianxulan_14", "兰州西", 36.06758, 103.74928],
        ["langyu_lanzhou", "兰州", 36.03418, 103.84851],
        ["langyu_xiaguanying", "夏官营", 35.953091, 104.176820],
        ["langyu_weiyuan", "渭源", 35.09712, 104.22558],
        ["langyu_zhangxian", "漳县", 34.72111, 104.15222],
        ["langyu_minxian", "岷县", 34.39318, 104.06719],
        ["langyu_hadapu", "哈达铺", 34.22153, 104.23165],
        ["langyu_02", "陇南", 33.37714, 104.95694],
        ["langyu_yaodu", "姚渡", 32.805759, 105.494319],
        ["xicheng_03", "广元", 32.45268, 105.81778]
      ]
    },
    {
      id: "lanzhouxi_qingbaijiangdong",
      name: "兰州西—青白江东通道",
      type: "conventional",
      stations: [
        ["lianxulan_14", "兰州西", 36.06758, 103.74928],
        ["lanhe_liujiaxia", "刘家峡", 35.936, 103.316],
        ["lanhe_02", "临夏", 35.578, 103.187],
        ["lanhe_shuangcheng", "双城", 35.502, 103.111],
        ["chuanqing_03", "合作", 34.95601, 102.87900],
        ["chuanqing_bola", "博拉", 34.85, 102.85],
        ["chuanqing_luqu", "碌曲", 34.53, 102.77],
        ["chuanqing_zecha", "则岔", 34.26487, 102.63102],
        ["chuanqing_langmusi", "郎木寺", 34.0883, 102.6437],
        ["chuanqing_huahu", "花湖", 33.997, 102.824],
        ["chuanqing_axi", "阿西", 33.745, 103.028],
        ["chuanqing_ruoergai", "若尔盖", 33.575, 102.990],
        ["chuanqing_banyou", "班佑", 33.324, 103.172],
        ["chuanqing_hongyuan", "红原", 33.1058, 103.3144],
        ["chuanqing_huangshengguan", "黄胜关", 32.8951, 103.5251],
        ["chuanqing_huanglongjiuzhai", "黄龙九寨", 32.748, 103.614],
        ["chuanqing_songpan", "松潘", 32.60053, 103.60375],
        ["chuanqing_zhenjiangguan", "镇江关", 32.33233, 103.72054],
        ["chuanqing_diexi", "叠溪", 32.12285, 103.73902],
        ["chuanqing_shidaguan", "石大关", 31.86838, 103.71272],
        ["chuanqing_maoxian", "茂县", 31.72792, 103.94249],
        ["chuanqing_gaochuan", "高川", 31.63746, 104.20453],
        ["chuanqing_anzhou", "安州", 31.46520, 104.23414],
        ["chuanqing_mianzhunan", "绵竹南", 31.26110, 104.20957],
        ["chuanqing_shifangxi", "什邡西", 31.12357, 104.11786],
        ["chuanqing_sanxingdui", "三星堆", 30.94389, 104.20810],
        ["xicheng_qingbaijiangdong", "青白江东", 30.89724, 104.22308]
      ]
    },
    {
      id: "qingbaijiangdong_chengdudong",
      name: "青白江东—成都东通道",
      stations: [
        ["xicheng_qingbaijiangdong", "青白江东", 30.89724, 104.22308],
        ["xicheng_06", "成都东", 30.63158, 104.13805]
      ]
    },
    {
      id: "pingliangnan_xian",
      name: "平凉南—西安站通道",
      type: "conventional",
      stations: [
        ["xiping_pingliangnan", "平凉南", 35.48402, 106.82283],
        ["xiping_baishui", "白水", 35.4745, 106.9345],
        ["xiping_jingchuan", "泾川", 35.34875, 107.36103],
        ["xiping_changqingqiao", "长庆桥", 35.31400, 107.75315],
        ["xiping_changwu", "长武", 35.256, 107.817],
        ["xiping_binzhou", "彬州", 35.04626, 108.09962],
        ["xiping_yongshou", "永寿", 34.707128, 108.147052],
        ["xiyin_qianxian", "乾县", 34.50641, 108.27859],
        ["xiping_liquan", "礼泉", 34.4315, 108.4200],
        ["xiping_maoling", "茂陵", 34.31904, 108.61769],
        ["xiping_xianyang", "咸阳", 34.337, 108.706],
        ["xiping_xian", "西安站", 34.27996, 108.95790]
      ]
    },
    {
      id: "baishui_qingyang",
      name: "白水—庆阳通道",
      type: "conventional",
      stations: [
        ["xiping_baishui", "白水", 35.4745, 106.9345],
        ["pingqing_zhenyuan", "镇原", 35.6310, 107.3000],
        ["pingqing_beishiku", "北石窟", 35.62524, 107.45226],
        ["xiyin_03", "庆阳", 35.69485, 107.62354]
      ]
    },
    {
      id: "ankouyao_tianshui",
      name: "安口窑—天水通道",
      type: "conventional",
      stations: [
        ["baozhong_ankouyao", "安口窑", 35.23562, 106.80865],
        ["tianping_ankounan", "安口南", 35.19934, 106.76784],
        ["baozhong_huating", "华亭", 35.1900, 106.7200],
        ["tianping_zhangjiachuan", "张家川", 34.96700, 106.33870],
        ["tianping_qingshui", "清水县", 34.75722, 106.09778],
        ["tianping_tianshui", "天水", 34.56710, 105.89493]
      ]
    },
    {
      id: "wuweidong_zhangyexi",
      name: "武威东—张掖西通道",
      stations: [
        ["lanzhang_02", "武威东", 37.95714, 102.69158],
        ["lanzhang_zhuwangbao", "朱王堡", 38.19920, 102.59660],
        ["lanzhang_03", "金昌南", 38.455, 102.228],
        ["lanzhang_jilingxi", "芨岭西", 38.610, 101.700],
        ["lanzhang_shandanbei", "山丹北", 38.81223, 101.09306],
        ["lanxin_04", "张掖西", 38.92219, 100.42873]
      ]
    },
    {
      id: "wuweinan_zhongwei",
      name: "武威南—中卫通道",
      type: "conventional",
      stations: [
        ["ganwu_wuweinan", "武威南", 37.81506, 102.73555],
        ["ganwu_shangyaodun", "上腰墩", 37.77275, 102.83162],
        ["ganwu_heichongtan", "黑冲滩", 37.64240, 103.33869],
        ["ganwu_tanjiajing", "谭家井", 37.59042, 103.59073],
        ["ganwu_gantang", "干塘", 37.45481, 104.52131],
        ["ganwu_shapotou", "沙坡头", 37.465, 104.996],
        ["ganwu_yingshuiqiao", "迎水桥", 37.477, 105.088],
        ["baozhong_zhongwei", "中卫", 37.52171, 105.18635]
      ]
    },
    {
      id: "xining_zhangyexi",
      name: "西宁—张掖西通道",
      stations: [
        ["lanxin_03", "西宁", 36.62076, 101.81304],
        ["lanxin_datongxi", "大通西", 36.96583, 101.67194],
        ["lanxin_menyuan", "门源", 37.42653, 101.52625],
        ["lanxin_shandanmachang", "山丹马场", 38.09410, 101.20410],
        ["lanxin_minle", "民乐", 38.47333, 100.83742],
        ["lanxin_04", "张掖西", 38.92219, 100.42873]
      ]
    },
    {
      id: "zhangyexi_wulumuqi",
      name: "张掖西—乌鲁木齐通道",
      stations: [
        ["lanxin_04", "张掖西", 38.92219, 100.42873],
        ["lanxin_linzenan", "临泽南", 39.13409, 100.12492],
        ["lanxin_gaotainan", "高台南", 39.29392, 99.76768],
        ["lanxin_qingshuibei", "清水北", 39.37348, 99.09654],
        ["lanxin_05", "酒泉南", 39.69694, 98.52972],
        ["lanxin_06", "嘉峪关南", 39.71664, 98.30932],
        ["lanxin_yumen", "玉门", 40.28028, 97.04500],
        ["dunge_liugounan", "柳沟南", 40.7042, 96.4020],
        ["lanxin_liuyuannan", "柳园南", 41.10060, 95.47079],
        ["lanxin_07", "哈密", 42.84844, 93.50465],
        ["lanxin_tuha", "吐哈", 43.05984, 90.52940],
        ["lanxin_shanshanbei", "鄯善北", 42.91694, 90.19389],
        ["lanxin_08", "吐鲁番北", 43.02139, 89.10806],
        ["lanxin_wulumuqinan", "乌鲁木齐南", 43.77917, 87.58333],
        ["lanxin_09", "乌鲁木齐", 43.83798, 87.52408]
      ]
    },
    {
      id: "xining_geermu",
      name: "西宁—格尔木通道",
      type: "conventional",
      stations: [
        ["lanxin_03", "西宁", 36.62076, 101.81304],
        ["qingzang_huangyuan", "湟源", 36.613, 101.175],
        ["qingzang_haiyan", "海晏", 37.090, 100.803],
        ["qingzang_gangcha", "刚察", 37.326, 100.145],
        ["qingzang_tianjun", "天峻", 37.350, 99.150],
        ["qingzang_wulan", "乌兰", 37.050, 98.200],
        ["qingzang_02", "德令哈", 37.315, 97.383],
        ["dunge_yinmaxia", "饮马峡", 37.32337, 95.87117],
        ["qingzang_xitieshan", "锡铁山", 37.257, 95.633],
        ["qingzang_chaerhan", "察尔汗", 36.796, 95.302],
        ["qingzang_03", "格尔木", 36.38294, 94.90614]
      ]
    },
    {
      id: "haidongxi_hezuo",
      name: "海东西—合作通道",
      type: "conventional",
      stations: [
        ["lanxin_02", "海东西", 36.50985, 102.05358],
        ["chuanqing_dongping", "东平", 36.39, 102.10],
        ["chuanqing_hualong", "化隆", 36.17, 102.06],
        ["chuanqing_jianzha", "尖扎", 35.940, 102.029],
        ["chuanqing_04", "同仁", 35.66516, 102.07795],
        ["chuanqing_ganjia", "甘加", 35.3524, 102.4114],
        ["chuanqing_xiahe", "夏河", 35.1958, 102.5843],
        ["chuanqing_tanggaang", "唐尕昂", 35.1186, 102.8519],
        ["chuanqing_03", "合作", 34.95601, 102.87900]
      ]
    },
    {
      id: "yinmaxia_liugounan",
      name: "饮马峡—柳沟南通道",
      type: "conventional",
      stations: [
        ["dunge_yinmaxia", "饮马峡", 37.32337, 95.87117],
        ["dunge_xiaochaidan", "小柴旦", 37.58846, 95.58633],
        ["dunge_dachaidan", "大柴旦", 37.88353, 95.33911],
        ["dunge_yuka", "鱼卡", 38.08108, 94.91774],
        ["dunge_mahai", "马海", 38.39318, 94.35951],
        ["dunge_suganhu", "苏干湖", 38.88856, 94.37141],
        ["dunge_dangjinshan", "当金山", 39.18957, 94.30522],
        ["dunge_subei", "肃北", 39.5180, 94.7730],
        ["dunge_akesai", "阿克塞", 39.61291, 94.36768],
        ["dunge_dunhuang", "敦煌", 40.16785, 94.78341],
        ["dunge_shuangta", "双塔", 40.64867, 96.36805],
        ["dunge_liugounan", "柳沟南", 40.7042, 96.4020]
      ]
    },
    {
      id: "geermu_lasa",
      name: "格尔木—拉萨通道",
      type: "conventional",
      stations: [
        ["qingzang_03", "格尔木", 36.38294, 94.90614],
        ["qingzang_nachitai", "纳赤台", 35.87244, 94.55469],
        ["qingzang_yuzhufeng", "玉珠峰", 35.72962, 94.30755],
        ["qingzang_wudaoliang", "五道梁", 35.196, 93.081],
        ["qingzang_tuotuohe", "沱沱河", 34.23318, 92.44573],
        ["qingzang_tanggula", "唐古拉", 33.00518, 91.64933],
        ["qingzang_anduo", "安多", 32.251, 91.668],
        ["qingzang_04", "那曲", 31.44535, 91.98957],
        ["qingzang_dangxiong", "当雄", 30.47463, 91.10461],
        ["qingzang_yangbajing", "羊八井", 30.10572, 90.53905],
        ["chuanzang_07", "拉萨", 29.62586, 91.06874]
      ]
    },
    {
      id: "geermu_kuerle",
      name: "格尔木—库尔勒通道",
      type: "conventional",
      stations: [
        ["qingzang_03", "格尔木", 36.38294, 94.90614],
        ["geku_wutumeiren", "乌图美仁", 36.89555, 93.19259],
        ["geku_mangya", "茫崖", 38.25105, 90.80594],
        ["geku_yitunbulake", "依吞布拉克", 38.393, 90.158],
        ["geku_milan", "米兰", 39.14029, 88.87915],
        ["heruo_03", "若羌", 39.00312, 88.24960],
        ["geku_tieganlike", "铁干里克", 40.62658, 87.67351],
        ["geku_kuermuyi", "库尔木依", 40.82928, 87.22042],
        ["geku_yuli", "尉犁", 41.350, 86.357],
        ["nanjiang_01", "库尔勒", 41.74570, 86.19266]
      ]
    },
    {
      id: "lasa_rikaze",
      name: "拉萨—日喀则通道",
      type: "conventional",
      stations: [
        ["chuanzang_07", "拉萨", 29.62586, 91.06874],
        ["lasa_xierong", "协荣", 29.39166, 90.91585],
        ["lasa_qushuixian", "曲水县", 29.35320, 90.69511],
        ["lasa_nimu", "尼木", 29.33096, 90.28192],
        ["lasa_renbu", "仁布", 29.31351, 89.81257],
        ["xinzang_03", "日喀则", 29.22333, 88.91194]
      ]
    },
    {
      id: "lasa_tianfu",
      name: "拉萨—天府通道",
      type: "conventional",
      stations: [
        ["chuanzang_07", "拉萨", 29.62586, 91.06874],
        ["lasa_xierong", "协荣", 29.39166, 90.91585],
        ["chuanzang_gongga", "贡嘎", 29.29035, 91.03982],
        ["chuanzang_zhanang", "扎囊", 29.26345, 91.33886],
        ["chuanzang_06", "山南", 29.24668, 91.75711],
        ["chuanzang_sangri", "桑日", 29.26236, 92.02991],
        ["chuanzang_jiacha", "加查", 29.14399, 92.56918],
        ["chuanzang_langxian", "朗县", 29.04777, 93.04023],
        ["chuanzang_milin", "米林", 29.23368, 94.21593],
        ["chuanzang_gangga", "岗嘎", 29.32360, 94.33660],
        ["chuanzang_05", "林芝", 29.52974, 94.43633],
        ["chuanzang_lulang", "鲁朗", 29.83089, 94.73817],
        ["chuanzang_bomi", "波密", 29.89696, 95.59679],
        ["chuanzang_luolong", "洛隆", 30.322, 96.205],
        ["chuanzang_bangda", "邦达", 30.21041, 97.29252],
        ["chuanzang_04", "昌都", 30.96936, 97.35655],
        ["chuanzang_gongjue", "贡觉", 30.77351, 98.35082],
        ["chuanzang_baiyu", "白玉", 30.671, 99.174],
        ["chuanzang_batang", "巴塘", 30.295, 99.399],
        ["chuanzang_maoyaba", "毛垭坝", 30.22178, 99.86182],
        ["chuanzang_litang", "理塘", 29.97563, 100.25277],
        ["chuanzang_xieluo", "西俄洛", 30.04098, 100.58579],
        ["chuanzang_yajiang", "雅江", 30.108, 101.022],
        ["chuanzang_xinduqiao", "新都桥", 30.07212, 101.47649],
        ["chuanzang_03", "康定", 30.12940, 101.92899],
        ["chuanzang_luding", "泸定", 29.932, 102.227],
        ["chuanzang_tianquan", "天全", 30.01503, 102.83945],
        ["chuanzang_02", "雅安", 30.03132, 103.05470],
        ["chuanzang_mingshan", "名山", 30.108, 103.132],
        ["chuanzang_chaoyanghu", "朝阳湖", 30.171, 103.443],
        ["chuanzang_pujiang", "蒲江", 30.194, 103.489],
        ["chuanzang_shouan", "寿安", 30.345, 103.648],
        ["chuanzang_xinjinnan", "新津南", 30.35159, 103.85425],
        ["chuanzang_tianfu", "天府", 30.39437, 104.14939]
      ]
    },
    {
      id: "dali_bomi",
      name: "大理—波密通道",
      type: "conventional",
      stations: [
        ["diancang_03", "大理", 25.59195, 100.24852],
        ["dianzang_heqing", "鹤庆", 26.55917, 100.21591],
        ["diancang_04", "丽江", 26.81378, 100.25123],
        ["dianzang_lashihai", "拉市海", 26.88442, 100.16725],
        ["dianzang_hutiaoxia", "虎跳峡", 27.1800, 100.0850],
        ["dianzang_xiaozhongdian", "小中甸", 27.56241, 99.81347],
        ["diancang_05", "香格里拉", 27.81403, 99.68887],
        ["dianzang_deqin", "德钦", 28.47520, 98.91770],
        ["dianzang_yanjing", "盐井", 29.04622, 98.59255],
        ["dianzang_mangkang", "芒康", 29.68250, 98.59361],
        ["dianzang_rumei", "如美", 29.61756, 98.35092],
        ["dianzang_zuogong", "左贡", 29.70489, 97.79968],
        ["chuanzang_bangda", "邦达", 30.21041, 97.29252],
        ["dianzang_basu", "八宿", 30.06028, 96.92583],
        ["dianzang_ranwu", "然乌", 29.50394, 96.75639],
        ["dianzang_songzong", "松宗", 29.83333, 96.10000],
        ["dianzang_bomidong", "波密东", 29.82, 95.80],
        ["chuanzang_bomi", "波密", 29.89696, 95.59679]
      ]
    },
    {
      id: "wulumuqi_kuitun",
      name: "乌鲁木齐—奎屯通道",
      type: "conventional",
      stations: [
        ["lanxin_09", "乌鲁木齐", 43.83798, 87.52408],
        ["beijiang_04", "昌吉", 43.94643, 87.19105],
        ["beijiang_shihezi", "石河子", 44.26748, 86.06049],
        ["beijiang_shawanshi", "沙湾市", 44.32104, 85.60605],
        ["beijiang_01", "奎屯", 44.40291, 84.89819]
      ]
    },
    {
      id: "turpan_kuerle",
      name: "吐鲁番—库尔勒通道",
      type: "conventional",
      stations: [
        ["nanjiang_turpan", "吐鲁番", 43.14753, 88.85552],
        ["nanjiang_tuokexun", "托克逊", 43.04575, 88.26425],
        ["nanjiang_malan", "马兰", 42.23355, 87.37766],
        ["nanjiang_heshuo", "和硕", 42.30232, 86.87432],
        ["nanjiang_yanqi", "焉耆", 42.07616, 86.54633],
        ["nanjiang_01", "库尔勒", 41.74570, 86.19266]
      ]
    },
    {
      id: "wulumuqi_aletai",
      name: "乌鲁木齐—阿勒泰通道",
      type: "conventional",
      stations: [
        ["lanxin_09", "乌鲁木齐", 43.83798, 87.52408],
        ["afuzhun_zhundong", "准东", 44.73555, 89.11022],
        ["afuzhun_fuyun", "富蕴", 46.93, 89.54],
        ["beijiang_03", "阿勒泰", 47.71758, 88.08711]
      ]
    },
    {
      id: "hami_linhe",
      name: "哈密—临河通道",
      type: "conventional",
      stations: [
        ["lanxin_07", "哈密", 42.84844, 93.50465],
        ["linha_hamidong", "哈密东", 42.74153, 93.59219],
        ["linha_wutongshui", "梧桐水", 42.3, 95.8],
        ["linha_mingshui", "明水", 41.9, 96.1],
        ["linha_mazongshan", "马鬃山", 41.8087, 97.0279],
        ["linha_ejina", "额济纳", 41.89622, 101.03229],
        ["linha_linhe", "临河", 40.74221, 107.42453]
      ]
    },
    {
      id: "hami_milan",
      name: "哈密—米兰通道",
      type: "conventional",
      stations: [
        ["lanxin_07", "哈密", 42.84844, 93.50465],
        ["hamimi_luozhong", "罗中", 40.50362, 90.92252],
        ["geku_milandong", "米兰东", 39.13478, 89.05480],
        ["geku_milan", "米兰", 39.14029, 88.87915]
      ]
    },
    {
      id: "kuitun_alashankou",
      name: "奎屯—阿拉山口通道",
      type: "conventional",
      stations: [
        ["beijiang_01", "奎屯", 44.40291, 84.89819],
        ["beijiang_wusu", "乌苏", 44.40766, 84.71534],
        ["beijiang_jinghe", "精河", 44.65, 83.10],
        ["beijiang_alashankou", "阿拉山口", 45.17027, 82.57046]
      ]
    },
    {
      id: "jinghe_huoerguosi",
      name: "精河—霍尔果斯通道",
      type: "conventional",
      stations: [
        ["beijiang_jinghe", "精河", 44.65, 83.10],
        ["jingyihuo_jinghenan", "精河南", 44.60508, 82.91829],
        ["jingyihuo_nileke", "尼勒克", 43.96596, 82.04578],
        ["jingyihuo_buliekai", "布列开", 43.89852, 81.79239],
        ["yiku_01", "伊宁", 43.96703, 81.27773],
        ["jingyihuo_huocheng", "霍城", 44.05800, 80.83640],
        ["jingyihuo_huoerguosi", "霍尔果斯", 44.15622, 80.45435]
      ]
    },
    {
      id: "kuitun_aletai",
      name: "奎屯—阿勒泰通道",
      type: "conventional",
      stations: [
        ["beijiang_01", "奎屯", 44.40291, 84.89819],
        ["beijiang_02", "克拉玛依", 45.52719, 84.89303],
        ["kuia_fuhai", "福海", 47.12130, 87.45926],
        ["kuia_beitunshi", "北屯市", 47.32294, 87.75652],
        ["beijiang_03", "阿勒泰", 47.71758, 88.08711]
      ]
    },
    {
      id: "kuerle_kashi",
      name: "库尔勒—喀什通道",
      type: "conventional",
      stations: [
        ["nanjiang_01", "库尔勒", 41.74570, 86.19266],
        ["nanjiang_luntai", "轮台", 41.85978, 84.11908],
        ["nanjiang_02", "库车", 41.69424, 83.01797],
        ["nanjiang_xinhe", "新和", 41.57392, 82.61745],
        ["nanjiang_03", "阿克苏", 41.14476, 80.30608],
        ["nanjiang_bachu", "巴楚", 39.83558, 78.54733],
        ["nanjiang_05", "阿图什", 39.71967, 76.21968],
        ["nanjiang_04", "喀什", 39.49194, 76.04693]
      ]
    },
    {
      id: "ruoqiang_hetian",
      name: "若羌—和田通道",
      type: "conventional",
      stations: [
        ["heruo_03", "若羌", 39.00312, 88.24960],
        ["heruo_02", "且末", 38.18445, 85.48975],
        ["heruo_minfeng", "民丰", 37.01797, 82.72168],
        ["xinzang_01", "和田", 37.15961, 79.90476]
      ]
    },
    {
      id: "kashi_hetian",
      name: "喀什—和田通道",
      type: "conventional",
      stations: [
        ["nanjiang_04", "喀什", 39.49194, 76.04693],
        ["kahe_shule", "疏勒", 39.38205, 75.99160],
        ["kahe_aketao", "阿克陶", 39.16741, 75.97399],
        ["nanjiang_06", "莎车", 38.37429, 77.22971],
        ["nanjiang_07", "叶城", 37.89309, 77.47082],
        ["kahe_pishan", "皮山", 37.56461, 78.28186],
        ["kahe_moyu", "墨玉", 37.22452, 79.73070],
        ["xinzang_01", "和田", 37.15961, 79.90476]
      ]
    },
    {
      id: "kashi_tuoergate",
      name: "喀什—吐尔尕特通道",
      type: "conventional",
      stations: [
        ["nanjiang_04", "喀什", 39.49194, 76.04693],
        ["kahe_wuqia", "乌恰", 39.71837, 75.25596],
        ["kahe_tuoergate", "吐尔尕特", 39.77064, 75.59216]
      ]
    },
    {
      id: "yining_akesu",
      name: "伊宁—阿克苏通道",
      type: "conventional",
      stations: [
        ["yiku_01", "伊宁", 43.96703, 81.27773],
        ["jingyihuo_buliekai", "布列开", 43.89852, 81.79239],
        ["yia_gongliu", "巩留", 43.4831, 82.2312],
        ["yia_xinyuan", "新源", 43.4348, 83.2330],
        ["yia_nalati", "那拉提", 43.338, 84.004],
        ["yia_bayinbuluke", "巴音布鲁克", 43.029, 84.182],
        ["kue_kutaikelike", "库台克力克", 42.13966, 83.13941],
        ["nanjiang_kuchexi", "库车西", 41.69713, 82.84888],
        ["nanjiang_02", "库车", 41.69424, 83.01797],
        ["nanjiang_xinhe", "新和", 41.57392, 82.61745],
        ["nanjiang_03", "阿克苏", 41.14476, 80.30608]
      ]
    },
    {
      id: "chengdudong_guangyuan",
      name: "成都东—广元通道",
      stations: [
        ["xicheng_06", "成都东", 30.63158, 104.13805],
        ["xicheng_qingbaijiangdong", "青白江东", 30.89724, 104.22308],
        ["xicheng_guanghanbei", "广汉北", 31.006, 104.282],
        ["xicheng_05", "德阳", 31.16809, 104.38610],
        ["xicheng_luojiangdong", "罗江东", 31.314, 104.516],
        ["xicheng_04", "绵阳", 31.46213, 104.71463],
        ["xicheng_jiangyou", "江油", 31.781, 104.750],
        ["xicheng_jiangyoubei", "江油北", 31.98537, 105.07226],
        ["xicheng_qingchuan", "青川", 32.18772, 105.33011],
        ["xicheng_jianmenguan", "剑门关", 32.28367, 105.48106],
        ["xicheng_03", "广元", 32.45268, 105.81778]
      ]
    },
    {
      id: "chengdudong_chongqingbei",
      name: "成都东—重庆北通道",
      stations: [
        ["xicheng_06", "成都东", 30.63158, 104.13805],
        ["chengyu_jianyangnan", "简阳南", 30.35636, 104.51573],
        ["chengyu_02", "资阳北", 30.12838, 104.68010],
        ["chengyu_zizhongbei", "资中北", 29.79971, 104.87027],
        ["chengyu_03", "内江北", 29.61178, 105.08147],
        ["chengyu_longchangbei", "隆昌北", 29.46838, 105.28744],
        ["chengyu_rongchangbei", "荣昌北", 29.43617, 105.63279],
        ["chengyu_dazunan", "大足南", 29.42361, 105.74202],
        ["chengyu_yongchuandong", "永川东", 29.37435, 105.94605],
        ["chengyu_bishan", "璧山", 29.590, 106.225],
        ["huyurong_14", "重庆北", 29.61232, 106.54727]
      ]
    },
    {
      id: "chengduzhan_chongqingbei",
      name: "成都站—重庆北通道",
      stations: [
        ["chengdu_zhan", "成都站", 30.70013, 104.07083],
        ["chengyu_jianzhou", "简州", 30.46261, 104.48447],
        ["chengyu_lezhi", "乐至", 30.300, 105.030],
        ["chengyu_anyue", "安岳", 30.04273, 105.35223],
        ["chengyu_dazushike", "大足石刻", 29.730, 105.720],
        ["chengyu_tongliang", "铜梁", 29.840, 106.060],
        ["chengyu_kexuecheng", "重庆科学城", 29.69886, 106.36704],
        ["huyurong_14", "重庆北", 29.61232, 106.54727]
      ]
    },
    {
      id: "chengdudong_suining_chongqingbei",
      name: "成都东—遂宁—重庆北通道",
      stations: [
        ["xicheng_06", "成都东", 30.63158, 104.13805],
        ["chengdawan_dayingdong", "大英东", 30.57066, 105.27596],
        ["chengdawan_03", "遂宁", 30.54547, 105.53784],
        ["chengdawan_tongnan", "潼南", 30.22240, 105.87419],
        ["chengdawan_hechuan", "合川", 29.96157, 106.27457],
        ["huyurong_14", "重庆北", 29.61232, 106.54727]
      ]
    },
    {
      id: "chengdudong_yibin",
      name: "成都东—宜宾通道",
      stations: [
        ["xicheng_06", "成都东", 30.63158, 104.13805],
        ["chuanzang_tianfu", "天府", 30.39437, 104.14939],
        ["chengyi_sanchahu", "三岔湖", 30.36740, 104.33030],
        ["chengyi_tianfujichang", "天府机场", 30.31360, 104.44157],
        ["chengyi_ziyangxi", "资阳西", 30.12939, 104.54795],
        ["chengyi_zizhongxi", "资中西", 29.89495, 104.61097],
        ["chengyi_weiyuan", "威远", 29.55104, 104.73382],
        ["chengziyi_03", "自贡", 29.35727, 104.87798],
        ["chengyi_yantan", "沿滩", 29.18463, 104.92826],
        ["chengyi_nanxibei", "南溪北", 28.97321, 104.88329],
        ["chengyi_yibindong", "宜宾东", 28.80150, 104.74263],
        ["chengyi_yibin", "宜宾", 28.73087, 104.63066]
      ]
    },
    {
      id: "ziyangxi_wanzhoubei",
      name: "资阳西—万州北通道",
      stations: [
        ["chengyi_ziyangxi", "资阳西", 30.12939, 104.54795],
        ["chengyu_lezhi", "乐至", 30.300, 105.030],
        ["chengdawan_03", "遂宁", 30.54547, 105.53784],
        ["chengdawan_pengxinan", "蓬溪南", 30.66980, 105.71493],
        ["langyu_04", "南充北", 30.85931, 106.06656],
        ["chengdawan_yingshanxi", "营山西", 31.02164, 106.49180],
        ["chengdawan_quxianbei", "渠县北", 30.91996, 106.97172],
        ["xiyu_03", "达州南", 31.09499, 107.47290],
        ["chengdawan_kaijiang", "开江", 31.06404, 107.82599],
        ["chengdawan_kaizhounan", "开州南", 30.92024, 108.16693],
        ["zhengyu_06", "万州北", 30.86558, 108.36214]
      ]
    },
    {
      id: "chengdunan_kunming",
      name: "成都南—昆明通道",
      type: "conventional",
      stations: [
        ["chengkun_chengdunan", "成都南", 30.60899, 104.06607],
        ["chengkun_pengshan", "彭山", 30.19500, 103.85722],
        ["chengkun_meishan", "眉山", 30.06741, 103.81051],
        ["chengkun_jiajiang", "夹江", 29.75439, 103.57513],
        ["chengkun_emei", "峨眉", 29.58729, 103.52032],
        ["chengkun_shawannan", "沙湾南", 29.41399, 103.54097],
        ["chengkun_ebiannan", "峨边南", 29.21205, 103.26084],
        ["chengkun_ganluonan", "甘洛南", 28.92813, 102.79141],
        ["chengkun_yuexi", "越西", 28.63676, 102.52351],
        ["chengkun_mianning", "冕宁", 28.28922, 102.19274],
        ["chengkun_02", "西昌西", 27.87154, 102.15984],
        ["chengkun_dechangxi", "德昌西", 27.40017, 102.16469],
        ["chengkun_miyidong", "米易东", 26.90951, 102.12596],
        ["yixipan_yanbiannan", "盐边南", 26.65696, 101.85301],
        ["chengkun_03", "攀枝花南", 26.47138, 101.74645],
        ["chengkun_yongren", "永仁", 26.05201, 101.70942],
        ["chengkun_yuanmouxi", "元谋西", 25.71139, 101.83917],
        ["chengkun_guangtongbei", "广通北", 25.16711, 101.76358],
        ["chengkun_lufengnan", "禄丰南", 25.12273, 102.06221],
        ["chengkun_kunming", "昆明", 25.01866, 102.72029]
      ]
    },
    {
      id: "zigong_chongqingxi",
      name: "自贡—重庆西通道",
      stations: [
        ["chengziyi_03", "自贡", 29.35727, 104.87798],
        ["mianlu_fushun", "富顺", 29.21240, 105.03590],
        ["mianlu_luxian", "泸县", 29.16667, 105.32033],
        ["yukun_02", "泸州", 28.93055, 105.41847],
        ["yukun_luzhoudong", "泸州东", 29.06087, 105.63609],
        ["yukun_yongchuannan", "永川南", 29.27860, 105.96036],
        ["yukun_jiangjinbei", "江津北", 29.34756, 106.25505],
        ["chengyu_04", "重庆西", 29.50270, 106.43545]
      ]
    },
    {
      id: "chongqingbei_wanzhoubei",
      name: "重庆北—万州北通道",
      stations: [
        ["huyurong_14", "重庆北", 29.61232, 106.54727],
        ["yuwan_changshoubei", "长寿北", 29.88323, 107.07008],
        ["yuwan_dianjiang", "垫江", 30.30972, 107.37373],
        ["yuwan_liangpingnan", "梁平南", 30.64433, 107.76546],
        ["zhengyu_06", "万州北", 30.86558, 108.36214]
      ]
    },
    {
      id: "chongqingdong_wanzhoubei",
      name: "重庆东—万州北通道",
      stations: [
        ["yuxia_01", "重庆东", 29.48738, 106.66872],
        ["huyurong_13", "涪陵北", 29.77309, 107.27312],
        ["yuwan_fengdubei", "丰都北", 29.89280, 107.68430],
        ["yuwan_zhongxian", "忠县", 30.32434, 108.03500],
        ["zhengyu_06", "万州北", 30.86558, 108.36214]
      ]
    },
    {
      id: "chongqingdong_changshaxi",
      name: "重庆东—长沙西通道",
      stations: [
        ["yuxia_01", "重庆东", 29.48738, 106.66872],
        ["yuxia_nanchuanbei", "南川北", 29.18710, 107.11453],
        ["yuxia_wulongnan", "武隆南", 29.29930, 107.81329],
        ["yuxia_pengshuixi", "彭水西", 29.33958, 108.11233],
        ["yuxia_02", "黔江", 29.44576, 108.78606],
        ["yuxia_xianfeng", "咸丰", 29.59765, 109.05493],
        ["yuxia_laifeng", "来凤", 29.52082, 109.35390],
        ["yuxia_longshanbei", "龙山北", 29.49055, 109.45994],
        ["yuxia_sangzhi", "桑植", 29.35832, 110.09143],
        ["yuxia_03", "张家界西", 29.17137, 110.45800],
        ["yuxia_04", "常德", 29.07463, 111.68945],
        ["yuxia_05", "益阳南", 28.51827, 112.32164],
        ["yuxia_06", "长沙西", 28.26538, 112.82051]
      ]
    },
    {
      id: "chongqingbei_huaihua",
      name: "重庆北—怀化通道",
      type: "conventional",
      stations: [
        ["huyurong_14", "重庆北", 29.61232, 106.54727],
        ["yuhuai_fuling", "涪陵", 29.70242, 107.32931],
        ["yuhuai_wulong", "武隆", 29.32993, 107.76826],
        ["yuhuai_pengshui", "彭水", 29.36478, 108.23343],
        ["yuxia_02", "黔江", 29.44576, 108.78606],
        ["yuhuai_youyang", "酉阳", 28.81200, 108.95770],
        ["yuhuai_xiushan", "秀山", 28.44750, 109.01194],
        ["yuhuai_tongren", "铜仁", 27.74332, 109.19970],
        ["yuhuai_huaihua", "怀化", 27.55798, 109.96717]
      ]
    },
    {
      id: "chongqingxi_guiyangbei",
      name: "重庆西—贵阳北通道",
      stations: [
        ["chengyu_04", "重庆西", 29.50270, 106.43545],
        ["yugui_qijiangdong", "綦江东", 29.02630, 106.65870],
        ["yugui_tongzidong", "桐梓东", 28.11868, 106.83301],
        ["yunan_02", "遵义", 27.66772, 106.94435],
        ["yugui_xifeng", "息烽", 27.08042, 106.74375],
        ["hukun_18", "贵阳北", 26.62291, 106.67238]
      ]
    },
    {
      id: "chongqingxi_zhengan_guiyangbei",
      name: "重庆西—正安—贵阳北通道",
      stations: [
        ["chengyu_04", "重庆西", 29.50270, 106.43545],
        ["yugui2_wansheng", "万盛", 28.96779, 106.92480],
        ["yugui2_zhengan", "正安", 28.55120, 107.44357],
        ["yugui2_suiyang", "绥阳", 27.95020, 107.18650],
        ["yunan_02", "遵义", 27.66772, 106.94435],
        ["yugui2_kaiyang", "开阳", 27.04469, 106.97007],
        ["hukun_18", "贵阳北", 26.62291, 106.67238]
      ]
    },
    {
      id: "luzhou_yibindong",
      name: "泸州—宜宾东通道",
      stations: [
        ["yukun_02", "泸州", 28.93055, 105.41847],
        ["yukun_nanxi", "南溪", 28.88162, 104.95269],
        ["chengyi_yibindong", "宜宾东", 28.80150, 104.74263]
      ]
    },
    {
      id: "chongqingxi_dazhounan",
      name: "重庆西—达州南通道",
      stations: [
        ["chengyu_04", "重庆西", 29.50270, 106.43545],
        ["xiyu_beibeinan", "北碚南", 29.75595, 106.40132],
        ["xiyu_hechuandong", "合川东", 29.97652, 106.52294],
        ["xiyu_guangandong", "广安东", 30.38775, 106.71291],
        ["xiyu_dazu", "大竹", 30.77660, 107.19929],
        ["xiyu_03", "达州南", 31.09499, 107.47290]
      ]
    },
    {
      id: "chongqingbei_guangyuan",
      name: "重庆北—广元通道",
      stations: [
        ["huyurong_14", "重庆北", 29.61232, 106.54727],
        ["chengdawan_hechuan", "合川", 29.96157, 106.27457],
        ["langyu_wusheng", "武胜", 30.37200, 106.10165],
        ["langyu_04", "南充北", 30.85931, 106.06656],
        ["langyu_nanbu", "南部", 31.37336, 106.00902],
        ["langyu_langzhong", "阆中", 31.56010, 105.95350],
        ["langyu_cangxi", "苍溪", 31.76247, 105.91182],
        ["xicheng_03", "广元", 32.45268, 105.81778]
      ]
    },
    {
      id: "guangyuan_dazhounan",
      name: "广元—达州南通道",
      stations: [
        ["xicheng_03", "广元", 32.45268, 105.81778],
        ["guangbada_wangcang", "旺苍", 32.22944, 106.26694],
        ["bazhong_01", "巴中", 31.87629, 106.76116],
        ["guangbada_pingchang", "平昌", 31.55456, 107.07209],
        ["xiyu_03", "达州南", 31.09499, 107.47290]
      ]
    },
    {
      id: "mianyang_zigong",
      name: "绵阳—自贡通道",
      stations: [
        ["xicheng_04", "绵阳", 31.46213, 104.71463],
        ["miansuinei_santai", "三台", 31.08439, 105.04570],
        ["miansuinei_shehong", "射洪", 30.86400, 105.37000],
        ["chengdawan_03", "遂宁", 30.54547, 105.53784],
        ["chengyu_anyue", "安岳", 30.04273, 105.35223],
        ["chengyu_03", "内江北", 29.61178, 105.08147],
        ["chengziyi_03", "自贡", 29.35727, 104.87798]
      ]
    },
    {
      id: "chengdudong_yibinxi",
      name: "成都东—宜宾西通道",
      stations: [
        ["xicheng_06", "成都东", 30.63158, 104.13805],
        ["chenggui_shuangliujichang", "双流机场", 30.57204, 103.95488],
        ["chenggui_pengshanbei", "彭山北", 30.21040, 103.85959],
        ["chenggui_02", "眉山东", 30.06959, 103.81954],
        ["chenggui_qingshen", "青神", 29.85137, 103.76748],
        ["chenggui_03", "乐山", 29.60458, 103.70968],
        ["chenggui_qianwei", "犍为", 29.35099, 103.95722],
        ["chenggui_nixi", "泥溪", 29.00927, 104.27306],
        ["chenggui_pingshan", "屏山", 28.85229, 104.35810],
        ["yukun_03", "宜宾西", 28.72629, 104.60367]
      ]
    },
    {
      id: "chongqingbei_yichangbei",
      name: "重庆北—宜昌北通道",
      stations: [
        ["huyurong_14", "重庆北", 29.61232, 106.54727],
        ["yuwan_changshoubei", "长寿北", 29.88323, 107.07008],
        ["huyurong_13", "涪陵北", 29.77309, 107.27312],
        ["yifu_fengdu", "丰都", 29.84807, 107.68584],
        ["yifu_shizhudong", "石柱东", 30.03423, 108.15711],
        ["yifu_huangshui", "黄水", 30.09860, 108.49282],
        ["yifu_lichuan", "利川", 30.28118, 108.93597],
        ["yifu_enshinan", "恩施南", 30.25013, 109.46911],
        ["yifu_hefeng", "鹤峰", 30.01149, 110.27423],
        ["yifu_houhe", "后河", 30.13618, 110.67865],
        ["yifu_wufeng", "五峰", 30.22113, 111.10359],
        ["yifu_changyangdong", "长阳东", 30.41644, 111.21975],
        ["huyurong_11", "宜昌北", 30.74842, 111.46938]
      ]
    },
    {
      id: "wanzhou_yichangdong",
      name: "万州—宜昌东通道",
      type: "conventional",
      stations: [
        ["yiwan_wanzhou", "万州", 30.75750, 108.39944],
        ["yiwan_lichuan", "利川", 30.28139, 108.93417],
        ["yiwan_enshi", "恩施", 30.35128, 109.47988],
        ["yiwan_jianshi", "建始", 30.56982, 109.72345],
        ["yiwan_gaoping", "高坪", 30.66726, 110.08554],
        ["yiwan_yesanguan", "野三关", 30.66222, 110.35694],
        ["yiwan_changyang", "长阳", 30.62291, 110.84517],
        ["yiwan_yichangdong", "宜昌东", 30.66041, 111.36488]
      ]
    },
    {
      id: "wanzhoubei_xiangyangdong",
      name: "万州北—襄阳东通道",
      stations: [
        ["zhengyu_06", "万州北", 30.86558, 108.36214],
        ["zhengyu_yunyang", "云阳", 30.99998, 108.72010],
        ["zhengyu_fengjie", "奉节", 31.02755, 109.36887],
        ["zhengyu_wushan", "巫山", 31.13194, 109.91479],
        ["zhengyu_badong", "巴东", 31.16362, 110.37643],
        ["zhengyu_xingshan", "兴山", 31.32961, 110.74676],
        ["zhengyu_05", "神农架", 31.63103, 110.90987],
        ["zhengyu_baokangxian", "保康县", 31.74540, 111.22238],
        ["zhengyu_nanzhang", "南漳", 31.80145, 111.86160],
        ["zhengyu_04", "襄阳东", 32.01631, 112.29051]
      ]
    },
    {
      id: "xingshan_yichangbei",
      name: "兴山—宜昌北通道",
      stations: [
        ["zhengyu_xingshan", "兴山", 31.32961, 110.74676],
        ["huyurong_11", "宜昌北", 30.74842, 111.46938]
      ]
    },
    {
      id: "wanzhoubei_pengshuixi",
      name: "万州北—彭水西通道",
      stations: [
        ["zhengyu_06", "万州北", 30.86558, 108.36214],
        ["yuwan_zhongxian", "忠县", 30.32434, 108.03500],
        ["wanqian_shizhu", "石柱", 29.96743, 108.09340],
        ["yuxia_pengshuixi", "彭水西", 29.33958, 108.11233]
      ]
    },
    {
      id: "yibin_kunmingnan",
      name: "宜宾—昆明南通道",
      stations: [
        ["chengyi_yibin", "宜宾", 28.73087, 104.63066],
        ["yukun_gaoxian", "高县", 28.42650, 104.53550],
        ["yukun_junlian", "筠连", 28.13900, 104.48700],
        ["yukun_yanjinnan", "盐津南", 27.98500, 104.20500],
        ["yukun_yiliangbei", "彝良北", 27.73333, 104.05000],
        ["yukun_04", "昭通东", 27.34433, 103.78650],
        ["yukun_huize", "会泽", 26.42000, 103.33000],
        ["yukun_xundiandong", "寻甸东", 25.52506, 103.32260],
        ["yukun_songming", "嵩明", 25.24257, 103.13567],
        ["yukun_changshui", "长水机场", 25.11000, 102.93000],
        ["hukun_21", "昆明南", 24.87336, 102.86038]
      ]
    },
    {
      id: "yibinxi_guiyangbei",
      name: "宜宾西—贵阳北通道",
      stations: [
        ["yukun_03", "宜宾西", 28.72629, 104.60367],
        ["chenggui_changning", "长宁", 28.59920, 104.92635],
        ["chenggui_xingwen", "兴文", 28.33811, 105.24456],
        ["chenggui_weixin", "威信", 27.82320, 105.05537],
        ["chenggui_zhenxiong", "镇雄", 27.59461, 105.12211],
        ["chenggui_05", "毕节", 27.26568, 105.41567],
        ["chenggui_dafang", "大方", 27.21088, 105.59215],
        ["chenggui_qianxi", "黔西", 26.98882, 106.04369],
        ["chenggui_qingzhenxi", "清镇西", 26.80393, 106.37593],
        ["hukun_18", "贵阳北", 26.62291, 106.67238]
      ]
    },
    {
      id: "yibin_yanbiannan",
      name: "宜宾—盐边南通道",
      type: "conventional",
      stations: [
        ["chengyi_yibin", "宜宾", 28.73087, 104.63066],
        ["yixipan_shuifu", "水富", 28.60990, 104.41454],
        ["yixipan_suijiang", "绥江", 28.59770, 103.96930],
        ["yixipan_leibo", "雷波", 28.26620, 103.56970],
        ["yixipan_meigu", "美姑", 28.33210, 103.13150],
        ["yixipan_zhaojue", "昭觉", 28.01410, 102.84340],
        ["chengkun_02", "西昌西", 27.87154, 102.15984],
        ["chengkun_dechangxi", "德昌西", 27.40017, 102.16469],
        ["chengkun_miyidong", "米易东", 26.90951, 102.12596],
        ["yixipan_yanbiannan", "盐边南", 26.65696, 101.85301]
      ]
    },
    {
      id: "zhaotongdong_liupanshui",
      name: "昭通东—六盘水通道",
      stations: [
        ["yukun_04", "昭通东", 27.34433, 103.78650],
        ["zhaoliu_weining", "威宁", 26.88294, 104.25282],
        ["anliu_05", "六盘水", 26.59442, 104.85037]
      ]
    },
    {
      id: "wuzhong_zhongweinan",
      name: "吴忠—中卫南通道",
      stations: [
        ["xiyin_04", "吴忠", 37.97647, 106.24493],
        ["yinlan_hongsibaobei", "红寺堡北", 37.59873, 106.05884],
        ["yinlan_zhongningdong", "中宁东", 37.44922, 105.69819],
        ["yinlan_03", "中卫南", 37.47218, 105.17519]
      ]
    },
    {
      id: "yinchuan_baotou",
      name: "银川—包头通道",
      stations: [
        ["baoyin_06", "银川", 38.49168, 106.16862],
        ["baoyin_shahu", "沙湖", 38.77433, 106.29517],
        ["baoyin_05", "石嘴山", 38.95733, 106.37711],
        ["baoyin_huinongnan", "惠农南", 39.20813, 106.70266],
        ["baoyin_wuhainan", "乌海南", 39.43966, 106.76195],
        ["baoyin_04", "乌海", 39.71141, 106.79404],
        ["baoyin_dengkou", "磴口", 40.33913, 106.95774],
        ["baoyin_02", "巴彦淖尔", 40.73401, 107.40436],
        ["baoyin_wuyuan", "五原", 40.91257, 108.07873],
        ["baoyin_wulateqianqi", "乌拉特前旗", 40.73632, 108.60711],
        ["baoyin_baiyanhuaxi", "白彦花西", 40.62664, 109.19562],
        ["jingbao_05", "包头", 40.60497, 109.83026]
      ]
    },
    {
      id: "yinchuan_bayanhaote",
      name: "银川—巴彦浩特通道",
      type: "conventional",
      stations: [
        ["baoyin_06", "银川", 38.49168, 106.16862],
        ["yinba_barunbieli", "巴润别立", 38.53720, 105.67030],
        ["yinba_bayanhaote", "巴彦浩特", 38.83624, 105.63216]
      ]
    },
    {
      id: "guiyangbei_liupanshui",
      name: "贵阳北—六盘水通道",
      stations: [
        ["hukun_18", "贵阳北", 26.62291, 106.67238],
        ["hukun_19", "安顺西", 26.20213, 105.87235],
        ["anliu_liuzhinan", "六枝南", 26.23095, 105.43488],
        ["anliu_05", "六盘水", 26.59442, 104.85037]
      ]
    },
    {
      id: "guiyangbei_kunmingnan",
      name: "贵阳北—昆明南通道",
      stations: [
        ["hukun_18", "贵阳北", 26.62291, 106.67238],
        ["hukun_19", "安顺西", 26.20213, 105.87235],
        ["hukun_guanling", "关岭", 25.96826, 105.52492],
        ["hukun_puanxian", "普安县", 25.80389, 104.87167],
        ["hukun_panzhou", "盘州", 25.79454, 104.56586],
        ["hukun_fuyuanbei", "富源北", 25.71639, 104.26848],
        ["hukun_20", "曲靖北", 25.59241, 103.78131],
        ["yukun_songming", "嵩明", 25.24257, 103.13567],
        ["yukun_changshui", "长水机场", 25.11000, 102.93000],
        ["hukun_21", "昆明南", 24.87336, 102.86038]
      ]
    },
    {
      id: "guiyangbei_huaihuanan",
      name: "贵阳北—怀化南通道",
      stations: [
        ["hukun_18", "贵阳北", 26.62291, 106.67238],
        ["hukun_guiyangdong", "贵阳东", 26.66763, 106.74073],
        ["hukun_guidingbei", "贵定北", 26.59594, 107.22866],
        ["hukun_17", "凯里南", 26.51765, 107.88380],
        ["hukun_sansui", "三穗", 26.96833, 108.64729],
        ["hukun_tongrennan", "铜仁南", 27.28245, 108.97131],
        ["hukun_xinhuangxi", "新晃西", 27.38343, 109.12148],
        ["hukun_zhijiang", "芷江", 27.45889, 109.65556],
        ["hukun_16", "怀化南", 27.51552, 109.98876]
      ]
    },
    {
      id: "guiyangbei_nanningdong",
      name: "贵阳北—南宁东通道",
      stations: [
        ["hukun_18", "贵阳北", 26.62291, 106.67238],
        ["guinan_longlibei", "龙里北", 26.47177, 106.96324],
        ["guigang_guidingxian", "贵定县", 26.35446, 107.18646],
        ["yunan_04", "都匀东", 26.17042, 107.58128],
        ["guinan_dushandong", "独山东", 25.86142, 107.57364],
        ["guinan_libo", "荔波", 25.34763, 107.81876],
        ["guinan_huanjiang", "环江", 24.85610, 108.16805],
        ["yunan_05", "河池西", 24.71384, 108.17235],
        ["guinan_duan", "都安", 23.97054, 108.11003],
        ["guinan_nanningbei", "南宁北", 23.15899, 108.23307],
        ["nanguang_07", "南宁东", 22.84183, 108.41353]
      ]
    },
    {
      id: "guiyangbei_guilinxi",
      name: "贵阳北—桂林西通道",
      stations: [
        ["hukun_18", "贵阳北", 26.62291, 106.67238],
        ["guinan_longlibei", "龙里北", 26.47177, 106.96324],
        ["guigang_guidingxian", "贵定县", 26.35446, 107.18646],
        ["yunan_04", "都匀东", 26.17042, 107.58128],
        ["guigang_sanduxian", "三都县", 26.08113, 107.81309],
        ["guigang_rongjiang", "榕江", 25.99172, 108.55149],
        ["guigang_congjiang", "从江", 25.91216, 109.11028],
        ["guigang_sanjiangnan", "三江南", 25.72870, 109.57157],
        ["guigang_03", "桂林西", 25.35741, 110.26251]
      ]
    },
    {
      id: "liupanshui_qujingbei",
      name: "六盘水—曲靖北通道",
      stations: [
        ["anliu_05", "六盘水", 26.59442, 104.85037],
        ["liukun_xuanwei", "宣威", 26.21121, 104.11732],
        ["hukun_20", "曲靖北", 25.59241, 103.78131]
      ]
    },
    {
      id: "chongqingxi_liupanshui",
      name: "重庆西—六盘水通道",
      stations: [
        ["chengyu_04", "重庆西", 29.50270, 106.43545],
        ["yukun_bishanjichang", "璧山机场", 29.42500, 106.12000],
        ["yukun_jiangjinbei", "江津北", 29.34756, 106.25505],
        ["yukun_baisha", "白沙", 29.06026, 106.11671],
        ["yukun_hejiang", "合江", 28.81128, 105.83101],
        ["yukun_chishui", "赤水", 28.59047, 105.69750],
        ["yukun_xishui", "习水", 28.33292, 106.19715],
        ["yukun_gulin", "古蔺", 28.03876, 105.81269],
        ["chenggui_05", "毕节", 27.26568, 105.41567],
        ["yukun_nayong", "纳雍", 26.77934, 105.41458],
        ["yukun_yangchang", "阳长", 26.62780, 105.18420],
        ["yukun_bide", "比德", 26.55995, 105.16999],
        ["anliu_05", "六盘水", 26.59442, 104.85037]
      ]
    },
    {
      id: "liupanshui_nanningdong",
      name: "六盘水—南宁东通道",
      stations: [
        ["anliu_05", "六盘水", 26.59442, 104.85037],
        ["liupan_jichangping", "鸡场坪", 25.97903, 104.63159],
        ["hukun_panzhou", "盘州", 25.79454, 104.56586],
        ["panxing_baotian", "保田", 25.38034, 104.70061],
        ["panxing_xingyinan", "兴义南", 25.08102, 104.95665],
        ["xingbai_ceheng", "册亨", 24.91756, 105.57208],
        ["xingbai_tianlin", "田林", 24.28811, 106.23093],
        ["nankun_02", "百色", 23.88459, 106.66396],
        ["nankun_tianyang", "田阳", 23.76879, 106.93234],
        ["nankun_tiandongbei", "田东北", 23.67572, 107.14129],
        ["nankun_pingguo", "平果", 23.32056, 107.56417],
        ["nankun_longandong", "隆安东", 23.13524, 107.70582],
        ["nankun_nanningxi", "南宁西", 22.89078, 107.97091],
        ["nankun_nanning", "南宁", 22.82697, 108.31485],
        ["nanguang_07", "南宁东", 22.84183, 108.41353]
      ]
    },
    {
      id: "kunming_dali",
      name: "昆明—大理通道",
      type: "conventional",
      stations: [
        ["chengkun_guangtongbei", "广通北", 25.16711, 101.76358],
        ["chengkun_04", "楚雄", 25.08528, 101.54278],
        ["chengkun_nanhua", "南华", 25.21006, 101.27954],
        ["chengkun_xiangyun", "祥云", 25.45375, 100.55698],
        ["diancang_03", "大理", 25.59195, 100.24852]
      ]
    },
    {
      id: "kunmingnan_yuxi",
      name: "昆明南—玉溪通道",
      type: "conventional",
      stations: [
        ["hukun_21", "昆明南", 24.87336, 102.86038],
        ["kunmo_jinningdong", "晋宁东", 24.72676, 102.77672],
        ["kunmo_02", "玉溪", 24.34191, 102.51067]
      ]
    },
    {
      id: "kunmingnan_baise",
      name: "昆明南—百色通道",
      stations: [
        ["hukun_21", "昆明南", 24.87336, 102.86038],
        ["nankun_shilinxi", "石林西", 24.65732, 103.24310],
        ["nankun_mile", "弥勒", 24.33707, 103.41152],
        ["nankun_puzhehei", "普者黑", 23.96981, 104.17984],
        ["nankun_guangnanxian", "广南县", 24.03685, 105.04958],
        ["nankun_funing", "富宁", 23.67728, 105.58178],
        ["nankun_02", "百色", 23.88459, 106.66396]
      ]
    },
    {
      id: "mile_honghe",
      name: "弥勒—红河通道",
      stations: [
        ["nankun_mile", "弥勒", 24.33707, 103.41152],
        ["mimeng_zhuyuan", "竹园", 24.11080, 103.38950],
        ["mimeng_pengpu", "朋普", 23.97760, 103.34135],
        ["mimeng_kaiyuannan", "开远南", 23.68306, 103.28328],
        ["mimeng_honghe", "红河", 23.45281, 103.35221]
      ]
    },
    {
      id: "yuxi_mohan",
      name: "玉溪—磨憨通道",
      type: "conventional",
      stations: [
        ["kunmo_02", "玉溪", 24.34191, 102.51067],
        ["yumo_eshan", "峨山", 24.19136, 102.38825],
        ["yumo_huanian", "化念", 24.04556, 102.23125],
        ["yumo_yuanjiang", "元江", 23.70258, 102.00646],
        ["yumo_mojiang", "墨江", 23.43708, 101.73913],
        ["yumo_ninger", "宁洱", 23.05100, 101.06294],
        ["kunmo_03", "普洱", 22.77842, 100.94044],
        ["yumo_yexianggu", "野象谷", 22.11455, 100.85378],
        ["yumo_xishuangbanna", "西双版纳", 21.98615, 100.77188],
        ["yumo_ganlanba", "橄榄坝", 21.87280, 100.94538],
        ["yumo_mengla", "勐腊", 21.42806, 101.58701],
        ["yumo_mohan", "磨憨", 21.25393, 101.71749]
      ]
    },
    {
      id: "kunming_xingyi",
      name: "昆明—兴义通道",
      type: "conventional",
      stations: [
        ["chengkun_kunming", "昆明", 25.01866, 102.72029],
        ["nankun_yiliangbei", "宜良北", 24.98284, 103.19069],
        ["nankun_shilin", "石林", 24.86313, 103.32906],
        ["nankun_luliang", "陆良", 24.84948, 103.69564],
        ["nankun_shizong", "师宗", 24.82556, 104.01947],
        ["nankun_luoping", "罗平", 24.90756, 104.31550],
        ["nankun_weishe", "威舍", 25.28036, 104.74344],
        ["nankun_railway_03", "兴义", 25.16584, 104.98675]
      ]
    },
    {
      id: "yuxi_shizong",
      name: "玉溪—师宗通道",
      type: "conventional",
      stations: [
        ["kunmo_02", "玉溪", 24.34191, 102.51067],
        ["yumi_jiangchuan", "江川", 24.29200, 102.74610],
        ["yumi_huaning", "华宁", 24.19322, 102.92891],
        ["nankun_mile", "弥勒", 24.33707, 103.41152],
        ["mishi_luxi", "泸西", 24.53198, 103.76615],
        ["nankun_shizong", "师宗", 24.82556, 104.01947]
      ]
    },
    {
      id: "yuxi_hekoubei",
      name: "玉溪—河口北通道",
      type: "conventional",
      stations: [
        ["kunmo_02", "玉溪", 24.34191, 102.51067],
        ["kunhe_tonghai", "通海", 24.11915, 102.66702],
        ["kunhe_jianshui", "建水", 23.65807, 102.87232],
        ["kunhe_gejiu", "个旧", 23.51677, 103.21203],
        ["mimeng_honghe", "红河", 23.45281, 103.35221],
        ["kunhe_mengzi", "蒙自", 23.37636, 103.42945],
        ["kunhe_pingbian", "屏边", 23.01681, 103.63572],
        ["kunhe_hekoubei", "河口北", 22.53222, 103.97397]
      ]
    },
    {
      id: "dali_ruili",
      name: "大理—瑞丽通道",
      type: "conventional",
      stations: [
        ["diancang_03", "大理", 25.59195, 100.24852],
        ["darui_yangbi", "漾濞", 25.66286, 99.96236],
        ["darui_yongpingxian", "永平县", 25.40775, 99.53853],
        ["darui_02", "保山", 25.15367, 99.17817],
        ["darui_longling", "龙陵", 24.52579, 98.62025],
        ["darui_mangshi", "芒市", 24.44436, 98.55123],
        ["darui_mangshixi", "芒市西", 24.37020, 98.42690],
        ["darui_ruili", "瑞丽", 24.02062, 97.87559]
      ]
    },
    {
      id: "mangshixi_houqiao",
      name: "芒市西—猴桥通道",
      type: "conventional",
      stations: [
        ["darui_mangshixi", "芒市西", 24.37020, 98.42690],
        ["mth_tengchong", "腾冲", 25.03393, 98.40233],
        ["mth_houqiao", "猴桥", 25.32401, 98.27866]
      ]
    },
    {
      id: "dali_lincang",
      name: "大理—临沧通道",
      type: "conventional",
      stations: [
        ["diancang_03", "大理", 25.59195, 100.24852],
        ["dalin_weishan", "巍山", 25.23242, 100.29317],
        ["dalin_xiaowandong", "小湾东", 24.71404, 100.14315],
        ["dalin_yunxian", "云县", 24.40169, 100.12658],
        ["dalin_02", "临沧", 23.93345, 100.11149]
      ]
    },
    {
      id: "nanningdong_guilin",
      name: "南宁东—桂林通道",
      stations: [
        ["nanguang_07", "南宁东", 22.84183, 108.41353],
        ["liunan_binyang", "宾阳", 23.21623, 109.09313],
        ["nanheng_05", "来宾北", 23.75149, 109.24398],
        ["nanheng_04", "柳州", 24.30811, 109.38802],
        ["hengliu_luzhaibei", "鹿寨北", 24.64635, 109.66073],
        ["hengliu_yongfunan", "永福南", 25.00392, 110.00504],
        ["hengliu_guilin", "桂林", 25.26139, 110.28222]
      ]
    },
    {
      id: "nanningdong_guangzhounan",
      name: "南宁东—广州南通道",
      stations: [
        ["nanguang_07", "南宁东", 22.84183, 108.41353],
        ["liunan_binyang", "宾阳", 23.21623, 109.09313],
        ["nanguang_06", "贵港", 23.10370, 109.60890],
        ["nanguang_guiping", "桂平", 23.31959, 110.11174],
        ["nanguang_pingnannan", "平南南", 23.42004, 110.42731],
        ["nanguang_tengxian", "藤县", 23.33361, 110.98417],
        ["nanguang_05", "梧州南", 23.39306, 111.21972],
        ["nanguang_yunan", "郁南", 23.24804, 111.46431],
        ["nanguang_04", "云浮东", 23.01519, 112.13323],
        ["nanguang_03", "肇庆东", 23.21330, 112.66297],
        ["guigang_sanshuinan", "三水南", 23.11336, 112.87112],
        ["nanguang_02", "佛山西", 23.07930, 113.03352],
        ["jingguang_24", "广州南", 22.98834, 113.26910]
      ]
    },
    {
      id: "nanningdong_shenzhenxili",
      name: "南宁东—深圳西丽通道",
      stations: [
        ["nanguang_07", "南宁东", 22.84183, 108.41353],
        ["shennan_wuhe", "五合", 22.82127, 108.52601],
        ["shennan_luancheng", "峦城", 22.81000, 108.86500],
        ["shennan_hengzhou", "横州", 22.75640, 109.36891],
        ["shennan_xingyenan", "兴业南", 22.71601, 109.87553],
        ["shennan_yulinbei", "玉林北", 22.72557, 110.24503],
        ["shennan_rongxiannan", "容县南", 22.81407, 110.54576],
        ["shennan_cenxidong", "岑溪东", 22.89270, 111.04089],
        ["shennan_luodingbei", "罗定北", 22.79237, 111.54349],
        ["shennan_yunfu", "云浮", 22.96375, 112.05683],
        ["shennan_fozhao", "佛肇", 22.86904, 112.56916],
        ["shennan_jiangmen", "江门", 22.49100, 113.06486],
        ["shennan_zhongshanxi", "中山西", 22.53020, 113.25370],
        ["shennan_zhongshanbei", "中山北", 22.55705, 113.38274],
        ["shennan_nansha", "南沙", 22.69682, 113.55647],
        ["shennan_binhaiwan", "东莞滨海湾", 22.76148, 113.70495],
        ["shennan_shenzhenjichangdong", "深圳机场东", 22.64998, 113.81760],
        ["shennan_shenzhenxili", "深圳西丽", 22.56516, 113.94353]
      ]
    },
    {
      id: "nanningdong_zhanjiangxi",
      name: "南宁东—湛江西通道",
      stations: [
        ["nanguang_07", "南宁东", 22.84183, 108.41353],
        ["nanzhan_02", "钦州东", 21.97900, 108.66814],
        ["nanzhan_hepu", "合浦", 21.62491, 109.18347],
        ["nanzhan_baishazhen", "白沙镇", 21.65500, 109.68300],
        ["nanzhan_lianjiangnan", "廉江南", 21.48762, 110.08291],
        ["nanzhan_suixinan", "遂溪南", 21.33345, 110.23716],
        ["nanzhan_zhanjiangxi", "湛江西", 21.24250, 110.28889]
      ]
    },
    {
      id: "qinzhoudong_dongxingshi",
      name: "钦州东—东兴市通道",
      stations: [
        ["nanzhan_02", "钦州东", 21.97900, 108.66814],
        ["nanzhan_fangchenggang_02", "防城港北", 21.71393, 108.37679],
        ["nanzhan_dongxingshi", "东兴市", 21.57457, 108.01761]
      ]
    },
    {
      id: "hepu_beihai",
      name: "合浦—北海通道",
      stations: [
        ["nanzhan_hepu", "合浦", 21.62491, 109.18347],
        ["nanzhan_03", "北海", 21.45309, 109.12839]
      ]
    },
    {
      id: "nanning_pingxiangdong",
      name: "南宁—凭祥东通道",
      stations: [
        ["nankun_nanning", "南宁", 22.82697, 108.31485],
        ["nanping_wuxujichang", "吴圩机场", 22.59986, 108.18695],
        ["nanping_fusuinan", "扶绥南", 22.57875, 107.90445],
        ["nanping_chongzuonan", "崇左南", 22.35787, 107.39103],
        ["nanping_ningmingdong", "宁明东", 22.31002, 107.20051],
        ["nanping_longzhou", "龙州", 22.31462, 106.87405],
        ["nanping_pingxiangdong", "凭祥东", 22.11096, 106.79919]
      ]
    },
    {
      id: "liuzhou_wuzhou",
      name: "柳州—梧州通道",
      type: "conventional",
      stations: [
        ["nanheng_04", "柳州", 24.30811, 109.38802],
        ["liuwu_xiangzhou", "象州", 23.93481, 109.57964],
        ["liuwu_wuxuan", "武宣", 23.73000, 109.70000],
        ["liuwu_guipingbei", "桂平北", 23.59183, 110.14320],
        ["liuwu_pingnanbei", "平南北", 23.57487, 110.42863],
        ["liuwu_tengxianbei", "藤县北", 23.50265, 110.72198],
        ["liuwu_wuzhou", "梧州", 23.48690, 111.24076]
      ]
    },
    {
      id: "chengdudong_ankangxi",
      name: "成都东—安康西通道",
      stations: [
        ["xicheng_06", "成都东", 30.63158, 104.13805],
        ["chengbaan_jintangdong", "金堂东", 30.85600, 104.45900],
        ["chengbaan_zhongjiang", "中江", 31.02730, 104.69480],
        ["miansuinei_santai", "三台", 31.08439, 105.04570],
        ["chengbaan_yanting", "盐亭", 31.20859, 105.38903],
        ["chengbaan_langzhongnan", "阆中南", 31.50630, 106.04880],
        ["chengbaan_yilongjincheng", "仪陇", 31.51600, 106.40600],
        ["chengbaan_bazhongdong", "巴中东", 31.84237, 106.87001],
        ["chengbaan_tongjiang", "通江", 31.91201, 107.24476],
        ["chengbaan_wanyuanbei", "万源北", 32.10500, 108.04000],
        ["chengbaan_ziyangnan", "紫阳南", 32.51000, 108.53500],
        ["xiyu_02", "安康西", 32.73289, 108.94679]
      ]
    },
    {
      id: "liuzhou_guiyang",
      name: "柳州—贵阳通道",
      type: "conventional",
      stations: [
        ["nanheng_04", "柳州", 24.30811, 109.38802],
        ["qiangui_liucheng", "柳城", 24.51469, 108.96297],
        ["qiangui_yizhou", "宜州", 24.48203, 108.62309],
        ["yunan_05", "河池西", 24.71384, 108.17235],
        ["qiangui_jinchengjiang", "金城江", 24.69966, 108.06509],
        ["qiangui_nandan", "南丹", 24.99730, 107.56080],
        ["qiangui_dushan", "独山", 25.86730, 107.54350],
        ["qiangui_duyun", "都匀", 26.23546, 107.51119],
        ["qiangui_guidingnan", "贵定南", 26.34630, 107.18997],
        ["qiangui_longli", "龙里", 26.45071, 106.96961],
        ["qiangui_guiyang", "贵阳", 26.55657, 106.70243]
      ]
    },
    {
      id: "liuzhou_huaihua",
      name: "柳州—怀化通道",
      type: "conventional",
      stations: [
        ["nanheng_04", "柳州", 24.30811, 109.38802],
        ["jiaoliu_luocheng", "罗城", 24.84193, 109.12575],
        ["jiaoliu_rongshui", "融水", 25.07147, 109.24114],
        ["jiaoliu_rongan", "融安", 25.18784, 109.40760],
        ["jiaoliu_sanjiangxian", "三江县", 25.83841, 109.56754],
        ["jiaoliu_tongdao", "通道", 26.31944, 109.62783],
        ["jiaoliu_jingzhou", "靖州", 26.56688, 109.68827],
        ["jiaoliu_huitong", "会同", 26.88944, 109.72806],
        ["jiaoliu_qiancheng", "黔城", 27.20017, 109.83791],
        ["yuhuai_huaihua", "怀化", 27.55798, 109.96717]
      ]
    },
    {
      id: "liuzhoudong_guangzhoubei",
      name: "柳州东—广州北通道",
      stations: [
        ["liuhe_liuzhoudong", "柳州东", 24.40308, 109.60536],
        ["liuhe_luzhainan", "鹿寨南", 24.42500, 109.75000],
        ["liuhe_jinxiu", "金秀", 24.32665, 110.05875],
        ["liuhe_mengshan", "蒙山", 24.19374, 110.52484],
        ["liuhe_zhaoping", "昭平", 24.17600, 110.81700],
        ["liuhe_huangyao", "黄姚", 24.24791, 111.20312],
        ["guigang_04", "贺州", 24.45488, 111.53953]
      ]
    },
    {
      id: "liuzhoudong_guangzhoubei_east",
      name: "柳州东—广州北通道",
      stations: [
        ["guangqingyong_lianzhou", "连州", 24.78087, 112.37726],
        ["guangqingyong_yangshan", "阳山", 24.46523, 112.64120],
        ["guangqingyong_qingyuanxi", "清远西", 23.70400, 112.98500],
        ["jingguang_guangzhoubei", "广州北", 23.37727, 113.20385]
      ]
    },
    {
      id: "guilinxi_guangzhounan",
      name: "桂林西—广州南通道",
      stations: [
        ["guigang_03", "桂林西", 25.35741, 110.26251],
        ["guigang_yangshuo", "阳朔", 24.96014, 110.56808],
        ["guigang_gongcheng", "恭城", 24.83356, 110.86538],
        ["guigang_zhongshanxi", "钟山西", 24.55217, 111.33195],
        ["guigang_04", "贺州", 24.45488, 111.53953],
        ["guigang_huaiji", "怀集", 23.89262, 112.15990],
        ["guigang_guangning", "广宁", 23.58759, 112.42064],
        ["nanguang_03", "肇庆东", 23.21330, 112.66297],
        ["guigang_sanshuinan", "三水南", 23.11336, 112.87112],
        ["nanguang_02", "佛山西", 23.07930, 113.03352],
        ["jingguang_24", "广州南", 22.98834, 113.26910]
      ]
    },
    {
      id: "guilinbei_hengyangdong",
      name: "桂林北—衡阳东通道",
      stations: [
        ["nanheng_guilinbei", "桂林北", 25.32902, 110.30173],
        ["nanheng_xinganbei", "兴安北", 25.67687, 110.66269],
        ["nanheng_quanzhounan", "全州南", 25.95634, 111.03649],
        ["nanheng_lingling", "零陵", 26.22000, 111.60000],
        ["nanheng_02", "永州", 26.45407, 111.57159],
        ["nanheng_qiyang", "祁阳", 26.61247, 111.82610],
        ["nanheng_qidong", "祁东", 26.76056, 112.06580],
        ["jingguang_20", "衡阳东", 26.89647, 112.70956]
      ]
    },
    {
      id: "guilinxi_baise",
      name: "桂林西—百色通道",
      stations: [
        ["guigang_03", "桂林西", 25.35741, 110.26251],
        ["guibai_yongfu", "永福", 25.05000, 109.95500],
        ["guibai_rongandong", "融安东", 25.21550, 109.45200],
        ["guibai_luochengxi", "罗城西", 24.78200, 108.84800],
        ["guibai_yizhoubei", "宜州北", 24.55500, 108.64200],
        ["yunan_05", "河池西", 24.71384, 108.17235],
        ["guibai_donglan", "东兰", 24.48500, 107.40200],
        ["guibai_bama", "巴马", 24.16000, 107.28500],
        ["nankun_02", "百色", 23.88459, 106.66396]
      ]
    },
    {
      id: "huaihuanan_guilinbei",
      name: "怀化南—桂林北通道",
      stations: [
        ["hukun_16", "怀化南", 27.51552, 109.98876],
        ["huaishao_anjiangdong", "安江东", 27.34382, 110.15745],
        ["huaigui_dongkou", "洞口", 27.09495, 110.61697],
        ["huaigui_wugang", "武冈", 26.73500, 110.67500],
        ["huaigui_xinning", "新宁", 26.44500, 110.84200],
        ["huaigui_ziyuan", "资源", 26.05500, 110.65500],
        ["nanheng_xinganbei", "兴安北", 25.67687, 110.66269]
      ]
    },
    {
      id: "hezhou_zhanjiangxi",
      name: "贺州—湛江西通道",
      stations: [
        ["guigang_04", "贺州", 24.45488, 111.53953],
        ["guitan_cangwu", "苍梧", 23.84500, 111.54000],
        ["nanguang_05", "梧州南", 23.39306, 111.21972],
        ["shennan_cenxidong", "岑溪东", 22.89270, 111.04089]
      ]
    },
    {
      id: "hezhou_zhanjiangxi_south",
      name: "贺州—湛江西通道",
      stations: [
        ["shennan_yulinbei", "玉林北", 22.72557, 110.24503],
        ["guitan_luchuan", "陆川", 22.31500, 110.20500],
        ["nanzhan_lianjiangnan", "廉江南", 21.48762, 110.08291],
        ["nanzhan_suixinan", "遂溪南", 21.33345, 110.23716],
        ["nanzhan_zhanjiangxi", "湛江西", 21.24250, 110.28889]
      ]
    },
    {
      id: "guilinbei_ganzhouxi",
      name: "桂林北—赣州西通道",
      stations: [
        ["nanheng_guilinbei", "桂林北", 25.32902, 110.30173],
        ["nanheng_xinganbei", "兴安北", 25.67687, 110.66269],
        ["guichen_guanyang", "灌阳", 25.49300, 111.15500],
        ["guichen_jiangyongbei", "江永北", 25.36500, 111.42500],
        ["guichen_daoxian", "道县", 25.52500, 111.61500],
        ["guichen_ningyuan", "宁远", 25.59000, 111.96500],
        ["guichen_jiahe", "嘉禾", 25.59000, 112.39000],
        ["jingguang_21", "郴州西", 25.73661, 112.96996],
        ["chenggan_zixing", "资兴", 25.96500, 113.22000],
        ["chenggan_guidong", "桂东", 26.06000, 113.91500],
        ["chenggan_shangyou", "上犹", 25.95500, 114.37500],
        ["heshen_06", "赣州西", 25.81978, 114.81701]
      ]
    },
    {
      id: "guangzhoubaiyun_zhanjiangbei",
      name: "广州白云—湛江北通道",
      stations: [
        ["guangzhan_guangzhoubaiyun", "广州白云", 23.19091, 113.24634],
        ["guangzhan_foshan", "佛山", 23.04810, 113.09747],
        ["shennan_fozhao", "佛肇", 22.86904, 112.56916],
        ["guangzhan_xinxingnan", "新兴南", 22.64338, 112.23695],
        ["guangzhan_yangchundong", "阳春东", 22.18910, 111.90447],
        ["guangzhan_yangjiangbei", "阳江北", 21.91725, 111.83941],
        ["guangzhan_mata", "马踏", 21.68403, 111.36080],
        ["guangzhan_maomingnan", "茂名南", 21.60152, 110.98003],
        ["guangzhan_wuchuan", "吴川", 21.51172, 110.76449],
        ["guangzhan_05", "湛江北", 21.22090, 110.35337]
      ]
    },
    {
      id: "jiangmen_zhanjiangxi",
      name: "江门—湛江西通道",
      stations: [
        ["shennan_jiangmen", "江门", 22.49100, 113.06486],
        ["shenzhan_taishan", "台山", 22.30220, 112.81017],
        ["shenzhan_kaipingnan", "开平南", 22.32205, 112.67068],
        ["shenzhan_enping", "恩平", 22.18773, 112.39141],
        ["guangzhan_03", "阳江", 21.81043, 111.99049],
        ["shenzhan_yangxi", "阳西", 21.79899, 111.63913],
        ["guangzhan_mata", "马踏", 21.68403, 111.36080],
        ["yuegui_02", "茂名", 21.64213, 110.92904],
        ["guangzhan_wuchuan", "吴川", 21.51172, 110.76449],
        ["nanzhan_zhanjiangxi", "湛江西", 21.24250, 110.28889]
      ]
    },
    {
      id: "zhanjiangbei_haikou",
      name: "湛江北—海口通道",
      stations: [
        ["guangzhan_05", "湛江北", 21.22090, 110.35337],
        ["zhanhai_leizhoubei", "雷州北", 20.95000, 110.11500],
        ["zhanhai_longmenxi", "龙门西", 20.65000, 110.05500],
        ["zhanhai_xuwen", "徐闻", 20.34854, 110.14147],
        ["zhanhai_xuwennan", "徐闻南", 20.22831, 110.13043],
        ["zhanhai_02", "海口北", 20.04114, 110.15514],
        ["hainan_haikou", "海口", 20.02732, 110.16212]
      ]
    },
    {
      id: "haikou_sanya_east",
      name: "海口—三亚东环通道",
      stations: [
        ["hainan_haikou", "海口", 20.02732, 110.16212],
        ["hainan_haikoudong", "海口东", 19.98341, 110.34287],
        ["hainan_meilan", "美兰", 19.94417, 110.45556],
        ["hainan_wenchang", "文昌", 19.60638, 110.73743],
        ["hainanring_02", "琼海", 19.24139, 110.48750],
        ["hainan_boao", "博鳌", 19.13786, 110.48271],
        ["hainan_wanning", "万宁", 18.80927, 110.37700],
        ["hainan_shenzhou", "神州", 18.72472, 110.30777],
        ["hainan_lingshui", "陵水", 18.53587, 110.03340],
        ["hainan_yalongwan", "亚龙湾", 18.30218, 109.60248],
        ["hainanring_03", "三亚", 18.29645, 109.49289]
      ]
    },
    {
      id: "haikou_sanya_west",
      name: "海口—三亚西环通道",
      stations: [
        ["hainan_haikou", "海口", 20.02732, 110.16212],
        ["hainan_laochengzhen", "老城镇", 19.93342, 110.11318],
        ["hainan_fushanzhen", "福山镇", 19.87812, 109.91428],
        ["hainan_lingaonan", "临高南", 19.86964, 109.75515],
        ["hainan_yintan", "银滩", 19.79168, 109.48534],
        ["hainan_baimajing", "白马井", 19.65996, 109.24992],
        ["hainan_haitou", "海头", 19.49633, 108.98931],
        ["hainan_qiziwan", "棋子湾", 19.33923, 108.80413],
        ["hainan_dongfang", "东方", 19.09006, 108.68774],
        ["hainan_jinyuewan", "金月湾", 18.78029, 108.71223],
        ["hainan_jianfeng", "尖峰", 18.62316, 108.74923],
        ["hainan_huangliu", "黄流", 18.53071, 108.82719],
        ["hainan_ledong", "乐东", 18.44680, 108.93472],
        ["hainan_yazhou", "崖州", 18.37869, 109.15322],
        ["hainan_fenghuangjichang", "凤凰机场", 18.31831, 109.40669],
        ["hainanring_03", "三亚", 18.29645, 109.49289]
      ]
    },
    {
      id: "guangzhounan_futian",
      name: "广州南—福田通道",
      stations: [
        ["jingguang_24", "广州南", 22.98834, 113.26910],
        ["guangshen_qingsheng", "庆盛", 22.86763, 113.49182],
        ["guangshen_humen", "虎门", 22.86047, 113.67360],
        ["guangshen_guangmingcheng", "光明城", 22.73242, 113.95495],
        ["heshen_10", "深圳北", 22.60988, 114.02951],
        ["guangshen_futian", "福田", 22.53814, 114.05720]
      ]
    },
    {
      id: "guangzhoubei_shenzhenxili",
      name: "广州北—深圳西丽通道",
      stations: [
        ["jingguang_guangzhoubei", "广州北", 23.37727, 113.20385],
        ["guangshen2_baiyunjichangt3", "白云机场T3", 23.36431, 113.32065],
        ["guangshen2_huangpu", "黄埔", 23.10034, 113.43228],
        ["guangshen2_dongguanzhongxin", "东莞城际", 23.01277, 113.75812],
        ["shennan_shenzhenjichangdong", "深圳机场东", 22.64998, 113.81760],
        ["shennan_shenzhenxili", "深圳西丽", 22.56516, 113.94353]
      ]
    },
    {
      id: "hengyangdong_guangzhounan",
      name: "衡阳东—广州南通道",
      stations: [
        ["jingguang_20", "衡阳东", 26.89647, 112.70956],
        ["jingguang_leiyangxi", "耒阳西", 26.41446, 112.78902],
        ["jingguang_21", "郴州西", 25.73661, 112.96996],
        ["jingguang_lechangdong", "乐昌东", 25.11347, 113.39627],
        ["jingguang_22", "韶关", 24.75016, 113.51528],
        ["jingguang_yingdexi", "英德西", 24.15944, 113.35234],
        ["jingguang_23", "清远", 23.69418, 113.13364],
        ["jingguang_guangzhoubei", "广州北", 23.37727, 113.20385],
        ["jingguang_24", "广州南", 22.98834, 113.26910]
      ]
    },
    {
      id: "guangzhounan_zhuhai",
      name: "广州南—珠海通道",
      stations: [
        ["jingguang_24", "广州南", 22.98834, 113.26910],
        ["guangzhu_shunde", "顺德", 22.87481, 113.27673],
        ["guangzhu_ronggui", "容桂", 22.75113, 113.31237],
        ["guangzhu_xiaolan", "小榄", 22.64842, 113.27013],
        ["shennan_zhongshanbei", "中山北", 22.55705, 113.38274],
        ["guangzhuanao_02", "中山", 22.54374, 113.43273],
        ["guangzhu_zhuhaibei", "珠海北", 22.40053, 113.55189],
        ["guangzhu_tangjiawan", "唐家湾", 22.36305, 113.55184],
        ["guangzhuanao_03", "珠海", 22.21538, 113.54957]
      ]
    },
    {
      id: "guangzhoubei_hengqin",
      name: "广州北—横琴通道",
      stations: [
        ["jingguang_guangzhoubei", "广州北", 23.37727, 113.20385],
        ["guangshen2_baiyunjichangt3", "白云机场T3", 23.36431, 113.32065],
        ["guangshen2_huangpu", "黄埔", 23.10034, 113.43228],
        ["shennan_nansha", "南沙", 22.69682, 113.55647],
        ["guangzhuanao_02", "中山", 22.54374, 113.43273],
        ["guangzhuao_hezhou", "珠海鹤洲", 22.24500, 113.38500],
        ["guangzhuao_hengqin", "横琴", 22.12650, 113.49200]
      ]
    },
    {
      id: "zhuhaihezhou_zhaoqingdong",
      name: "珠海鹤洲—肇庆东通道",
      stations: [
        ["guangzhuao_hezhou", "珠海鹤洲", 22.24500, 113.38500],
        ["zhuzhao_lianzhou", "莲洲", 22.31521, 113.20813],
        ["shennan_jiangmen", "江门", 22.49100, 113.06486],
        ["zhuzhao_heshanxi", "鹤山西", 22.73078, 112.93160],
        ["zhuzhao_gaoming", "高明", 22.85565, 112.71056],
        ["nanguang_03", "肇庆东", 23.21330, 112.66297]
      ]
    },
    {
      id: "shenzhenxili_zhuhaihezhou",
      name: "深圳西丽—珠海鹤洲通道",
      stations: [
        ["shennan_shenzhenxili", "深圳西丽", 22.56516, 113.94353],
        ["guangzhu_zhuhaibei", "珠海北", 22.40053, 113.55189],
        ["guangzhuao_hezhou", "珠海鹤洲", 22.24500, 113.38500]
      ]
    },
    {
      id: "guangzhoudong_shantou",
      name: "广州东—汕头通道",
      stations: [
        ["guangshan_guangzhoudong", "广州东", 23.15059, 113.32496],
        ["guangshan_xintang", "新塘", 23.13665, 113.60034],
        ["guangshan_zengcheng", "增城", 23.20389, 113.79950],
        ["guangshan_luofushan", "罗浮山", 23.19601, 114.06895],
        ["guangshan_boluo", "博罗", 23.14368, 114.20358],
        ["guangshan_huizhounan", "惠州南", 22.99850, 114.45818],
        ["guangshan_huidong", "惠东", 22.93616, 114.73714],
        ["guangshan_shenshan", "深汕", 22.87250, 115.07850],
        ["hangshen_13", "汕尾", 22.80960, 115.42831],
        ["shanshan_lufengnan", "陆丰南", 22.89324, 115.66152],
        ["shanshan_lufengdong", "陆丰东", 22.90591, 115.88931],
        ["shanshan_huilai", "惠来", 22.99511, 116.28670],
        ["shanshan_chaonan", "潮南", 23.13123, 116.53083],
        ["shanshan_shantounan", "汕头南", 23.22973, 116.67732],
        ["shanshan_shantou", "汕头", 23.37205, 116.75706]
      ]
    },
    {
      id: "lianzhou_dongkou",
      name: "连州—洞口通道",
      stations: [
        ["guangqingyong_lianzhou", "连州", 24.78087, 112.37726],
        ["guangqingyong_lanshan", "蓝山", 25.38200, 112.17500],
        ["guichen_ningyuan", "宁远", 25.59000, 111.96500],
        ["guangqingyong_shuangpaidong", "双牌东", 25.96300, 111.69000],
        ["nanheng_lingling", "零陵", 26.22000, 111.60000],
        ["nanheng_02", "永州", 26.45407, 111.57159],
        ["shaoyong_shaoyangxian", "邵阳县", 27.00000, 111.35000],
        ["yishaoyong_02", "邵阳", 27.21363, 111.46115],
        ["huaishao_shaoyangxi", "邵阳西", 27.21035, 111.24571],
        ["huaishao_longhui", "隆回", 27.15005, 111.03037],
        ["huaigui_dongkou", "洞口", 27.09495, 110.61697]
      ]
    },
    {
      id: "guangzhoubei_ganzhouxi",
      name: "广州北—赣州西通道",
      stations: [
        ["jingguang_guangzhoubei", "广州北", 23.37727, 113.20385],
        ["ganguang_lutian", "吕田", 23.81500, 113.95000],
        ["ganguang_xinfeng", "新丰", 24.06000, 114.20500],
        ["ganguang_lianping", "连平", 24.37000, 114.49000],
        ["ganguang_quannan", "全南", 24.87000, 114.43000],
        ["ganguang_longnanbei", "龙南北", 24.93000, 114.80000],
        ["ganguang_xinfengbei", "信丰北", 25.42000, 114.92500],
        ["heshen_06", "赣州西", 25.81978, 114.81701]
      ]
    },
    {
      id: "baiyunjichangt3_longyan",
      name: "白云机场T3—龙岩通道",
      stations: [
        ["guangshen2_baiyunjichangt3", "白云机场T3", 23.36431, 113.32065],
        ["guanghe_conghua", "从化", 23.55500, 113.61200],
        ["guanghe_yonghan", "永汉", 23.56700, 114.00400],
        ["guanghe_longmen", "龙门", 23.72400, 114.25400],
        ["heshen_07", "河源东", 23.68613, 114.73276],
        ["ganshen_heyuanbei", "河源北", 23.88432, 115.00697],
        ["ganshen_longchuanxi", "龙川西", 24.07717, 115.18104],
        ["meilong_wuhua", "五华", 24.05950, 115.62760],
        ["meilong_xingningnan", "兴宁南", 24.10553, 115.78873],
        ["heshen_meizhou_02", "梅州西", 24.24938, 116.04666],
        ["longlong_meizhou", "梅州", 24.25829, 116.13071],
        ["longlong_yanyangxi", "雁洋西", 24.41400, 116.31000],
        ["longlong_jiaoling", "蕉岭", 24.62000, 116.16000],
        ["longlong_wuping", "武平", 25.05000, 116.20500],
        ["longlong_shanghang", "上杭", 25.07601, 116.39112],
        ["longlong_gutianhuizhi", "古田会址", 25.18697, 116.76743],
        ["yuxia_10", "龙岩", 25.10001, 117.00056]
      ]
    },
    {
      id: "futian_hongkongwestkowloon",
      name: "福田—香港西九龙通道",
      stations: [
        ["guangshen_futian", "福田", 22.53814, 114.05720],
        ["shenzhen_hongkong_02", "香港西九龙", 22.30114, 114.17041]
      ]
    },
    {
      id: "ganzhouxi_guangmingcheng",
      name: "赣州西—光明城通道",
      stations: [
        ["heshen_06", "赣州西", 25.81978, 114.81701],
        ["ganshen_xinfengxi", "信丰西", 25.35036, 114.90107],
        ["ganshen_longnandong", "龙南东", 24.90482, 114.86891],
        ["ganshen_dingnannan", "定南南", 24.74402, 115.03089],
        ["ganshen_hepingbei", "和平北", 24.47255, 114.95995],
        ["ganshen_longchuanxi", "龙川西", 24.07717, 115.18104]
      ]
    },
    {
      id: "ganzhouxi_guangmingcheng_south",
      name: "赣州西—光明城通道",
      stations: [
        ["heshen_07", "河源东", 23.68613, 114.73276],
        ["ganshen_boluobei", "博罗北", 23.48040, 114.55719],
        ["heshen_08", "惠州北", 23.18324, 114.37485],
        ["ganshen_zhongkai", "仲恺", 23.02942, 114.26185],
        ["heshen_09", "东莞南", 22.84540, 114.06924],
        ["guangshen_guangmingcheng", "光明城", 22.73242, 113.95495]
      ]
    },
    {
      id: "shenzhenxili_shenshan",
      name: "深圳西丽—深汕通道",
      stations: [
        ["shennan_shenzhenxili", "深圳西丽", 22.56516, 113.94353],
        ["shenshan_luohubei", "罗湖北", 22.58087, 114.11302],
        ["xiashen_shenzhenpingshan", "深圳坪山", 22.70732, 114.32718],
        ["xiashen_huiyang", "惠阳", 22.78680, 114.48800],
        ["xiashen_huidongnan", "惠东南", 22.84750, 114.78970],
        ["guangshan_shenshan", "深汕", 22.87250, 115.07850]
      ]
    },
    {
      id: "shenzhenbei_chaoshan",
      name: "深圳北—潮汕通道",
      stations: [
        ["heshen_10", "深圳北", 22.60988, 114.02951],
        ["xiashen_shenzhenpingshan", "深圳坪山", 22.70732, 114.32718],
        ["xiashen_huiyang", "惠阳", 22.78680, 114.48800],
        ["xiashen_huidongnan", "惠东南", 22.84750, 114.78970],
        ["xiashen_houmen", "鲘门", 22.81276, 115.12505],
        ["hangshen_13", "汕尾", 22.80960, 115.42831],
        ["xiashen_lufeng", "陆丰", 22.94781, 115.73330],
        ["xiashen_kuitan", "葵潭", 23.06705, 115.99216],
        ["xiashen_puning", "普宁", 23.26675, 116.19942],
        ["xiashen_chaoyang", "潮阳", 23.38340, 116.41740],
        ["hangshen_12", "潮汕", 23.53959, 116.58817]
      ]
    },
    {
      id: "shantou_chaoshan",
      name: "汕头—潮汕通道",
      stations: [
        ["shanshan_shantou", "汕头", 23.37205, 116.75706],
        ["hangshen_12", "潮汕", 23.53959, 116.58817]
      ]
    },
    {
      id: "shantou_xiamenbei",
      name: "汕头—厦门北通道",
      stations: [
        ["shanshan_shantou", "汕头", 23.37205, 116.75706],
        ["zhangshan_shantoudong", "汕头东", 23.54400, 116.80300],
        ["zhangshan_raopingnan", "饶平南", 23.64497, 117.00024],
        ["zhangshan_zhaoannan", "诏安南", 23.69899, 117.17672],
        ["zhangshan_dongshan", "东山县", 23.74344, 117.35381],
        ["hangshen_zhangpu", "漳浦", 24.09585, 117.56340],
        ["hangshen_11", "漳州", 24.45945, 117.71149],
        ["hangshen_10", "厦门北", 24.63698, 118.07391]
      ]
    },
    {
      id: "chaoshan_meizhouxi",
      name: "潮汕—梅州西通道",
      stations: [
        ["hangshen_12", "潮汕", 23.53959, 116.58817],
        ["meishan_jieyangjichang", "揭阳机场", 23.54758, 116.51226],
        ["meishan_jieyang", "揭阳", 23.60887, 116.33399],
        ["meishan_fengshundong", "丰顺东", 23.80698, 116.18614],
        ["meishan_jianqiao", "建桥", 23.93270, 116.10570],
        ["meishan_shejiangbei", "畲江北", 24.06263, 116.01677],
        ["heshen_meizhou_02", "梅州西", 24.24938, 116.04666]
      ]
    },
    {
      id: "xuzhoudong_luoyanglongmen",
      name: "徐州东—洛阳龙门通道",
      stations: [
        ["jinghu_09", "徐州东", 34.26795, 117.30604],
        ["lianxulan_xiaoxianbei", "萧县北", 34.23618, 116.94171],
        ["lianxulan_yongchengbei", "永城北", 34.21542, 116.51991],
        ["lianxulan_dangshannan", "砀山南", 34.38615, 116.30333],
        ["jingxiongshang_07", "商丘", 34.44423, 115.65701],
        ["lianxulan_minquanbei", "民权北", 34.66021, 115.18032],
        ["lianxulan_lankaonan", "兰考南", 34.77194, 114.81833],
        ["lianxulan_04", "开封北", 34.83920, 114.26164],
        ["jingguang_09", "郑州东", 34.76001, 113.77306],
        ["lianxulan_zhengzhouxi", "郑州西", 34.74495, 113.42524],
        ["lianxulan_gongyinan", "巩义南", 34.67076, 112.91640],
        ["lianxulan_06", "洛阳龙门", 34.59428, 112.45269]
      ]
    },
    {
      id: "zhengzhoudong_xiangyangdong",
      name: "郑州东—襄阳东通道",
      stations: [
        ["jingguang_09", "郑州东", 34.76001, 113.77306],
        ["zhengyu_zhengzhouhangkong", "郑州航空港", 34.48916, 113.92689],
        ["zhengyu_changgebei", "长葛北", 34.25053, 113.73528],
        ["zhengyu_yuzhou", "禹州", 34.12431, 113.57181],
        ["zhengyu_jiaxian", "郏县", 33.94482, 113.27071],
        ["zhengyu_02", "平顶山西", 33.81678, 113.08782],
        ["zhengyu_fangcheng", "方城", 33.23858, 112.94990],
        ["zhengyu_03", "南阳东", 32.95090, 112.66131],
        ["zhengyu_dengzhoudong", "邓州东", 32.59655, 112.26570],
        ["zhengyu_04", "襄阳东", 32.01631, 112.29051]
      ]
    },
    {
      id: "zhengzhoudong_wuhan",
      name: "郑州东—武汉通道",
      stations: [
        ["jingguang_09", "郑州东", 34.76001, 113.77306],
        ["jingguang_10", "许昌东", 34.04837, 113.88726],
        ["jingguang_11", "漯河西", 33.57248, 113.96396],
        ["jingguang_12", "驻马店西", 33.00058, 113.97881],
        ["jingguang_minggangdong", "明港东", 32.48895, 114.05888],
        ["jingguang_13", "信阳东", 32.14388, 114.15928],
        ["jingguang_14", "孝感北", 31.58822, 114.21623],
        ["jingguang_15", "武汉", 30.60698, 114.42434]
      ]
    },
    {
      id: "zhengzhouhangkong_fuyangxi",
      name: "郑州航空港—阜阳西通道",
      stations: [
        ["zhengyu_zhengzhouhangkong", "郑州航空港", 34.48916, 113.92689],
        ["zhengfu_xuchangbei", "许昌北", 34.14451, 113.92444],
        ["zhengfu_yanling", "鄢陵", 34.06530, 114.13406],
        ["zhengfu_fugounan", "扶沟南", 33.99768, 114.38125],
        ["zhengfu_xihua", "西华", 33.79506, 114.60431],
        ["jingguang_zhoukou_02", "周口东", 33.64680, 114.74072],
        ["zhengfu_huaiyangnan", "淮阳南", 33.50491, 114.89626],
        ["zhengfu_shenqiubei", "沈丘北", 33.42427, 115.10133],
        ["zhengfu_jieshounan", "界首南", 33.22415, 115.31926],
        ["zhengfu_linquan", "临泉", 33.02461, 115.37210],
        ["shanghehang_03", "阜阳西", 32.88494, 115.74763]
      ]
    },
    {
      id: "zhengzhou_jiaozuo",
      name: "郑州—焦作通道",
      stations: [
        ["shizheng_zhengzhou", "郑州", 34.74751, 113.65367],
        ["zhengjiao_nanyangzhai", "南阳寨", 34.81548, 113.61090],
        ["zhengjiao_huanghejingqu", "黄河景区", 34.93194, 113.52694],
        ["zhengtai_wuzhi", "武陟", 35.08694, 113.45083],
        ["zhengtai_xiuwuxi", "修武西", 35.21140, 113.41890],
        ["zhengtai_02", "焦作", 35.22310, 113.22870]
      ]
    },
    {
      id: "zhengzhoudong_jinanxi",
      name: "郑州东—济南西通道",
      stations: [
        ["jingguang_09", "郑州东", 34.76001, 113.77306],
        ["zhengji_xinxiangnan", "新乡南", 35.04276, 113.85215],
        ["jingguang_08", "新乡东", 35.31471, 113.97293],
        ["zhengji_weihuinan", "卫辉南", 35.39026, 114.13290],
        ["zhengji_huaxun", "滑浚", 35.61749, 114.54706],
        ["zhengji_neihuang", "内黄", 35.67303, 114.85772],
        ["jingxiongshang_05", "濮阳东", 35.76557, 115.14407],
        ["zhengji_nanle", "南乐", 36.01264, 115.40759],
        ["zhengji_shenxian", "莘县", 36.20684, 115.68174],
        ["jingxiongshang_04", "聊城西", 36.43060, 115.87778],
        ["zhengji_chipingnan", "茌平南", 36.52801, 116.22777],
        ["zhengji_changqing", "长清", 36.56463, 116.72476],
        ["jinghu_06", "济南西", 36.66889, 116.88694]
      ]
    },
    {
      id: "lankaonan_rizhaoxi",
      name: "兰考南—日照西通道",
      stations: [
        ["lianxulan_lankaonan", "兰考南", 34.77194, 114.81833],
        ["rila_zhuangzhai", "庄寨", 35.03359, 115.18570],
        ["jingxiongshang_06", "菏泽东", 35.18472, 115.55711],
        ["rila_juyebei", "巨野北", 35.44701, 116.06899],
        ["rila_jiaxiangbei", "嘉祥北", 35.47139, 116.36365],
        ["rila_03", "济宁北", 35.52458, 116.60827],
        ["rila_jiningdong", "济宁东", 35.52410, 116.75085],
        ["rila_qufunan", "曲阜南", 35.51092, 117.01811],
        ["jinghu_qufudong", "曲阜东", 35.55655, 117.06306],
        ["rila_sishuinan", "泗水南", 35.53519, 117.27621],
        ["rila_mengshan", "蒙山", 35.44838, 117.66786],
        ["rila_feixianbei", "费县北", 35.32008, 117.93051],
        ["rila_02", "临沂北", 35.19646, 118.37478],
        ["rila_junanbei", "莒南北", 35.27374, 118.79211],
        ["rila_lijiazhai", "厉家寨", 35.28301, 119.12604],
        ["rila_01", "日照西", 35.39030, 119.41416]
      ]
    },
    {
      id: "rizhaoxi_qingdaobei",
      name: "日照西—青岛北通道",
      stations: [
        ["rila_01", "日照西", 35.39030, 119.41416],
        ["qingyan_liangcheng", "两城", 35.57890, 119.54147],
        ["qingyan_dongjiakou", "董家口", 35.67564, 119.70843],
        ["qingyan_qingdaoxi", "青岛西", 35.90186, 119.94861],
        ["qingyan_yanghekou", "洋河口", 36.13694, 120.06239],
        ["qingyan_hongdao", "红岛", 36.24573, 120.18656],
        ["jiqing_04", "青岛北", 36.16917, 120.37167]
      ]
    },
    {
      id: "jiaozuo_heze",
      name: "焦作—菏泽通道",
      type: "conventional",
      stations: [
        ["zhengtai_02", "焦作", 35.22310, 113.22870],
        ["xinyue_xiuwu", "修武", 35.24362, 113.43275],
        ["xinyue_huojia", "获嘉", 35.25667, 113.64300],
        ["xinyan_xinxiang", "新乡", 35.30637, 113.85356],
        ["xinyan_yanjin", "延津", 35.22980, 114.26550],
        ["xinyan_fengqiu", "封丘", 35.22650, 114.39700],
        ["xinyan_huaxiannan", "滑县南", 35.22643, 114.48502],
        ["xinyan_changyuan", "长垣", 35.21125, 114.65414],
        ["xinyan_dongmingxian", "东明县", 35.26873, 115.08636],
        ["xinyan_heze", "菏泽", 35.23130, 115.50192]
      ]
    },
    {
      id: "yueshan_jiyuan",
      name: "月山—济源通道",
      type: "conventional",
      stations: [
        ["houyue_yueshan", "月山", 35.210483, 113.048756],
        ["jiaoliu_qinyang", "沁阳", 35.199842, 112.949767],
        ["houyue_jiyuan", "济源", 35.11104, 112.56744]
      ]
    },
    {
      id: "jiaozuoxi_pingdingshanxi",
      name: "焦作西—平顶山西通道",
      stations: [
        ["zhengtai_jiaozuoxi", "焦作西", 35.208571, 113.056002],
        ["jiaoping_qinyangxi", "沁阳西", 35.105000, 112.887000],
        ["jiaoping_jiyuandong", "济源东", 35.051000, 112.658000],
        ["jiaoping_mengjinbei", "孟津北", 34.898000, 112.615000],
        ["lianxulan_06", "洛阳龙门", 34.59428, 112.45269],
        ["jiaoping_ruyangdong", "汝阳东", 34.158000, 112.575000],
        ["jiaoping_ruzhounan", "汝州南", 34.120000, 112.810000],
        ["zhengyu_02", "平顶山西", 33.81678, 113.08782]
      ]
    },
    {
      id: "nanyangdong_jinzhaidong",
      name: "南阳东—金寨东通道",
      stations: [
        ["zhengyu_03", "南阳东", 32.95090, 112.66131],
        ["nanxinhe_tanghebei", "唐河北", 32.735000, 112.850000],
        ["nanxinhe_biyang", "泌阳", 32.634210, 113.246160],
        ["nanxinhe_tongbaibei", "桐柏北", 32.435000, 113.503000],
        ["jingguang_13", "信阳东", 32.14388, 114.15928],
        ["nanxinhe_luoshan", "罗山", 32.167761, 114.545261],
        ["nanxinhe_xixian", "息县", 32.174770, 114.827198],
        ["nanxinhe_huangchuannan", "潢川南", 32.080000, 115.045000],
        ["nanxinhe_shangcheng", "商城", 31.953148, 115.442543],
        ["nanxinhe_gushi", "固始", 31.915006, 115.669449],
        ["nanxinhe_jinzhaidong", "金寨东", 31.760920, 115.975780]
      ]
    },
    {
      id: "pingdingshanxi_zhoukoudong",
      name: "平顶山西—周口东通道",
      stations: [
        ["zhengyu_02", "平顶山西", 33.81678, 113.08782],
        ["pingzhou_pingdingshannan", "平顶山南", 33.672670, 113.294340],
        ["pingzhou_wuyangbei", "舞阳北", 33.493080, 113.629420],
        ["jingguang_11", "漯河西", 33.57248, 113.96396],
        ["pingzhou_zhoukouxi", "周口西", 33.623300, 114.483440],
        ["jingguang_zhoukou_02", "周口东", 33.64680, 114.74072]
      ]
    },
    {
      id: "jiaozuo_xinxiangdong",
      name: "焦作—新乡东通道",
      stations: [
        ["zhengtai_xiuwuxi", "修武西", 35.21140, 113.41890],
        ["jiaoxin_huojianan", "获嘉南", 35.200000, 113.675000],
        ["jiaoxin_xinxiangnan_plan", "新乡南（旧规划暂名）", 35.275000, 113.850000],
        ["jingguang_08", "新乡东", 35.31471, 113.97293]
      ]
    },
    {
      id: "shangqiu_zhumadianxi",
      name: "商丘—驻马店西通道",
      stations: [
        ["jingxiongshang_07", "商丘", 34.44423, 115.65701],
        ["shangzhou_shangqiudong", "商丘东", 34.331980, 115.727390],
        ["shangzhou_gaoxin", "高辛", 34.185400, 115.556200],
        ["shangzhou_zhechengdong", "柘城东", 34.090000, 115.355000],
        ["shangzhou_sitong", "四通", 33.900700, 115.045600],
        ["shangzhou_huaiyangbei", "淮阳北", 33.790000, 114.885000],
        ["jingguang_zhoukou_02", "周口东", 33.64680, 114.74072],
        ["shangzhou_shangshuinan", "商水南", 33.500000, 114.615000],
        ["shangzhou_shangcaidong", "上蔡东", 33.260000, 114.315000],
        ["jingguang_12", "驻马店西", 33.00058, 113.97881]
      ]
    },
    {
      id: "zhumadianxi_biyang",
      name: "驻马店西—泌阳通道",
      stations: [
        ["jingguang_12", "驻马店西", 33.00058, 113.97881],
        ["nanxinhe_biyang", "泌阳", 32.634210, 113.246160]
      ]
    },
    {
      id: "ruyangdong_nanyangdong",
      name: "汝阳东—南阳东通道",
      stations: [
        ["jiaoping_ruyangdong", "汝阳东", 34.158000, 112.575000],
        ["ruyangnan_lushanxi", "鲁山西", 33.735000, 112.680000],
        ["ruyangnan_nanzhaobei", "南召北", 33.560000, 112.450000],
        ["zhengyu_03", "南阳东", 32.95090, 112.66131]
      ]
    },
    {
      id: "zhumadianxi_fuyangxi",
      name: "驻马店西—阜阳西通道",
      stations: [
        ["jingguang_12", "驻马店西", 33.00058, 113.97881],
        ["zhumafu_runannan", "汝南南", 32.965000, 114.375000],
        ["zhumafu_pingyu", "平舆", 32.970000, 114.625000],
        ["zhumafu_xincaibei", "新蔡北", 32.820000, 114.995000],
        ["zhumafu_linquannan", "临泉南", 32.910000, 115.355000],
        ["shanghehang_03", "阜阳西", 32.88494, 115.74763]
      ]
    },
    {
      id: "shangluoxi_nanyangdong",
      name: "商洛西—南阳东通道",
      stations: [
        ["xiwu_02", "商洛西", 33.86794, 109.85686],
        ["shangnan_danfengnan", "丹凤南", 33.675000, 110.352000],
        ["shangnan_shangnandong", "商南东", 33.523000, 110.925000],
        ["shangnan_xixiadong", "西峡东", 33.294000, 111.545000],
        ["shangnan_neixiangbei", "内乡北", 33.083000, 111.870000],
        ["shangnan_zhenpingbei", "镇平北", 33.066000, 112.257000],
        ["zhengyu_03", "南阳东", 32.95090, 112.66131]
      ]
    },
    {
      id: "shiyandong_xixiadong",
      name: "十堰东—西峡东通道",
      stations: [
        ["xiwu_03", "十堰东", 32.70974, 110.81880],
        ["shixia_yunyangbei", "郧阳北", 32.875000, 110.860000],
        ["shixia_xichuanxi", "淅川西", 33.133000, 111.440000],
        ["shangnan_xixiadong", "西峡东", 33.294000, 111.545000]
      ]
    },
    {
      id: "shangqiu_fuyangxi",
      name: "商丘—阜阳西通道",
      stations: [
        ["jingxiongshang_07", "商丘", 34.44423, 115.65701],
        ["shangzhou_shangqiudong", "商丘东", 34.331980, 115.727390],
        ["shanghe_lumiao", "芦庙", 34.041390, 115.779950],
        ["shanghe_bozhounan", "亳州南", 33.796240, 115.793090],
        ["shanghe_guchengdong", "古城东", 33.527804, 115.805830],
        ["shanghe_taihedong", "太和东", 33.157889, 115.722653],
        ["shanghehang_03", "阜阳西", 32.88494, 115.74763]
      ]
    },
    {
      id: "shangqiu_bengbunan",
      name: "商丘—蚌埠南通道",
      stations: [
        ["jingxiongshang_07", "商丘", 34.44423, 115.65701],
        ["lianxulan_yongchengbei", "永城北", 34.21542, 116.51991],
        ["huaibeng_huaibeixi", "淮北西", 33.941400, 116.730680],
        ["huaibeng_suzhouxi", "宿州西", 33.597920, 116.918240],
        ["huaibeng_shuangduiji", "双堆集", 33.438320, 116.953170],
        ["huaibeng_guzhennan", "固镇南", 33.251000, 117.305000],
        ["jinghu_11", "蚌埠南", 32.903690, 117.436790]
      ]
    },
    {
      id: "xiangyangdong_hankou",
      name: "襄阳东—汉口通道",
      stations: [
        ["zhengyu_04", "襄阳东", 32.01631, 112.29051],
        ["xiwu_zaoyang", "枣阳", 32.072070, 112.755916],
        ["xiwu_suixian", "随县", 31.767583, 113.204289],
        ["xiwu_05", "随州南", 31.653190, 113.357460],
        ["xiwu_anluxi", "安陆西", 31.256300, 113.646610],
        ["xiwu_yunmengdong", "云梦东", 31.048130, 113.778940],
        ["xiwu_xiaogandong", "孝感东", 30.935780, 113.942490],
        ["wuxiao_tianheairport", "天河机场", 30.772750, 114.211430],
        ["huyurong_08", "汉口", 30.621650, 114.249410]
      ]
    },
    {
      id: "xiangyangdong_yichangbei",
      name: "襄阳东—宜昌北通道",
      stations: [
        ["zhengyu_04", "襄阳东", 32.01631, 112.29051],
        ["xiangjing_yicheng", "宜城", 31.718714, 112.192133],
        ["huyurong_10", "荆门西", 31.002830, 112.107970],
        ["huyurong_dangyangxi", "当阳西", 30.844800, 111.750300],
        ["huyurong_11", "宜昌北", 30.74842, 111.46938]
      ]
    },
    {
      id: "changyangdong_changde",
      name: "襄阳东—常德通道",
      stations: [
        ["yifu_changyangdong", "长阳东", 30.41644, 111.21975],
        ["yichangde_yidu", "宜都", 30.333000, 111.391000],
        ["yichangde_songzi", "松滋", 30.145000, 111.650000],
        ["yichangde_lixian", "澧县", 29.680000, 111.665000],
        ["yichangde_linlidong", "临澧东", 29.445000, 111.690000],
        ["yuxia_04", "常德", 29.07463, 111.68945]
      ]
    },
    {
      id: "jingmenxi_changshanan",
      name: "荆门西—长沙南通道",
      stations: [
        ["huyurong_10", "荆门西", 31.002830, 112.107970],
        ["jingjing_shayangxi", "沙洋西", 30.655158, 112.157700],
        ["hanyi_jingzhou", "荆州", 30.372570, 112.207440],
        ["jingyue_gongan", "公安", 30.059000, 112.240000],
        ["jingyue_shishou", "石首", 29.735000, 112.425000],
        ["jingyue_huarong", "华容", 29.523000, 112.553000],
        ["jingguang_17", "岳阳东", 29.368852, 113.202273],
        ["jingguang_miluodong", "汨罗东", 28.748538, 113.138005],
        ["jingguang_18", "长沙南", 28.149960, 113.059700]
      ]
    },
    {
      id: "xiangyang_huaihua",
      name: "襄阳—怀化通道",
      type: "conventional",
      stations: [
        ["jiaoliu_xiangyang", "襄阳", 32.057796, 112.156209],
        ["jiaoliu_yichengnan", "宜城南", 31.631920, 112.178210],
        ["jiaoliu_jingmen", "荆门", 31.053260, 112.206170],
        ["jiaoliu_dangyang", "当阳", 30.849950, 111.806770],
        ["jiaoliu_zhicheng", "枝城", 30.272000, 111.508000],
        ["jiaoliu_songzixi", "松滋西", 30.175460, 111.601730],
        ["jiaoliu_lixianbei", "澧县北", 29.822000, 111.598890],
        ["jiaoliu_shimenxianbei", "石门县北", 29.602790, 111.428000],
        ["jiaoliu_cili", "慈利", 29.419320, 111.114040],
        ["jiaoliu_zhangjiajie", "张家界", 29.106650, 110.481730],
        ["jiaoliu_jishou", "吉首", 28.327360, 109.730500],
        ["jiaoliu_mayang", "麻阳", 27.858670, 109.798220],
        ["yuhuai_huaihua", "怀化", 27.55798, 109.96717]
      ]
    },
    {
      id: "jingmenxi_hankou",
      name: "荆门西—汉口通道",
      stations: [
        ["huyurong_10", "荆门西", 31.002830, 112.107970],
        ["huyurong_zhongxiangnan", "钟祥南", 31.049097, 112.623189],
        ["huyurong_jingshannan", "京山南", 30.826858, 112.972928],
        ["huyurong_tianmen", "天门", 30.698839, 113.206900],
        ["huyurong_hanchuanbei", "汉川北", 30.707550, 113.847990],
        ["huyurong_08", "汉口", 30.621650, 114.249410]
      ]
    },
    {
      id: "jingzhou_hankou",
      name: "荆州—汉口通道",
      type: "conventional",
      stations: [
        ["hanyi_jingzhou", "荆州", 30.372570, 112.207440],
        ["hanyi_qianjiang", "潜江", 30.391600, 112.933900],
        ["hanyi_xiantaoxi", "仙桃西", 30.427310, 113.133990],
        ["hanyi_tianmennan", "天门南", 30.430380, 113.450350],
        ["hanyi_hanchuan", "汉川", 30.544200, 113.807250],
        ["huyurong_08", "汉口", 30.621650, 114.249410]
      ]
    },
    {
      id: "zhangjiajiexi_huaihuanan",
      name: "张家界西—怀化南通道",
      stations: [
        ["yuxia_03", "张家界西", 29.17137, 110.45800],
        ["zhangjihua_furongzhen", "芙蓉镇", 28.773020, 109.982020],
        ["zhangjihua_guzhangxi", "古丈西", 28.624010, 109.932300],
        ["zhangjihua_02", "吉首东", 28.219150, 109.722790],
        ["zhangjihua_fenghuanggucheng", "凤凰古城", 28.020510, 109.599190],
        ["zhangjihua_mayangxi", "麻阳西", 27.838085, 109.775522],
        ["hukun_16", "怀化南", 27.51552, 109.98876]
      ]
    },
    {
      id: "wuhan_changshanan",
      name: "武汉—长沙南通道",
      stations: [
        ["jingguang_15", "武汉", 30.60698, 114.42434],
        ["jingguang_16", "咸宁北", 29.901610, 114.295850],
        ["jingguang_chibibei", "赤壁北", 29.739360, 113.894790],
        ["jingguang_17", "岳阳东", 29.368852, 113.202273],
        ["jingguang_miluodong", "汨罗东", 28.748538, 113.138005],
        ["jingguang_18", "长沙南", 28.149960, 113.059700]
      ]
    },
    {
      id: "yueyangdong_changde",
      name: "岳阳东—常德通道",
      stations: [
        ["jingyue_huarong", "华容", 29.523000, 112.553000],
        ["changyue_nanxian", "南县", 29.371970, 112.385800],
        ["changyue_anxiang", "安乡", 29.413260, 112.167320],
        ["yuxia_04", "常德", 29.07463, 111.68945]
      ]
    },
    {
      id: "changde_huaihuanan",
      name: "常德—怀化南通道",
      stations: [
        ["yuxia_04", "常德", 29.07463, 111.68945],
        ["qianzhangchang_taoyuan", "桃源", 28.907530, 111.393660],
        ["changhuai_yuanling", "沅陵", 28.455480, 110.396330],
        ["changhuai_chenxi", "辰溪", 28.004060, 110.189420],
        ["hukun_16", "怀化南", 27.51552, 109.98876]
      ]
    },
    {
      id: "gaoling_fupingnan",
      name: "高陵—富平南通道",
      stations: [
        ["xiyan_gaoling", "高陵", 34.50757, 109.12846],
        ["xiyan_fupingnan", "富平南", 34.70792, 109.20591]
      ]
    },
    {
      id: "wuhantianhe_hefeinan",
      name: "武汉天河—合肥南通道",
      stations: [
        ["huyurong_wuhantianhe", "武汉天河", 30.763310, 114.232340],
        ["hewu_changjiangxinqu", "长江新区", 30.885000, 114.430000],
        ["hewu_hongan", "红安南", 31.006220, 114.626450],
        ["hewu_machengbei", "麻城北", 31.189270, 114.979290],
        ["hewu_nanxi", "南溪", 31.514130, 115.627150],
        ["nanxinhe_jinzhaidong", "金寨东", 31.760920, 115.975780],
        ["hewu_luanbei", "六安北", 31.809400, 116.556770],
        ["hewu_changanji", "长安集", 31.803000, 117.145000],
        ["shanghehang_05", "合肥南", 31.800300, 117.284880]
      ]
    },
    {
      id: "wuhan_jiujiang",
      name: "武汉—九江通道",
      stations: [
        ["jingguang_15", "武汉", 30.60698, 114.42434],
        ["wujiu_gediannan", "葛店南", 30.492620, 114.655090],
        ["wujiu_ezhou", "鄂州", 30.364240, 114.861330],
        ["wujiu_huangshibei", "黄石北", 30.214290, 115.002830],
        ["wujiu_dayebei", "大冶北", 30.124870, 114.995390],
        ["wujiu_yangxin", "阳新", 29.861670, 115.174440],
        ["wujiu_ruichangxi", "瑞昌西", 29.662630, 115.628960],
        ["wujiu_lushan", "庐山", 29.599640, 115.874340],
        ["heshen_03", "九江", 29.706650, 116.001560]
      ]
    },
    {
      id: "lushan_nanchangdong",
      name: "庐山—南昌东通道",
      stations: [
        ["wujiu_lushan", "庐山", 29.599640, 115.874340],
        ["changjiu_lushannan", "庐山南", 29.407750, 115.862760],
        ["changjiu_gongqingchengdong", "共青城东", 29.177570, 115.857220],
        ["changjiu_changbeiairport", "昌北机场", 28.858200, 115.912950],
        ["changjiu_nanchangdong", "南昌东", 28.617240, 116.016160]
      ]
    },
    {
      id: "jiujiang_nanchangxi",
      name: "九江—南昌西通道",
      stations: [
        ["wujiu_lushan", "庐山", 29.599640, 115.874340],
        ["changjiu_dean", "德安", 29.311780, 115.761890],
        ["changjiu_gongqingcheng", "共青城", 29.245660, 115.769750],
        ["changjiu_yongxiu", "永修", 29.022890, 115.810900],
        ["heshen_04", "南昌西", 28.625730, 115.787710]
      ]
    },
    {
      id: "fuyangxi_huangzhou",
      name: "阜阳西—黄州通道",
      stations: [
        ["shanghehang_03", "阜阳西", 32.88494, 115.74763],
        ["fuhuang_funan", "阜南", 32.640560, 115.548610],
        ["fuhuang_huaibinnan", "淮滨南", 32.390000, 115.450000],
        ["nanxinhe_huangchuannan", "潢川南", 32.080000, 115.045000],
        ["fuhuang_xinxianbei", "新县北", 31.678000, 114.885000],
        ["fuhuang_hongan", "红安北", 31.287000, 114.725000],
        ["fuhuang_machengxi", "麻城西", 31.150000, 114.900000],
        ["fuhuang_wuhanxinzhou", "武汉新洲", 30.835000, 114.845000],
        ["fuhuang_huangzhou", "黄州", 30.588900, 115.000210]
      ]
    },
    {
      id: "huangzhou_ezhou",
      name: "黄州—鄂州通道",
      stations: [
        ["fuhuang_huangzhou", "黄州", 30.588900, 115.000210],
        ["wujiu_ezhou", "鄂州", 30.364240, 114.861330]
      ]
    }
  ];

  const viewport = document.getElementById("viewport");
  const gridLayer = document.getElementById("gridLayer");
  const railwayLayer = document.getElementById("railwayLayer");
  const mapStage = document.getElementById("mapStage");
  const mapSvg = document.getElementById("mapSvg");
  const entryList = document.getElementById("entryList");
  const searchInput = document.getElementById("searchInput");
  const pageNote = document.getElementById("pageNote");
  const selectionReadout = document.getElementById("selectionReadout");
  const stationById = new Map();
  const corridors = CORRIDOR_DEFS.map((corridor) => ({
    id: corridor.id,
    name: corridor.name,
    type: corridor.type || "high_speed",
    stations: corridor.stations.map(([id, name, lat, lon]) => {
      if (stationById.has(id)) return stationById.get(id);
      const station = { id, name, city: id === "hewu_nanxi" ? "金寨" : (CITY_BY_NAME[name] || ""), lat, lon };
      stationById.set(id, station);
      return station;
    })
  }));
  const beijingListIds = new Set(BEIJING_STATION_IDS);
  const replacementAnchors = [...stationById.values()].filter((station) => !beijingListIds.has(station.id));
  collectBeijingStations().forEach((station) => {
    if (stationById.has(station.id)) return;
    const nearestKm = replacementAnchors.length
      ? Math.min(...replacementAnchors.map((anchor) => distanceKm(station, anchor)))
      : Infinity;
    if (nearestKm <= CLOSE_REPLACE_KM && !KEPT_NEAR_IDS.has(station.id)) return;
    stationById.set(station.id, station);
  });
  const highSpeedIds = new Set();
  const conventionalIds = new Set();
  corridors.forEach((corridor) => {
    corridor.stations.forEach((station) => {
      if (corridor.type === "conventional") conventionalIds.add(station.id);
      else highSpeedIds.add(station.id);
    });
  });
  stationById.forEach((station) => {
    station.type = conventionalIds.has(station.id) && !highSpeedIds.has(station.id) ? "conventional" : "high_speed";
  });
  const beijingStations = [...stationById.values()]
    .filter((station) => station.city === "北京")
    .sort((a, b) => a.name.localeCompare(b.name, "zh-CN"));
  const beijingIds = new Set(beijingStations.map((station) => station.id));
  const seenHops = new Set();
  const segments = corridors.flatMap((corridor) => corridor.stations.slice(0, -1).flatMap((station, index) => {
    const hop = `${station.id}>${corridor.stations[index + 1].id}`;
    if (seenHops.has(hop)) return [];
    seenHops.add(hop);
    return [{
      id: `${corridor.id}__${index}`,
      corridorId: corridor.id,
      corridorName: corridor.name,
      type: corridor.type,
      from: station,
      to: corridor.stations[index + 1]
    }];
  }));
  const originalNameOrder = buildOriginalNameOrder();
  const stations = [...stationById.values()].sort((a, b) => stationOrderKey(a) - stationOrderKey(b) || a.name.localeCompare(b.name, "zh-CN"));
  const state = {
    x: 0,
    y: 0,
    scale: 1,
    searchQuery: "",
    selectedSegmentId: null,
    selectedStationId: null,
    dragging: false,
    pointer: null,
    dragMoved: false
  };
  const stationNodes = new Map();
  const stationGeo = new Map();
  const routeNodes = new Map();
  let routeLayer = null;
  let denseStationIds = new Set();
  let stationMarkerScale = null;
  let searchFrame = 0;
  let skipClearOnPointerUp = false;

  function buildOriginalNameOrder() {
    const lineIds = new Set(RAILWAYS.map((line) => line.id));
    const children = new Map();
    RAILWAYS.forEach((line) => {
      if (!line.parentLineId || !lineIds.has(line.parentLineId)) return;
      const siblings = children.get(line.parentLineId) || [];
      siblings.push(line);
      children.set(line.parentLineId, siblings);
    });
    const ordered = [];
    const visited = new Set();
    const append = (line) => {
      if (visited.has(line.id)) return;
      visited.add(line.id);
      ordered.push(line);
      (children.get(line.id) || []).forEach(append);
    };
    RAILWAYS.forEach((line) => {
      if (!line.parentLineId || !lineIds.has(line.parentLineId)) append(line);
    });
    RAILWAYS.forEach(append);
    const names = [];
    const seen = new Set();
    ordered.forEach((line) => line.stations.forEach((station) => {
      if (seen.has(station.id)) return;
      seen.add(station.id);
      names.push(station.name);
    }));
    return names;
  }

  function stationOrderKey(station) {
    const orderName = ORDER_NAME_ALIAS[station.name] || station.name;
    const ownIndex = originalNameOrder.indexOf(orderName);
    return ownIndex >= 0 ? ownIndex : originalNameOrder.length + 1;
  }

  function collectBeijingStations() {
    const wanted = new Set(BEIJING_STATION_IDS);
    const byId = new Map();
    RAILWAYS.forEach((line) => {
      if (line.type !== "high_speed") return;
      line.stations.forEach((station) => {
        if (!wanted.has(station.id) || byId.has(station.id)) return;
        byId.set(station.id, {
          id: station.id,
          name: station.name,
          city: station.city,
          lat: station.lat,
          lon: station.lon
        });
      });
    });
    return [...byId.values()].sort((a, b) => a.name.localeCompare(b.name, "zh-CN"));
  }

  const svgNode = (tag, attrs = {}) => {
    const node = document.createElementNS(SVG_NS, tag);
    Object.entries(attrs).forEach(([key, value]) => node.setAttribute(key, String(value)));
    return node;
  };

  function selectedSegment() {
    return segments.find((segment) => segment.id === state.selectedSegmentId) || null;
  }

  function corridorById(corridorId) {
    return corridors.find((corridor) => corridor.id === corridorId) || null;
  }

  function rawProject({ lat, lon }) {
    const x = 50 + ((lon - VIEW.left) / (VIEW.right - VIEW.left)) * 1100;
    const y = 700 - ((lat - VIEW.bottom) / (VIEW.top - VIEW.bottom)) * 640;
    return { x, y };
  }

  function project(point) {
    const raw = rawProject(point);
    const focus = rawProject(MAP_FOCUS);
    return {
      x: focus.x + (raw.x - focus.x) * MAP_LAYOUT_SCALE,
      y: focus.y + (raw.y - focus.y) * MAP_LAYOUT_SCALE
    };
  }

  function renderGrid() {
    gridLayer.replaceChildren();
    for (let lon = 40; lon <= 150; lon += 10) {
      const x = project({ lat: VIEW.bottom, lon }).x;
      gridLayer.appendChild(svgNode("line", { x1: x, y1: 60, x2: x, y2: 700, class: "grid-line" }));
      const label = svgNode("text", { x: x + 4, y: 718, class: "grid-label" });
      label.textContent = `${lon}°E`;
      gridLayer.appendChild(label);
    }
    for (let lat = -10; lat <= 60; lat += 5) {
      const y = project({ lat, lon: VIEW.left }).y;
      gridLayer.appendChild(svgNode("line", { x1: 50, y1: y, x2: 1150, y2: y, class: "grid-line" }));
      const label = svgNode("text", { x: 26, y: y + 4, class: "grid-label" });
      label.textContent = `${lat}°N`;
      gridLayer.appendChild(label);
    }
  }

  function updateTransform() {
    viewport.setAttribute("transform", `translate(${state.x} ${state.y}) scale(${state.scale})`);
    railwayLayer.classList.toggle("hide-station-labels", state.scale < STATION_LABEL_MIN_ZOOM);
    const nextMarkerScale = state.scale < STATION_LABEL_MIN_ZOOM ? STATION_LABEL_MIN_ZOOM / state.scale : 1;
    if (nextMarkerScale !== stationMarkerScale) {
      stationMarkerScale = nextMarkerScale;
      stationNodes.forEach((group) => {
        Object.entries(STATION_RADII).forEach(([selector, radius]) => {
          group.querySelector(selector)?.setAttribute("r", String(radius * stationMarkerScale));
        });
      });
    }
    document.getElementById("zoomReadout").textContent = `${Math.round(state.scale * 100)}%`;
  }

  function distanceKm(a, b) {
    const toRad = Math.PI / 180;
    const dLat = (b.lat - a.lat) * toRad;
    const dLon = (b.lon - a.lon) * toRad;
    const lat1 = a.lat * toRad;
    const lat2 = b.lat * toRad;
    const h = Math.sin(dLat / 2) ** 2 + Math.cos(lat1) * Math.cos(lat2) * Math.sin(dLon / 2) ** 2;
    return 6371 * 2 * Math.asin(Math.min(1, Math.sqrt(h)));
  }

  function rebuildDenseStationIds() {
    const ids = [...stationGeo.keys()];
    const dense = new Set();
    for (let i = 0; i < ids.length; i += 1) {
      const a = stationGeo.get(ids[i]);
      for (let j = i + 1; j < ids.length; j += 1) {
        const b = stationGeo.get(ids[j]);
        if (distanceKm(a, b) <= LABEL_DENSE_KM) {
          dense.add(ids[i]);
          dense.add(ids[j]);
        }
      }
    }
    denseStationIds = dense;
  }

  function litStationIds() {
    const segment = selectedSegment();
    if (segment) return new Set([segment.from.id, segment.to.id]);
    return state.selectedStationId ? new Set([state.selectedStationId]) : new Set();
  }

  function updateDenseLabels() {
    const lit = litStationIds();
    stationNodes.forEach((group, stationId) => {
      const label = group.querySelector(".railway-label");
      const suppress = denseStationIds.has(stationId) && !lit.has(stationId);
      group.classList.toggle("label-suppressed", suppress);
      if (label) {
        if (suppress) label.setAttribute("display", "none");
        else label.removeAttribute("display");
      }
    });
  }

  function renderStations() {
    railwayLayer.replaceChildren();
    stationNodes.clear();
    stationGeo.clear();
    const hitLayer = svgNode("g", { class: "railway-hit-layer" });
    routeLayer = svgNode("g", { class: "railway-route-visual-layer" });
    routeNodes.clear();
    const stationVisualLayer = svgNode("g", { class: "railway-station-visual-layer" });
    segments.forEach((segment) => {
      const from = project(segment.from);
      const to = project(segment.to);
      const points = `${from.x},${from.y} ${to.x},${to.y}`;
      hitLayer.appendChild(svgNode("polyline", { points, class: "railway-route-hit", "data-id": segment.id }));
      const route = svgNode("polyline", { points, class: `railway-route ${segment.type}`, "data-id": segment.id });
      routeNodes.set(segment.id, route);
      routeLayer.appendChild(route);
    });
    stations.forEach((station) => {
      const { x, y } = project(station);
      const group = svgNode("g", { class: `railway-station ${station.type}`, "data-id": station.id });
      group.appendChild(svgNode("circle", { cx: x, cy: y, r: STATION_RADII[".railway-hit"], class: "railway-hit" }));
      group.appendChild(svgNode("circle", { cx: x, cy: y, r: STATION_RADII[".railway-halo"], class: "railway-halo" }));
      group.appendChild(svgNode("circle", { cx: x, cy: y, r: STATION_RADII[".railway-core"], class: "railway-core" }));
      const label = svgNode("text", { x, y: y + 32, class: "railway-label" });
      label.textContent = station.name;
      group.appendChild(label);
      stationNodes.set(station.id, group);
      stationGeo.set(station.id, { lat: station.lat, lon: station.lon });
      stationVisualLayer.appendChild(group);
    });
    railwayLayer.append(hitLayer, routeLayer, stationVisualLayer);
    stationMarkerScale = null;
    rebuildDenseStationIds();
    updateSegmentLine();
    updateTransform();
  }

  function updateSegmentLine() {
    routeNodes.forEach((route, segmentId) => {
      const selected = segmentId === state.selectedSegmentId;
      route.classList.toggle("selected", selected);
      if (selected && routeLayer) routeLayer.appendChild(route);
    });
  }

  function updateMapSelection() {
    const segment = selectedSegment();
    const lit = litStationIds();
    stationNodes.forEach((group, stationId) => {
      group.classList.toggle("selected", lit.has(stationId));
      group.classList.remove("dimmed");
    });
    const stationVisualLayer = railwayLayer.querySelector(".railway-station-visual-layer");
    lit.forEach((stationId) => {
      const node = stationNodes.get(stationId);
      if (node && stationVisualLayer) stationVisualLayer.appendChild(node);
    });
    updateDenseLabels();
    if (segment) selectionReadout.textContent = `${segment.from.name} — ${segment.to.name}`;
    else if (state.selectedStationId) selectionReadout.textContent = stationById.get(state.selectedStationId)?.name || "未选择";
    else selectionReadout.textContent = "未选择";
  }

  function updateListSelection() {
    entryList.querySelectorAll(".railway-row").forEach((row) => {
      row.classList.toggle("active", row.dataset.stationId === state.selectedStationId);
    });
    entryList.querySelector(".railway-row.active")?.scrollIntoView({ block: "nearest" });
  }

  function queryMatches(values) {
    return values.some((value) => String(value || "").toLowerCase().includes(state.searchQuery));
  }

  function visibleStations() {
    if (!state.searchQuery) return stations;
    return stations.filter((station) => queryMatches([station.name, station.city]));
  }

  function renderList() {
    entryList.replaceChildren();
    const stationRows = visibleStations();
    document.getElementById("entryCount").textContent = stationRows.length;
    pageNote.textContent = state.searchQuery
      ? `匹配到 ${stationRows.length} 个铁路站点，地图仍显示全部站点。`
      : `当前显示 ${stations.length} 个铁路站点。`;
    if (!stationRows.length) {
      const empty = document.createElement("div");
      empty.className = "empty-list";
      empty.textContent = "没有匹配的铁路站点";
      entryList.appendChild(empty);
      return;
    }
    const fragment = document.createDocumentFragment();
    stationRows.forEach((station) => fragment.appendChild(stationRow(station)));
    entryList.appendChild(fragment);
    updateListSelection();
  }

  function stationRow(station) {
    const row = document.createElement("button");
    row.type = "button";
    row.className = `airport-row railway-row railway-station-row${station.type === "conventional" ? " railway-row-conventional" : ""}`;
    row.dataset.stationId = station.id;
    const dot = document.createElement("i");
    dot.className = "row-dot railway-row-dot";
    const main = document.createElement("span");
    main.className = "row-main";
    const name = document.createElement("span");
    name.className = "row-name";
    name.textContent = station.name;
    const detail = document.createElement("span");
    detail.className = "row-city";
    detail.textContent = station.city;
    main.append(name, detail);
    row.append(dot, main);
    return row;
  }

  function segmentRow(segment) {
    const row = document.createElement("button");
    row.type = "button";
    row.className = "airport-row railway-row railway-station-row";
    row.dataset.segmentId = segment.id;
    const dot = document.createElement("i");
    dot.className = "row-dot railway-row-dot";
    const main = document.createElement("span");
    main.className = "row-main";
    const name = document.createElement("span");
    name.className = "row-name";
    name.textContent = `${segment.from.name} — ${segment.to.name}`;
    const detail = document.createElement("span");
    detail.className = "row-city";
    detail.textContent = "相邻段";
    main.append(name, detail);
    row.append(dot, main);
    return row;
  }

  function fitStations(items, maxScale = MAX_ZOOM) {
    if (!items.length) return;
    const points = items.map(project);
    const minX = Math.min(...points.map((point) => point.x));
    const maxX = Math.max(...points.map((point) => point.x));
    const minY = Math.min(...points.map((point) => point.y));
    const maxY = Math.max(...points.map((point) => point.y));
    const spanX = Math.max(maxX - minX, 120);
    const spanY = Math.max(maxY - minY, 120);
    state.scale = Math.max(MIN_ZOOM, Math.min(maxScale, Math.min(1040 / spanX, 600 / spanY)));
    state.x = 600 - ((minX + maxX) / 2) * state.scale;
    state.y = 380 - ((minY + maxY) / 2) * state.scale;
    updateTransform();
  }

  function selectSegment(segmentId) {
    state.selectedSegmentId = segmentId;
    state.selectedStationId = null;
    updateSegmentLine();
    updateMapSelection();
    updateListSelection();
  }

  function focusBeijing() {
    state.selectedSegmentId = null;
    state.selectedStationId = null;
    updateSegmentLine();
    updateMapSelection();
    updateListSelection();
    fitStations(beijingStations);
  }

  function centerOnStation(station) {
    const point = project(station);
    state.scale = 1;
    state.x = 600 - point.x;
    state.y = 380 - point.y;
    updateTransform();
  }

  function selectStation(stationId, center) {
    state.selectedSegmentId = null;
    state.selectedStationId = stationId;
    updateSegmentLine();
    updateMapSelection();
    updateListSelection();
    const station = stationById.get(stationId);
    if (station && center) centerOnStation(station);
  }

  function clearSelection() {
    state.selectedSegmentId = null;
    state.selectedStationId = null;
    updateSegmentLine();
    updateMapSelection();
    updateListSelection();
  }

  function preferredSegmentForStation(stationId) {
    if (beijingIds.has(stationId)) return null;
    const outgoing = segments.filter((segment) => segment.from.id === stationId);
    if (outgoing.length === 1) return outgoing[0];
    if (outgoing.length > 1) return null;
    const incoming = segments.filter((segment) => segment.to.id === stationId);
    return incoming.length === 1 ? incoming[0] : null;
  }

  function resetView() {
    searchInput.value = "";
    state.searchQuery = "";
    clearSelection();
    renderList();
    fitStations(stations);
  }

  function zoomAt(nextScale, clientX, clientY) {
    const rect = mapSvg.getBoundingClientRect();
    const pointX = ((clientX - rect.left) / rect.width) * 1200;
    const pointY = ((clientY - rect.top) / rect.height) * 760;
    const oldScale = state.scale;
    state.scale = Math.max(MIN_ZOOM, Math.min(MAX_ZOOM, nextScale));
    state.x = pointX - ((pointX - state.x) / oldScale) * state.scale;
    state.y = pointY - ((pointY - state.y) / oldScale) * state.scale;
    updateTransform();
  }

  mapStage.addEventListener("wheel", (event) => {
    event.preventDefault();
    zoomAt(state.scale * Math.exp(-event.deltaY * 0.001), event.clientX, event.clientY);
  }, { passive: false });

  railwayLayer.addEventListener("pointerdown", (event) => {
    if (event.button !== 0) return;
    const station = event.target.closest(".railway-station");
    const route = event.target.closest(".railway-route-hit");
    if (!station && !route) return;
    event.preventDefault();
    event.stopPropagation();
    skipClearOnPointerUp = true;
    if (station) selectStation(station.dataset.id, false);
    else selectSegment(route.dataset.id);
  });

  entryList.addEventListener("click", (event) => {
    const row = event.target.closest(".railway-row");
    if (!row?.dataset.stationId) return;
    selectStation(row.dataset.stationId, true);
  });

  mapStage.addEventListener("pointerdown", (event) => {
    if (event.button !== 0) return;
    skipClearOnPointerUp = false;
    mapStage.focus();
    state.dragging = true;
    state.dragMoved = false;
    state.pointer = { x: event.clientX, y: event.clientY };
    mapStage.classList.add("dragging");
    mapStage.setPointerCapture(event.pointerId);
  });
  mapStage.addEventListener("pointermove", (event) => {
    if (!state.dragging || !state.pointer) return;
    state.x += event.clientX - state.pointer.x;
    state.y += event.clientY - state.pointer.y;
    if (Math.abs(event.clientX - state.pointer.x) > 3 || Math.abs(event.clientY - state.pointer.y) > 3) state.dragMoved = true;
    state.pointer = { x: event.clientX, y: event.clientY };
    updateTransform();
  });
  const endDrag = (event) => {
    if (!state.dragging) return;
    state.dragging = false;
    state.pointer = null;
    mapStage.classList.remove("dragging");
    if (event.pointerId !== undefined && mapStage.hasPointerCapture(event.pointerId)) mapStage.releasePointerCapture(event.pointerId);
    if (!state.dragMoved && !skipClearOnPointerUp) clearSelection();
    skipClearOnPointerUp = false;
  };
  mapStage.addEventListener("pointerup", endDrag);
  mapStage.addEventListener("pointercancel", endDrag);

  mapStage.addEventListener("keydown", (event) => {
    const key = event.key.toLowerCase();
    const step = event.shiftKey ? 100 : 48;
    const moves = { w: [0, step], a: [step, 0], s: [0, -step], d: [-step, 0] };
    if (!moves[key]) return;
    event.preventDefault();
    state.x += moves[key][0];
    state.y += moves[key][1];
    updateTransform();
  });

  searchInput.addEventListener("input", () => {
    state.searchQuery = searchInput.value.trim().toLowerCase();
    cancelAnimationFrame(searchFrame);
    searchFrame = requestAnimationFrame(renderList);
  });
  document.getElementById("resetButton").addEventListener("click", resetView);
  document.getElementById("zoomInButton").addEventListener("click", () => zoomAt(state.scale * 1.2, mapStage.getBoundingClientRect().left + mapStage.clientWidth / 2, mapStage.getBoundingClientRect().top + mapStage.clientHeight / 2));
  document.getElementById("zoomOutButton").addEventListener("click", () => zoomAt(state.scale / 1.2, mapStage.getBoundingClientRect().left + mapStage.clientWidth / 2, mapStage.getBoundingClientRect().top + mapStage.clientHeight / 2));

  renderGrid();
  renderStations();
  renderList();
  fitStations(stations);
})();
